; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22test\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22peer\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22indirectimport \22"
module asm "\09.ascii \22proto\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "./testCode.go", directory: "/gocodes/errRangeMap")
!5 = !{}
!6 = !{!7, !30}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "command..z2dline..z2darguments.myMap", linkageName: "command..z2dline..z2darguments.myMap", scope: !3, file: !9, line: 14, type: !10, isLocal: true, isDefinition: true)
!9 = !DIFile(filename: "testCode.go", directory: ".")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !12, line: 1, size: 384, align: 8, elements: !13)
!12 = !DIFile(filename: "<built-in>", directory: "")
!13 = !{!14, !16, !18, !19, !21, !23, !26, !27, !29}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !12, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !12, line: 1, baseType: !20, size: 16, align: 16, offset: 80)
!20 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !12, line: 1, baseType: !22, size: 32, align: 32, offset: 96)
!22 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "void")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !12, line: 1, baseType: !28, size: 64, align: 64, offset: 256)
!28 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 320)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !12, line: 1, type: !32, isLocal: false, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !33, size: 128, align: 8, elements: !34)
!33 = !DIFile(filename: "", directory: "")
!34 = !{!35, !37, !41, !42, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !33, line: 1, baseType: !36, size: 8, align: 8)
!36 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !33, line: 1, baseType: !38, size: 24, align: 8, offset: 8)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 1, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 3)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !33, line: 1, baseType: !36, size: 8, align: 8, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !33, line: 1, baseType: !36, size: 8, align: 8, offset: 40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !33, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!45 = distinct !DISubprogram(name: "test.command..z2dline..z2darguments..import", linkageName: "command..z2dline..z2darguments..import", scope: null, file: !9, line: 1, type: !46, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!46 = !DISubroutineType(types: !47)
!47 = !{!25}
!48 = !DILocation(line: 1, column: 1, scope: !49)
!49 = !DILexicalBlockFile(scope: !45, file: !12, discriminator: 0)
!50 = !DILocation(line: 14, column: 13, scope: !51)
!51 = !DILexicalBlockFile(scope: !45, file: !9, discriminator: 0)
!52 = !DILocation(line: 14, column: 5, scope: !51)
!53 = distinct !DISubprogram(name: "test.Init..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Init", scope: null, file: !9, line: 23, type: !54, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !76, !76, !78}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !9, line: 10, size: 640, align: 8, elements: !57)
!57 = !{!58, !60, !66, !72, !74, !75}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !9, line: 10, baseType: !59, size: 32, align: 32)
!59 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !9, line: 10, baseType: !61, size: 128, align: 64, offset: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !12, line: 1, size: 128, align: 8, elements: !62)
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !12, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !12, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 192)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !33, size: 192, align: 8, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !64, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !33, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !33, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !9, line: 10, baseType: !73, align: 8, offset: 384)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !12, line: 1, align: 8, elements: !5)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !9, line: 10, baseType: !59, size: 32, align: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "BadChaincode", file: !9, line: 21, align: 8, elements: !5)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !9, line: 10, size: 128, align: 8, elements: !79)
!79 = !{!80, !232}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 10, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !33, size: 2432, align: 8, elements: !83)
!83 = !{!84, !123, !146, !150, !154, !162, !170, !171, !172, !173, !177, !184, !233, !237, !264, !268, !269, !273, !274, !278, !294, !306, !310, !314, !318, !319, !323, !324, !328, !335, !336, !343, !347, !351, !355, !356, !357, !358}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 10, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !12, line: 1, size: 512, align: 8, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !103, !104, !106, !122}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !12, line: 1, baseType: !28, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !12, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !12, line: 1, baseType: !22, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !12, line: 1, baseType: !17, size: 8, align: 8, offset: 184)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !12, line: 1, baseType: !96, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !12, line: 1, size: 64, align: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !12, line: 1, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!36, !24, !24}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !12, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !12, line: 1, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !12, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !12, line: 1, size: 320, align: 8, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !12, line: 1, baseType: !105, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !12, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !12, line: 1, baseType: !113, size: 192, align: 64, offset: 128)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !33, size: 192, align: 8, elements: !114)
!114 = !{!115, !70, !71}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !12, line: 1, size: 320, align: 8, elements: !118)
!118 = !{!110, !111, !119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !33, line: 10, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !24, !61, !143}
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !33, size: 256, align: 8, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !61, size: 128, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !131, size: 128, align: 64, offset: 128)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !12, line: 1, size: 128, align: 8, elements: !132)
!132 = !{!133, !142}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !12, line: 1, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !33, size: 128, align: 8, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 1, baseType: !85, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !33, line: 1, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!61, !24}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !12, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !33, size: 192, align: 8, elements: !144)
!144 = !{!145, !70, !71}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !105, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !33, line: 10, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!131, !24, !61, !61}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !33, line: 10, baseType: !151, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!131, !24, !61}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !33, line: 10, baseType: !155, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !24}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !33, size: 192, align: 8, elements: !159)
!159 = !{!160, !70, !71}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !33, line: 10, baseType: !163, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !24}
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !33, size: 320, align: 8, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 11, baseType: !67, size: 192, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 11, baseType: !131, size: 128, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !33, line: 10, baseType: !163, size: 64, align: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !33, line: 10, baseType: !139, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !33, line: 10, baseType: !163, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !33, line: 10, baseType: !174, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!10, !24}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !33, line: 10, baseType: !178, size: 64, align: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !24}
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !33, size: 320, align: 8, elements: !182)
!182 = !{!129, !183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !143, size: 192, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !33, line: 10, baseType: !185, size: 64, align: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !24, !61}
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !33, size: 256, align: 8, elements: !189)
!189 = !{!190, !130}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !191, size: 128, align: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !9, line: 10, size: 128, align: 8, elements: !192)
!192 = !{!193, !232}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 10, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !33, size: 256, align: 8, elements: !196)
!196 = !{!84, !197, !201, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !33, line: 10, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!131, !24}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !33, line: 10, baseType: !202, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!36, !24}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !33, line: 10, baseType: !206, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !24}
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !33, size: 192, align: 8, elements: !210)
!210 = !{!211, !231}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !9, line: 10, size: 704, align: 8, elements: !214)
!214 = !{!215, !216, !217, !227, !228, !229, !230}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !9, line: 10, baseType: !61, size: 128, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !9, line: 10, baseType: !218, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !9, line: 10, size: 384, align: 8, elements: !220)
!220 = !{!221, !223, !224, !225, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", file: !9, line: 10, baseType: !222, size: 64, align: 64)
!222 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Nanos", file: !9, line: 10, baseType: !59, size: 32, align: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !9, line: 10, baseType: !73, align: 8, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !9, line: 10, baseType: !59, size: 32, align: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "IsDelete", file: !9, line: 10, baseType: !36, size: 8, align: 8, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !9, line: 10, baseType: !73, align: 8, offset: 392)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !9, line: 10, baseType: !59, size: 32, align: 32, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !131, size: 128, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateData", file: !33, line: 10, baseType: !234, size: 64, align: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!166, !24, !61, !61}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByPartialCompositeKey", file: !33, line: 10, baseType: !238, size: 64, align: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!241, !24, !61, !61, !143}
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,error}", file: !33, size: 256, align: 8, elements: !242)
!242 = !{!243, !130}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !244, size: 128, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "StateQueryIteratorInterface", file: !9, line: 10, size: 128, align: 8, elements: !245)
!245 = !{!246, !232}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 10, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KV,error}}", file: !33, size: 256, align: 8, elements: !249)
!249 = !{!84, !197, !201, !250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !33, line: 10, baseType: !251, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!254, !24}
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KV,error}", file: !33, size: 192, align: 8, elements: !255)
!255 = !{!256, !231}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "KV", file: !9, line: 10, size: 704, align: 8, elements: !259)
!259 = !{!260, !261, !262, !263, !229, !230}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", file: !9, line: 10, baseType: !61, size: 128, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !9, line: 10, baseType: !61, size: 128, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !9, line: 10, baseType: !73, align: 8, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByRange", file: !33, line: 10, baseType: !265, size: 64, align: 64, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!241, !24, !61, !61, !61}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataHash", file: !33, line: 10, baseType: !234, size: 64, align: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataQueryResult", file: !33, line: 10, baseType: !270, size: 64, align: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!241, !24, !61, !61}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataValidationParameter", file: !33, line: 10, baseType: !234, size: 64, align: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResult", file: !33, line: 10, baseType: !275, size: 64, align: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!241, !24, !61}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResultWithPagination", file: !33, line: 10, baseType: !279, size: 64, align: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !24, !61, !59, !61}
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,*QueryResponseMetadata,error}", file: !33, size: 320, align: 8, elements: !283)
!283 = !{!243, !284, !293}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !285, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueryResponseMetadata", file: !9, line: 10, size: 448, align: 8, elements: !287)
!287 = !{!288, !289, !290, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "FetchedRecordsCount", file: !9, line: 10, baseType: !59, size: 32, align: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Bookmark", file: !9, line: 10, baseType: !61, size: 128, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !9, line: 10, baseType: !73, align: 8, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !9, line: 10, baseType: !59, size: 32, align: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !131, size: 128, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "GetSignedProposal", file: !33, line: 10, baseType: !295, size: 64, align: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !24}
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignedProposal,error}", file: !33, size: 192, align: 8, elements: !299)
!299 = !{!300, !231}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignedProposal", file: !9, line: 10, size: 640, align: 8, elements: !303)
!303 = !{!304, !305, !72, !74, !75}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ProposalBytes", file: !9, line: 10, baseType: !67, size: 192, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !9, line: 10, baseType: !67, size: 192, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "GetState", file: !33, line: 10, baseType: !307, size: 64, align: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!166, !24, !61}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKey", file: !33, line: 10, baseType: !311, size: 64, align: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!241, !24, !61, !143}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKeyWithPagination", file: !33, line: 10, baseType: !315, size: 64, align: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!282, !24, !61, !143, !59, !61}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRange", file: !33, line: 10, baseType: !270, size: 64, align: 64, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRangeWithPagination", file: !33, line: 10, baseType: !320, size: 64, align: 64, offset: 1600)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!282, !24, !61, !61, !59, !61}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateValidationParameter", file: !33, line: 10, baseType: !307, size: 64, align: 64, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringArgs", file: !33, line: 10, baseType: !325, size: 64, align: 64, offset: 1728)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!143, !24}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "GetTransient", file: !33, line: 10, baseType: !329, size: 64, align: 64, offset: 1792)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !24}
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Values,error}", file: !33, size: 192, align: 8, elements: !333)
!333 = !{!334, !231}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !10, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxID", file: !33, line: 10, baseType: !139, size: 64, align: 64, offset: 1856)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxTimestamp", file: !33, line: 10, baseType: !337, size: 64, align: 64, offset: 1920)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !24}
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Timestamp,error}", file: !33, size: 192, align: 8, elements: !341)
!341 = !{!342, !231}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !218, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "InvokeChaincode", file: !33, line: 10, baseType: !344, size: 64, align: 64, offset: 1984)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!56, !24, !61, !158, !61}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PutPrivateData", file: !33, line: 10, baseType: !348, size: 64, align: 64, offset: 2048)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!131, !24, !61, !61, !67}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "PutState", file: !33, line: 10, baseType: !352, size: 64, align: 64, offset: 2112)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!131, !24, !61, !67}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "SetEvent", file: !33, line: 10, baseType: !352, size: 64, align: 64, offset: 2176)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "SetPrivateDataValidationParameter", file: !33, line: 10, baseType: !348, size: 64, align: 64, offset: 2240)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "SetStateValidationParameter", file: !33, line: 10, baseType: !352, size: 64, align: 64, offset: 2304)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "SplitCompositeKey", file: !33, line: 10, baseType: !359, size: 64, align: 64, offset: 2368)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!362, !24, !61}
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int},error}", file: !33, size: 448, align: 8, elements: !363)
!363 = !{!129, !183, !364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !33, line: 10, baseType: !131, size: 128, align: 64, offset: 320)
!365 = !DILocalVariable(name: "t", arg: 1, scope: !53, file: !9, line: 23, type: !76)
!366 = !DILocation(line: 0, scope: !53)
!367 = !DILocalVariable(name: "stub", arg: 2, scope: !53, file: !9, line: 23, type: !78)
!368 = !DILocation(line: 24, column: 14, scope: !53)
!369 = !DILocation(line: 24, column: 2, scope: !53)
!370 = distinct !DISubprogram(name: "test.Invoke..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Invoke", scope: null, file: !9, line: 27, type: !54, scopeLine: 27, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!371 = !DILocalVariable(name: "t", arg: 1, scope: !370, file: !9, line: 27, type: !76)
!372 = !DILocation(line: 0, scope: !370)
!373 = !DILocalVariable(name: "stub", arg: 2, scope: !370, file: !9, line: 27, type: !78)
!374 = !DILocalVariable(name: "returnValue", scope: !375, file: !9, line: 28, type: !15)
!375 = distinct !DILexicalBlock(scope: !370, file: !9, line: 27, column: 1)
!376 = !DILocalVariable(name: "i", scope: !377, file: !9, line: 29, type: !15)
!377 = distinct !DILexicalBlock(scope: !375, file: !9, line: 29, column: 2)
!378 = !DILocation(line: 0, scope: !375)
!379 = !DILocalVariable(name: "ii", scope: !377, file: !9, line: 29, type: !15)
!380 = !DILocation(line: 29, column: 2, scope: !377)
!381 = !DILocation(line: 0, scope: !377)
!382 = !DILocation(line: 30, column: 28, scope: !377)
!383 = !DILocation(line: 30, column: 31, scope: !377)
!384 = !DILocation(line: 32, column: 41, scope: !375)
!385 = !DILocation(line: 32, column: 36, scope: !375)
!386 = !DILocation(line: 32, column: 28, scope: !375)
!387 = !DILocation(line: 32, column: 14, scope: !375)
!388 = !DILocation(line: 32, column: 2, scope: !375)
