; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22extstub\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22utils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/kbkontrakt/hlfabric-ccdevkit/utils\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/kbkontrakt/hlfabric-ccdevkit/utils\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./71.go", directory: "/home/ming/go/src/chaincode_repo/github/71")
!5 = !{!6, !75, !88}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "command_x2dline_x2darguments.ErrNotFound", linkageName: "command_x2dline_x2darguments.ErrNotFound", scope: !3, file: !8, line: 28, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "71.go", directory: ".")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !74}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !15, size: 128, align: 8, elements: !16)
!15 = !DIFile(filename: "", directory: "")
!16 = !{!17, !70}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !15, line: 1, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 512, align: 8, elements: !20)
!20 = !{!21, !23, !24, !26, !28, !29, !30, !31, !42, !44, !51, !69}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !25, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 160)
!27 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 168)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 176)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 184)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !40, !40}
!39 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !45, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !43, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !45, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !45, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !58, size: 192, align: 64, offset: 128)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !15, size: 192, align: 8, elements: !59)
!59 = !{!60, !67, !68}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!55, !56, !64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !15, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !15, line: 1, baseType: !50, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !15, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!46, !40}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !10, line: 1, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !15, size: 128, align: 8, elements: !78)
!78 = !{!79, !80, !84, !85, !86}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !15, line: 1, baseType: !39, size: 8, align: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !15, line: 1, baseType: !81, size: 24, align: 8, offset: 8)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, align: 1, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 3, lowerBound: 0)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !15, line: 1, baseType: !39, size: 8, align: 8, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !15, line: 1, baseType: !39, size: 8, align: 8, offset: 40)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !15, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "io.EOF", linkageName: "io.EOF", scope: !3, file: !8, line: 21, type: !9, isLocal: false, isDefinition: true)
!90 = distinct !DISubprogram(name: "command_x2dline_x2darguments..import", scope: null, file: !8, line: 15, type: !91, scopeLine: 15, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!41}
!93 = !{}
!94 = !DILocation(line: 1, column: 1, scope: !95)
!95 = !DILexicalBlockFile(scope: !90, file: !10, discriminator: 0)
!96 = !DILocation(line: 28, column: 26, scope: !97)
!97 = !DILexicalBlockFile(scope: !90, file: !8, discriminator: 0)
!98 = !DILocation(line: 28, column: 5, scope: !97)
!99 = distinct !DISubprogram(name: "command-line-arguments.MarshalStateImpl.CreateCompositeKey..stub", linkageName: "command_x2dline_x2darguments.MarshalStateImpl.CreateCompositeKey..stub", scope: null, file: !8, line: 23, type: !100, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !93)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !106, !106, !46, !121}
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !15, size: 256, align: 8, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !46, size: 128, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !9, size: 128, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "MarshalStateImpl", file: !8, line: 68, size: 256, align: 8, elements: !108)
!108 = !{!109, !1559, !1567}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ChaincodeStubInterface", file: !8, line: 69, baseType: !110, size: 128, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !8, line: 23, size: 128, align: 8, elements: !111)
!111 = !{!112, !403}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void).google.golang.org/protobuf/internal/impl.extensionMap,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{.google.golang.org/protobuf/internal/impl.extensionMap,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !15, size: 2496, align: 8, elements: !115)
!115 = !{!116, !117, !124, !128, !132, !143, !151, !152, !153, !154, !171, !178, !1419, !1423, !1450, !1454, !1455, !1459, !1460, !1464, !1479, !1494, !1498, !1502, !1506, !1507, !1511, !1512, !1516, !1523, !1524, !1531, !1540, !1541, !1545, !1549, !1550, !1551, !1552}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !15, line: 23, baseType: !18, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !15, line: 23, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!102, !40, !46, !121}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !15, size: 192, align: 8, elements: !122)
!122 = !{!123, !67, !68}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !45, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !15, line: 23, baseType: !125, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!9, !40, !46, !46}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !15, line: 23, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!9, !40, !46}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !15, line: 23, baseType: !133, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !40}
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !15, size: 192, align: 8, elements: !137)
!137 = !{!138, !67, !68}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !15, size: 192, align: 8, elements: !141)
!141 = !{!142, !67, !68}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !43, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !15, line: 23, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !40}
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !15, size: 320, align: 8, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !140, size: 192, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !9, size: 128, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !15, line: 23, baseType: !144, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !15, line: 23, baseType: !144, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !15, line: 23, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !40}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !160)
!160 = !{!161, !162, !163, !164, !166, !167, !168, !169, !170}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !50, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !27, size: 8, align: 8, offset: 72)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !165, size: 16, align: 16, offset: 80)
!165 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !25, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !15, line: 23, baseType: !172, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !40}
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !15, size: 320, align: 8, elements: !176)
!176 = !{!104, !177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !121, size: 192, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !15, line: 23, baseType: !179, size: 64, align: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !40, !46}
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !15, size: 256, align: 8, elements: !183)
!183 = !{!184, !105}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !185, size: 128, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !8, line: 23, size: 128, align: 8, elements: !186)
!186 = !{!187, !403}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !15, size: 256, align: 8, elements: !190)
!190 = !{!116, !191, !195, !199}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !15, line: 23, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!9, !40}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!39, !40}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !15, line: 23, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !40}
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !15, size: 192, align: 8, elements: !204)
!204 = !{!205, !901}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !8, line: 23, size: 704, align: 8, elements: !208)
!208 = !{!209, !210, !211, !1414, !1415, !1417, !1418}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !8, line: 23, baseType: !46, size: 128, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 23, baseType: !140, size: 192, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !8, line: 23, baseType: !212, size: 64, align: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !8, line: 23, size: 448, align: 8, elements: !214)
!214 = !{!215, !1409, !1410, !1411, !1413}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 23, baseType: !216, size: 64, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !8, line: 23, size: 64, align: 8, elements: !217)
!217 = !{!218, !220, !229, !236}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !8, line: 23, baseType: !219, align: 8)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !8, line: 23, align: 1, elements: !93)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !8, line: 23, baseType: !221, align: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, align: 8, elements: !227)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !224)
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!227 = !{!228}
!228 = !DISubrange(count: 0, lowerBound: 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !8, line: 23, baseType: !230, align: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, align: 4, elements: !227)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !8, line: 21, size: 64, align: 4, elements: !232)
!232 = !{!233, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 21, baseType: !234, size: 32, align: 32)
!234 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !8, line: 21, baseType: !25, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !8, line: 23, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !8, line: 23, size: 2624, align: 8, elements: !239)
!239 = !{!240, !404, !1201, !1209, !1214, !1215, !1216, !1311}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !8, line: 23, baseType: !241, size: 128, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !8, line: 23, size: 128, align: 8, elements: !242)
!242 = !{!243, !403}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !15, size: 2112, align: 8, elements: !246)
!246 = !{!116, !247, !251, !255, !256, !261, !262, !263, !267, !288, !289, !293, !301, !312, !313, !317, !318, !319, !324, !325, !374, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !398, !399}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!50, !40}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !15, line: 23, baseType: !252, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!39, !40, !241}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !15, line: 23, baseType: !257, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !40}
!260 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !15, line: 23, baseType: !252, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !15, line: 23, baseType: !264, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!241, !40}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !15, line: 23, baseType: !268, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !40, !50}
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !8, line: 23, size: 832, align: 8, elements: !272)
!272 = !{!273, !274, !275, !276, !281, !282, !287}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 23, baseType: !46, size: 128, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !8, line: 23, baseType: !46, size: 128, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 23, baseType: !241, size: 128, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !8, line: 23, baseType: !277, size: 128, align: 64, offset: 384)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !8, line: 23, size: 128, align: 8, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !43, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !8, line: 23, baseType: !22, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 23, baseType: !283, size: 192, align: 64, offset: 576)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !15, size: 192, align: 8, elements: !284)
!284 = !{!285, !67, !68}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !8, line: 23, baseType: !39, size: 8, align: 8, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !15, line: 23, baseType: !290, size: 64, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!271, !40, !283}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !15, line: 23, baseType: !294, size: 64, align: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !40, !46}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !15, size: 896, align: 8, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !271, size: 832, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !39, size: 8, align: 8, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !15, line: 23, baseType: !302, size: 64, align: 64, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!297, !40, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !307)
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!39, !46}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !15, line: 23, baseType: !252, size: 64, align: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !15, line: 23, baseType: !314, size: 64, align: 64, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!241, !40, !50}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !15, line: 23, baseType: !264, size: 64, align: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !15, line: 23, baseType: !320, size: 64, align: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !40}
!323 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 1152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !15, line: 23, baseType: !326, size: 64, align: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !40, !50}
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !8, line: 23, size: 640, align: 8, elements: !330)
!330 = !{!273, !274, !275, !331, !373}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !8, line: 23, baseType: !332, size: 192, align: 64, offset: 384)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 23, size: 192, align: 8, elements: !333)
!333 = !{!334, !370, !371}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !8, line: 23, size: 512, align: 8, elements: !337)
!337 = !{!338, !339, !340, !341, !343, !344, !345, !346, !351, !352, !353, !369}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 23, baseType: !22, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 23, baseType: !22, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 23, baseType: !25, size: 32, align: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 23, baseType: !342, size: 8, align: 8, offset: 160)
!342 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 23, baseType: !27, size: 8, align: 8, offset: 168)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 23, baseType: !27, size: 8, align: 8, offset: 176)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 23, baseType: !27, size: 8, align: 8, offset: 184)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 23, baseType: !347, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !36, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 23, baseType: !43, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 23, baseType: !45, size: 64, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 23, baseType: !354, size: 64, align: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !8, line: 23, size: 320, align: 8, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 23, baseType: !45, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 23, baseType: !45, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 23, baseType: !360, size: 192, align: 64, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !15, size: 192, align: 8, elements: !361)
!361 = !{!362, !67, !68}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !8, line: 23, size: 320, align: 8, elements: !365)
!365 = !{!357, !358, !366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 23, baseType: !40, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !40, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 23, baseType: !40, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 23, baseType: !40, size: 64, align: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !8, line: 23, baseType: !40, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !8, line: 23, baseType: !372, size: 64, align: 64, offset: 128)
!372 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !15, line: 23, baseType: !375, size: 64, align: 64, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !40, !46}
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !15, size: 704, align: 8, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !329, size: 640, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !39, size: 8, align: 8, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !15, line: 23, baseType: !314, size: 64, align: 64, offset: 1664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !15, line: 23, baseType: !390, size: 64, align: 64, offset: 1792)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!22, !40}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !15, line: 23, baseType: !395, size: 64, align: 64, offset: 1920)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!335, !40}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1984)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !15, line: 23, baseType: !400, size: 64, align: 64, offset: 2048)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!354, !40}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !8, line: 23, baseType: !405, size: 128, align: 64, offset: 128)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !406)
!406 = !{!407, !403}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !15, size: 1408, align: 8, elements: !410)
!410 = !{!116, !411, !1127, !1131, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1176, !1177, !1178, !1179, !1180, !1184, !1198, !1199, !1200}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !15, line: 23, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !40}
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !416)
!416 = !{!417, !403}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 320, align: 8, elements: !420)
!420 = !{!116, !421, !1123, !573, !574}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !422, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !40, !442}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !426)
!426 = !{!427, !403}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !15, size: 896, align: 8, elements: !430)
!430 = !{!116, !431, !436, !437, !438, !443, !1057, !550, !746, !1058, !1062, !1080, !754, !1101}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !40}
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !8, line: 23, size: 128, align: 8, elements: !278)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !40}
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 23, size: 128, align: 8, elements: !278)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !444, size: 64, align: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !40}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !8, line: 23, size: 128, align: 8, elements: !448)
!448 = !{!449, !403}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !15, size: 128, align: 8, elements: !452)
!452 = !{!116, !453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !15, line: 23, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !40}
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !8, line: 23, size: 128, align: 8, elements: !458)
!458 = !{!459, !403}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !15, size: 1088, align: 8, elements: !462)
!462 = !{!116, !463, !824, !825, !829, !836, !840, !841, !842, !843, !844, !845, !1021, !1032, !1036, !1040, !1053}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !15, line: 23, baseType: !464, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!41, !40, !467}
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !468)
!468 = !{!469, !403}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !15, size: 2112, align: 8, elements: !472)
!472 = !{!116, !473, !478, !482, !755, !763, !784, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !806, !810, !811, !812, !813, !817, !818, !819, !820, !821, !822, !823}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !15, line: 23, baseType: !474, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !40}
!477 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!405, !40}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !15, line: 23, baseType: !483, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!486, !40}
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !487)
!487 = !{!488, !403}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !15, size: 832, align: 8, elements: !491)
!491 = !{!116, !492, !532, !533, !534, !535, !536, !537, !538, !748, !749, !750, !754}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !15, line: 23, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !40}
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !497)
!497 = !{!498, !403}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 512, align: 8, elements: !501)
!501 = !{!116, !502, !506, !510, !515, !516, !520, !521}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !15, line: 23, baseType: !503, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!467, !40, !46}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !507, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!467, !40, !442}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !15, line: 23, baseType: !511, size: 64, align: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!467, !40, !514}
!514 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !15, line: 23, baseType: !503, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !517, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!467, !40, !50}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!41, !40, !525}
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !8, line: 23, size: 128, align: 8, elements: !526)
!526 = !{!527, !403}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !15, size: 128, align: 8, elements: !530)
!530 = !{!116, !531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !539, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !40}
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !8, line: 23, size: 128, align: 8, elements: !543)
!543 = !{!544, !403}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !15, size: 640, align: 8, elements: !547)
!547 = !{!116, !431, !436, !437, !438, !548, !549, !550, !746, !747}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !551, size: 64, align: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !40}
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !555)
!555 = !{!556, !403}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !15, size: 1216, align: 8, elements: !559)
!559 = !{!116, !560, !561, !575, !576, !597, !598, !599, !617, !618, !619, !620, !621, !622, !623, !624, !628, !704, !745}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !15, line: 23, baseType: !562, size: 64, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !40}
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !566)
!566 = !{!567, !403}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 320, align: 8, elements: !570)
!570 = !{!116, !571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !507, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !517, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !15, line: 23, baseType: !577, size: 64, align: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!580, !40}
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !8, line: 23, size: 128, align: 8, elements: !581)
!581 = !{!582, !403}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 256, align: 8, elements: !585)
!585 = !{!116, !586, !595, !596}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !587, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !40, !50}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !8, line: 23, size: 192, align: 8, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !8, line: 23, baseType: !554, size: 128, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !8, line: 23, baseType: !39, size: 8, align: 8, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !8, line: 23, baseType: !39, size: 8, align: 8, offset: 136)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !15, line: 23, baseType: !600, size: 64, align: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!603, !40}
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !604)
!604 = !{!605, !403}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 320, align: 8, elements: !608)
!608 = !{!116, !609, !613, !573, !574}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !610, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!405, !40, !442}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !614, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!405, !40, !50}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !625, size: 64, align: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!41, !40, !554}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !15, line: 23, baseType: !629, size: 64, align: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !40}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !633)
!633 = !{!634, !403}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 320, align: 8, elements: !637)
!637 = !{!116, !638, !700, !573, !574}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !639, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !40, !442}
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !643)
!643 = !{!644, !403}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !15, size: 768, align: 8, elements: !647)
!647 = !{!116, !431, !436, !437, !648, !690, !691, !692, !693, !694, !695, !699}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !15, line: 23, baseType: !649, size: 64, align: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !40}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !653)
!653 = !{!654, !403}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 320, align: 8, elements: !657)
!657 = !{!116, !658, !686, !573, !574}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !15, line: 23, baseType: !659, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !40, !442}
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !663)
!663 = !{!664, !403}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !15, size: 960, align: 8, elements: !667)
!667 = !{!116, !431, !436, !668, !534, !669, !670, !671, !672, !673, !674, !675, !676, !677, !681}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !678, size: 64, align: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!41, !40, !662}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !40}
!685 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !687, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!662, !40, !50}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !696, size: 64, align: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!41, !40, !642}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!642, !40, !50}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !15, line: 23, baseType: !705, size: 64, align: 64, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !40}
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !8, line: 23, size: 128, align: 8, elements: !709)
!709 = !{!710, !403}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !15, size: 384, align: 8, elements: !713)
!713 = !{!116, !714, !735, !739, !743, !744}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !15, line: 23, baseType: !715, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !40, !542}
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !8, line: 23, size: 960, align: 8, elements: !719)
!719 = !{!720, !727, !728, !729, !730, !731, !732, !733, !734}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 23, baseType: !721, size: 192, align: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !8, line: 23, size: 192, align: 8, elements: !722)
!722 = !{!723, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !50, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !8, line: 23, baseType: !121, size: 192, align: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !8, line: 23, baseType: !46, size: 128, align: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !8, line: 23, baseType: !46, size: 128, align: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !8, line: 23, baseType: !50, size: 64, align: 64, offset: 896)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !15, line: 23, baseType: !736, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!718, !40, !721}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !740, size: 64, align: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!718, !40, !50}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !551, size: 64, align: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !751, size: 64, align: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!41, !40, !486}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !15, line: 23, baseType: !756, size: 64, align: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !40}
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 23, size: 192, align: 8, elements: !760)
!760 = !{!220, !761, !370, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !40, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !8, line: 23, baseType: !87, size: 64, align: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !15, line: 23, baseType: !764, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !40}
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !768)
!768 = !{!769, !403}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !15, size: 768, align: 8, elements: !772)
!772 = !{!116, !431, !436, !437, !438, !773, !691, !778, !779, !694, !780, !699}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !15, line: 23, baseType: !774, size: 64, align: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !40}
!777 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !539, size: 64, align: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !551, size: 64, align: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !781, size: 64, align: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!41, !40, !767}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !15, line: 23, baseType: !785, size: 64, align: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!425, !40}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !15, line: 23, baseType: !802, size: 64, align: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!805, !40}
!805 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !15, line: 23, baseType: !807, size: 64, align: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!467, !40}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !15, line: 23, baseType: !807, size: 64, align: 64, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 1472)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 1536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !15, line: 23, baseType: !814, size: 64, align: 64, offset: 1600)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!514, !40}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 1664)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !539, size: 64, align: 64, offset: 1728)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !551, size: 64, align: 64, offset: 1792)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 1856)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 1920)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 1984)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 2048)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !15, line: 23, baseType: !826, size: 64, align: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!759, !40, !467}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !15, line: 23, baseType: !830, size: 64, align: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !40}
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !8, line: 23, size: 192, align: 8, elements: !834)
!834 = !{!835, !725, !726}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !43, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !15, line: 23, baseType: !837, size: 64, align: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!39, !40, !467}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !15, line: 23, baseType: !826, size: 64, align: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !15, line: 23, baseType: !826, size: 64, align: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !15, line: 23, baseType: !846, size: 64, align: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !40}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !15, size: 384, align: 8, elements: !851)
!851 = !{!852, !853, !854, !869, !887, !993, !1005}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !15, line: 23, baseType: !219, align: 8)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !15, line: 23, baseType: !87, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !15, line: 23, baseType: !855, size: 64, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !865}
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !15, size: 64, align: 8, elements: !863)
!863 = !{!852, !864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !15, line: 23, baseType: !50, size: 64, align: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !15, size: 192, align: 8, elements: !866)
!866 = !{!852, !867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !15, line: 23, baseType: !457, size: 128, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !15, line: 23, baseType: !27, size: 8, align: 8, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !15, line: 23, baseType: !870, size: 64, align: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !883}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !15, size: 320, align: 8, elements: !878)
!878 = !{!879, !150}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !880, size: 192, align: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !15, size: 192, align: 8, elements: !881)
!881 = !{!852, !882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !15, line: 23, baseType: !140, size: 192, align: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !15, size: 384, align: 8, elements: !884)
!884 = !{!852, !867, !885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !15, line: 23, baseType: !140, size: 192, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !15, line: 23, baseType: !27, size: 8, align: 8, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !15, line: 23, baseType: !888, size: 64, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !902}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !15, size: 192, align: 8, elements: !896)
!896 = !{!897, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !898, size: 8, align: 8)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !15, size: 8, align: 1, elements: !899)
!899 = !{!852, !900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !15, line: 23, baseType: !27, size: 8, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !9, size: 128, align: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !15, size: 576, align: 8, elements: !903)
!903 = !{!852, !867, !885, !886, !904, !992}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !15, line: 23, baseType: !905, size: 128, align: 64, offset: 384)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !15, size: 128, align: 8, elements: !906)
!906 = !{!907, !991}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !15, line: 23, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !15, size: 192, align: 8, elements: !910)
!910 = !{!116, !911, !987}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !15, line: 23, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!915, !40, !435}
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !15, size: 256, align: 8, elements: !916)
!916 = !{!917, !105}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !15, line: 23, baseType: !918, size: 128, align: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !8, line: 23, size: 128, align: 8, elements: !919)
!919 = !{!920, !403}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !15, size: 512, align: 8, elements: !923)
!923 = !{!116, !924, !931, !935, !939, !940, !982, !986}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !15, line: 23, baseType: !925, size: 64, align: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !40, !759}
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 23, size: 128, align: 8, elements: !929)
!929 = !{!930, !403}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !18, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !15, line: 23, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!39, !40, !928}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !15, line: 23, baseType: !936, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!39, !40, !759}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !15, line: 23, baseType: !756, size: 64, align: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !15, line: 23, baseType: !941, size: 64, align: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !40}
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !945)
!945 = !{!946, !403}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !15, size: 2240, align: 8, elements: !949)
!949 = !{!116, !473, !478, !482, !755, !763, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !15, line: 23, baseType: !807, size: 64, align: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !15, line: 23, baseType: !785, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !15, line: 23, baseType: !432, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !15, line: 23, baseType: !248, size: 64, align: 64, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !15, line: 23, baseType: !196, size: 64, align: 64, offset: 1216)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 1280)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !15, line: 23, baseType: !802, size: 64, align: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !15, line: 23, baseType: !807, size: 64, align: 64, offset: 1408)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !15, line: 23, baseType: !807, size: 64, align: 64, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !15, line: 23, baseType: !479, size: 64, align: 64, offset: 1536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !15, line: 23, baseType: !439, size: 64, align: 64, offset: 1600)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !15, line: 23, baseType: !814, size: 64, align: 64, offset: 1664)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !15, line: 23, baseType: !40, size: 64, align: 64, offset: 1728)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !15, line: 23, baseType: !539, size: 64, align: 64, offset: 1792)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !15, line: 23, baseType: !551, size: 64, align: 64, offset: 1856)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !15, line: 23, baseType: !522, size: 64, align: 64, offset: 1920)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !15, line: 23, baseType: !464, size: 64, align: 64, offset: 1984)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !15, line: 23, baseType: !682, size: 64, align: 64, offset: 2048)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !15, line: 23, baseType: !71, size: 64, align: 64, offset: 2112)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !15, line: 23, baseType: !979, size: 64, align: 64, offset: 2176)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!918, !40}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ValueOf", file: !15, line: 23, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!759, !40, !928}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Zero", file: !15, line: 23, baseType: !756, size: 64, align: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByNumber", file: !15, line: 23, baseType: !988, size: 64, align: 64, offset: 128)
