; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22keylevelep\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22statebased\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/pkg/statebased\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/pkg/statebased\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./51.go", directory: "/home/ming/go/src/chaincode_repo/github/51")
!5 = !{!6, !29}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "command_x2dline_x2darguments.functions", linkageName: "command_x2dline_x2darguments.functions", scope: !3, file: !8, line: 52, type: !9, isLocal: true, isDefinition: true)
!8 = !DIFile(filename: "51.go", directory: ".")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !11, line: 1, size: 384, align: 8, elements: !12)
!11 = !DIFile(filename: "<built-in>", directory: "")
!12 = !{!13, !15, !17, !18, !20, !22, !25, !26, !28}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !11, line: 1, baseType: !19, size: 16, align: 16, offset: 80)
!19 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !11, line: 1, baseType: !21, size: 32, align: 32, offset: 96)
!21 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "void")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !11, line: 1, baseType: !27, size: 64, align: 64, offset: 256)
!27 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 320)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !11, line: 1, type: !31, isLocal: false, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !32, size: 128, align: 8, elements: !33)
!32 = !DIFile(filename: "", directory: "")
!33 = !{!34, !36, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !32, line: 1, baseType: !35, size: 8, align: 8)
!35 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !32, line: 1, baseType: !37, size: 24, align: 8, offset: 8)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 3, lowerBound: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !32, line: 1, baseType: !35, size: 8, align: 8, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !32, line: 1, baseType: !35, size: 8, align: 8, offset: 40)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !32, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DISubprogram(name: "command-line-arguments.EndorsementCC.Init", linkageName: "command_x2dline_x2darguments.EndorsementCC.Init", scope: null, file: !8, line: 34, type: !45, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !65)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !68, !68, !70}
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !8, line: 14, size: 640, align: 8, elements: !48)
!48 = !{!49, !51, !57, !63, !66, !67}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !8, line: 14, baseType: !50, size: 32, align: 32)
!50 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !8, line: 14, baseType: !52, size: 128, align: 64, offset: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !11, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !11, line: 1, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !11, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !8, line: 14, baseType: !58, size: 192, align: 64, offset: 192)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !32, size: 192, align: 8, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !55, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !32, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !32, line: 1, baseType: !14, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !8, line: 14, baseType: !64, align: 8, offset: 384)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !11, line: 1, align: 1, elements: !65)
!65 = !{}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !8, line: 14, baseType: !58, size: 192, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !8, line: 14, baseType: !50, size: 32, align: 32, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "EndorsementCC", file: !8, line: 31, align: 1, elements: !65)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !8, line: 14, size: 128, align: 8, elements: !71)
!71 = !{!72, !403}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !32, size: 2496, align: 8, elements: !75)
!75 = !{!76, !115, !138, !142, !146, !154, !162, !163, !164, !165, !169, !176, !1419, !1423, !1450, !1454, !1455, !1459, !1460, !1464, !1479, !1491, !1495, !1499, !1503, !1504, !1508, !1509, !1513, !1520, !1521, !1528, !1532, !1533, !1537, !1541, !1542, !1543, !1544}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 14, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !11, line: 1, size: 512, align: 8, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !98, !114}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !11, line: 1, baseType: !27, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !11, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !11, line: 1, baseType: !21, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !11, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !11, line: 1, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 1, size: 64, align: 8, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 1, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!35, !23, !23}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !11, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !11, line: 1, baseType: !97, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !11, line: 1, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !11, line: 1, size: 320, align: 8, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 1, baseType: !97, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !11, line: 1, baseType: !97, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !11, line: 1, baseType: !105, size: 192, align: 64, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !32, size: 192, align: 8, elements: !106)
!106 = !{!107, !61, !62}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !11, line: 1, size: 320, align: 8, elements: !110)
!110 = !{!102, !103, !111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !32, line: 14, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !23, !52, !135}
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !32, size: 256, align: 8, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !52, size: 128, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !123, size: 128, align: 64, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !11, line: 1, size: 128, align: 8, elements: !124)
!124 = !{!125, !134}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 1, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !32, size: 128, align: 8, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 1, baseType: !77, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !32, line: 1, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!52, !23}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !32, size: 192, align: 8, elements: !136)
!136 = !{!137, !61, !62}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !97, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !32, line: 14, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!123, !23, !52, !52}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !32, line: 14, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!123, !23, !52}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !32, line: 14, baseType: !147, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !23}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !32, size: 192, align: 8, elements: !151)
!151 = !{!152, !61, !62}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !32, line: 14, baseType: !155, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !23}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !32, size: 320, align: 8, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !58, size: 192, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !123, size: 128, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !32, line: 14, baseType: !155, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !32, line: 14, baseType: !155, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !32, line: 14, baseType: !166, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!9, !23}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !32, line: 14, baseType: !170, size: 64, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !23}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !32, size: 320, align: 8, elements: !174)
!174 = !{!121, !175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !135, size: 192, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !32, line: 14, baseType: !177, size: 64, align: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !23, !52}
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !32, size: 256, align: 8, elements: !181)
!181 = !{!182, !122}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !183, size: 128, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !8, line: 14, size: 128, align: 8, elements: !184)
!184 = !{!185, !403}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !32, size: 256, align: 8, elements: !188)
!188 = !{!76, !189, !193, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !32, line: 14, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!123, !23}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!35, !23}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !32, line: 14, baseType: !198, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !23}
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !32, size: 192, align: 8, elements: !202)
!202 = !{!203, !902}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !8, line: 14, size: 704, align: 8, elements: !206)
!206 = !{!207, !208, !209, !1415, !1416, !1417, !1418}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !8, line: 14, baseType: !52, size: 128, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 14, baseType: !58, size: 192, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !8, line: 14, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !8, line: 14, size: 448, align: 8, elements: !212)
!212 = !{!213, !1410, !1411, !1412, !1414}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 14, baseType: !214, size: 64, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !8, line: 14, size: 64, align: 8, elements: !215)
!215 = !{!216, !218, !229, !235}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !8, line: 14, baseType: !217, align: 8)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !8, line: 14, align: 1, elements: !65)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !8, line: 14, baseType: !219, align: 64)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, align: 8, elements: !227)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 14, size: 64, align: 8, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 14, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!24}
!227 = !{!228}
!228 = !DISubrange(count: 0, lowerBound: 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !8, line: 14, baseType: !230, align: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, align: 4, elements: !227)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !8, line: 14, size: 64, align: 4, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 14, baseType: !50, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !8, line: 14, baseType: !21, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !8, line: 14, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !8, line: 14, size: 2624, align: 8, elements: !238)
!238 = !{!239, !404, !1202, !1210, !1215, !1216, !1217, !1312}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !8, line: 14, baseType: !240, size: 128, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !8, line: 10, size: 128, align: 8, elements: !241)
!241 = !{!242, !403}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 10, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !32, size: 2112, align: 8, elements: !245)
!245 = !{!246, !247, !251, !255, !256, !261, !262, !263, !267, !288, !289, !293, !301, !312, !313, !317, !318, !319, !324, !325, !374, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !398, !399}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 10, baseType: !77, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!14, !23}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !32, line: 10, baseType: !252, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!35, !23, !240}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !32, line: 10, baseType: !257, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !23}
!260 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !32, line: 10, baseType: !194, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !32, line: 10, baseType: !252, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !32, line: 10, baseType: !264, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!240, !23}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !32, line: 10, baseType: !268, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !23, !14}
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !8, line: 10, size: 832, align: 8, elements: !272)
!272 = !{!273, !274, !275, !276, !281, !282, !287}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 10, baseType: !52, size: 128, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !8, line: 10, baseType: !52, size: 128, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 10, baseType: !240, size: 128, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !8, line: 10, baseType: !277, size: 128, align: 64, offset: 384)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !8, line: 10, size: 128, align: 8, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !55, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !8, line: 10, baseType: !27, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 10, baseType: !283, size: 192, align: 64, offset: 576)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !32, size: 192, align: 8, elements: !284)
!284 = !{!285, !61, !62}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !8, line: 10, baseType: !35, size: 8, align: 8, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !32, line: 10, baseType: !290, size: 64, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!271, !23, !283}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !32, line: 10, baseType: !294, size: 64, align: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !23, !52}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !32, size: 896, align: 8, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 10, baseType: !271, size: 832, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 10, baseType: !35, size: 8, align: 8, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !32, line: 10, baseType: !302, size: 64, align: 64, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!297, !23, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 10, size: 64, align: 8, elements: !307)
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 10, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!35, !52}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !32, line: 10, baseType: !252, size: 64, align: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !32, line: 10, baseType: !314, size: 64, align: 64, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!240, !23, !14}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !32, line: 10, baseType: !194, size: 64, align: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !32, line: 10, baseType: !264, size: 64, align: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !32, line: 10, baseType: !320, size: 64, align: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !23}
!323 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 1152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !32, line: 10, baseType: !326, size: 64, align: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !23, !14}
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !8, line: 10, size: 640, align: 8, elements: !330)
!330 = !{!273, !274, !275, !331, !373}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !8, line: 10, baseType: !332, size: 192, align: 64, offset: 384)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 10, size: 192, align: 8, elements: !333)
!333 = !{!334, !370, !371}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 10, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !8, line: 10, size: 512, align: 8, elements: !337)
!337 = !{!338, !339, !340, !341, !343, !344, !345, !346, !351, !352, !353, !369}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 10, baseType: !27, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 10, baseType: !27, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 10, baseType: !21, size: 32, align: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 10, baseType: !342, size: 8, align: 8, offset: 160)
!342 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 10, baseType: !16, size: 8, align: 8, offset: 168)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 10, baseType: !16, size: 8, align: 8, offset: 176)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 10, baseType: !16, size: 8, align: 8, offset: 184)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 10, baseType: !347, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 10, size: 64, align: 8, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 10, baseType: !92, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 10, baseType: !55, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 10, baseType: !97, size: 64, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 10, baseType: !354, size: 64, align: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !8, line: 10, size: 320, align: 8, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 10, baseType: !97, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 10, baseType: !97, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 10, baseType: !360, size: 192, align: 64, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !32, size: 192, align: 8, elements: !361)
!361 = !{!362, !61, !62}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !8, line: 10, size: 320, align: 8, elements: !365)
!365 = !{!357, !358, !366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 10, baseType: !23, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 10, baseType: !23, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 10, baseType: !23, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 10, baseType: !23, size: 64, align: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !8, line: 10, baseType: !23, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !8, line: 10, baseType: !372, size: 64, align: 64, offset: 128)
!372 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 10, baseType: !14, size: 64, align: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !32, line: 10, baseType: !375, size: 64, align: 64, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !23, !52}
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !32, size: 704, align: 8, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 10, baseType: !329, size: 640, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 10, baseType: !35, size: 8, align: 8, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 10, baseType: !131, size: 64, align: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !32, line: 10, baseType: !248, size: 64, align: 64, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !32, line: 10, baseType: !314, size: 64, align: 64, offset: 1664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !32, line: 10, baseType: !131, size: 64, align: 64, offset: 1728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !32, line: 10, baseType: !390, size: 64, align: 64, offset: 1792)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!27, !23}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !32, line: 10, baseType: !131, size: 64, align: 64, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !32, line: 10, baseType: !395, size: 64, align: 64, offset: 1920)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!335, !23}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !32, line: 10, baseType: !131, size: 64, align: 64, offset: 1984)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !32, line: 10, baseType: !400, size: 64, align: 64, offset: 2048)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!354, !23}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !8, line: 14, baseType: !405, size: 128, align: 64, offset: 128)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !406)
!406 = !{!407, !403}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !32, size: 1408, align: 8, elements: !410)
!410 = !{!76, !411, !1128, !1132, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1177, !1178, !1179, !1180, !1181, !1185, !1199, !1200, !1201}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !32, line: 14, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !23}
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !416)
!416 = !{!417, !403}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 320, align: 8, elements: !420)
!420 = !{!76, !421, !1124, !573, !574}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !422, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !23, !442}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !426)
!426 = !{!427, !403}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !32, size: 896, align: 8, elements: !430)
!430 = !{!76, !431, !436, !437, !438, !443, !1058, !550, !746, !1059, !1063, !1081, !754, !1102}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !23}
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !8, line: 14, size: 128, align: 8, elements: !278)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !23}
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 14, size: 128, align: 8, elements: !278)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !444, size: 64, align: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !23}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !8, line: 14, size: 128, align: 8, elements: !448)
!448 = !{!449, !403}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !32, size: 128, align: 8, elements: !452)
!452 = !{!76, !453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !32, line: 14, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !23}
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !8, line: 14, size: 128, align: 8, elements: !458)
!458 = !{!459, !403}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !32, size: 1088, align: 8, elements: !462)
!462 = !{!76, !463, !825, !826, !830, !837, !841, !842, !843, !844, !845, !846, !1022, !1033, !1037, !1041, !1054}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !32, line: 14, baseType: !464, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!24, !23, !467}
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !468)
!468 = !{!469, !403}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !32, size: 2112, align: 8, elements: !472)
!472 = !{!76, !473, !478, !482, !755, !764, !785, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !807, !811, !812, !813, !814, !818, !819, !820, !821, !822, !823, !824}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !32, line: 14, baseType: !474, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !23}
!477 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!405, !23}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !32, line: 14, baseType: !483, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!486, !23}
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !487)
!487 = !{!488, !403}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !32, size: 832, align: 8, elements: !491)
!491 = !{!76, !492, !532, !533, !534, !535, !536, !537, !538, !748, !749, !750, !754}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !32, line: 14, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !23}
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !497)
!497 = !{!498, !403}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 512, align: 8, elements: !501)
!501 = !{!76, !502, !506, !510, !515, !516, !520, !521}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !32, line: 14, baseType: !503, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!467, !23, !52}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !507, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!467, !23, !442}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !32, line: 14, baseType: !511, size: 64, align: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!467, !23, !514}
!514 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !32, line: 14, baseType: !503, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !517, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!467, !23, !14}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!24, !23, !525}
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !8, line: 14, size: 128, align: 8, elements: !526)
!526 = !{!527, !403}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !32, size: 128, align: 8, elements: !530)
!530 = !{!76, !531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !539, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !23}
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !8, line: 14, size: 128, align: 8, elements: !543)
!543 = !{!544, !403}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !32, size: 640, align: 8, elements: !547)
!547 = !{!76, !431, !436, !437, !438, !548, !549, !550, !746, !747}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !551, size: 64, align: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !23}
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !555)
!555 = !{!556, !403}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !32, size: 1216, align: 8, elements: !559)
!559 = !{!76, !560, !561, !575, !576, !597, !598, !599, !617, !618, !619, !620, !621, !622, !623, !624, !628, !704, !745}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !32, line: 14, baseType: !562, size: 64, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !23}
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !566)
!566 = !{!567, !403}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 320, align: 8, elements: !570)
!570 = !{!76, !571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !507, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !517, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !32, line: 14, baseType: !577, size: 64, align: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!580, !23}
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !8, line: 14, size: 128, align: 8, elements: !581)
!581 = !{!582, !403}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 256, align: 8, elements: !585)
!585 = !{!76, !586, !595, !596}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !587, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !23, !14}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !8, line: 14, size: 192, align: 8, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !8, line: 14, baseType: !554, size: 128, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !8, line: 14, baseType: !35, size: 8, align: 8, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !8, line: 14, baseType: !35, size: 8, align: 8, offset: 136)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !32, line: 14, baseType: !600, size: 64, align: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!603, !23}
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !604)
!604 = !{!605, !403}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 320, align: 8, elements: !608)
!608 = !{!76, !609, !613, !573, !574}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !610, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!405, !23, !442}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !614, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!405, !23, !14}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !625, size: 64, align: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!24, !23, !554}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !32, line: 14, baseType: !629, size: 64, align: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !23}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !633)
!633 = !{!634, !403}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 320, align: 8, elements: !637)
!637 = !{!76, !638, !700, !573, !574}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !639, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !23, !442}
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !643)
!643 = !{!644, !403}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !32, size: 768, align: 8, elements: !647)
!647 = !{!76, !431, !436, !437, !648, !690, !691, !692, !693, !694, !695, !699}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !32, line: 14, baseType: !649, size: 64, align: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !23}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !8, line: 14, size: 128, align: 8, elements: !653)
!653 = !{!654, !403}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 320, align: 8, elements: !657)
!657 = !{!76, !658, !686, !573, !574}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !32, line: 14, baseType: !659, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !23, !442}
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !663)
!663 = !{!664, !403}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !32, size: 960, align: 8, elements: !667)
!667 = !{!76, !431, !436, !668, !534, !669, !670, !671, !672, !673, !674, !675, !676, !677, !681}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !678, size: 64, align: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!24, !23, !662}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !23}
!685 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !687, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!662, !23, !14}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !696, size: 64, align: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!24, !23, !642}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!642, !23, !14}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !32, line: 14, baseType: !705, size: 64, align: 64, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !23}
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !8, line: 14, size: 128, align: 8, elements: !709)
!709 = !{!710, !403}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !32, size: 384, align: 8, elements: !713)
!713 = !{!76, !714, !735, !739, !743, !744}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !32, line: 14, baseType: !715, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !23, !542}
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !8, line: 14, size: 960, align: 8, elements: !719)
!719 = !{!720, !727, !728, !729, !730, !731, !732, !733, !734}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 14, baseType: !721, size: 192, align: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !8, line: 14, size: 192, align: 8, elements: !722)
!722 = !{!723, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !8, line: 14, baseType: !14, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !8, line: 14, baseType: !14, size: 64, align: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !8, line: 14, baseType: !14, size: 64, align: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !8, line: 14, baseType: !14, size: 64, align: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !8, line: 14, baseType: !135, size: 192, align: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !8, line: 14, baseType: !52, size: 128, align: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !8, line: 14, baseType: !52, size: 128, align: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !8, line: 14, baseType: !14, size: 64, align: 64, offset: 896)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !32, line: 14, baseType: !736, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!718, !23, !721}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !740, size: 64, align: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!718, !23, !14}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !551, size: 64, align: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !751, size: 64, align: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!24, !23, !486}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !32, line: 14, baseType: !756, size: 64, align: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !23}
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 14, size: 192, align: 8, elements: !760)
!760 = !{!218, !761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 14, baseType: !23, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !8, line: 14, baseType: !23, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !8, line: 14, baseType: !43, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !32, line: 14, baseType: !765, size: 64, align: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !23}
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !769)
!769 = !{!770, !403}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !32, size: 768, align: 8, elements: !773)
!773 = !{!76, !431, !436, !437, !438, !774, !691, !779, !780, !694, !781, !699}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !32, line: 14, baseType: !775, size: 64, align: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !23}
!778 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !539, size: 64, align: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !551, size: 64, align: 64, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !782, size: 64, align: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!24, !23, !768}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !32, line: 14, baseType: !786, size: 64, align: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!425, !23}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 640)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1088)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !32, line: 14, baseType: !803, size: 64, align: 64, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!806, !23}
!806 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !32, line: 14, baseType: !808, size: 64, align: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!467, !23}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !32, line: 14, baseType: !808, size: 64, align: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !32, line: 14, baseType: !815, size: 64, align: 64, offset: 1600)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!514, !23}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 1664)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !539, size: 64, align: 64, offset: 1728)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !551, size: 64, align: 64, offset: 1792)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 1856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 1920)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 1984)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 2048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !32, line: 14, baseType: !827, size: 64, align: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!759, !23, !467}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !32, line: 14, baseType: !831, size: 64, align: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !23}
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !8, line: 14, size: 192, align: 8, elements: !835)
!835 = !{!836, !725, !726}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !55, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !32, line: 14, baseType: !838, size: 64, align: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!35, !23, !467}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !32, line: 14, baseType: !827, size: 64, align: 64, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !32, line: 14, baseType: !827, size: 64, align: 64, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !32, line: 14, baseType: !847, size: 64, align: 64, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!850, !23}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !32, size: 384, align: 8, elements: !852)
!852 = !{!853, !854, !855, !870, !888, !994, !1006}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !32, line: 14, baseType: !217, align: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !32, line: 14, baseType: !43, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !32, line: 14, baseType: !856, size: 64, align: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 14, size: 64, align: 8, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 14, baseType: !860, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !866}
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !32, size: 64, align: 8, elements: !864)
!864 = !{!853, !865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !32, line: 14, baseType: !14, size: 64, align: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !32, size: 192, align: 8, elements: !867)
!867 = !{!853, !868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !32, line: 14, baseType: !457, size: 128, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !32, line: 14, baseType: !16, size: 8, align: 8, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !32, line: 14, baseType: !871, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 14, size: 64, align: 8, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 14, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!878, !884}
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !32, size: 320, align: 8, elements: !879)
!879 = !{!880, !161}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !881, size: 192, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !32, size: 192, align: 8, elements: !882)
!882 = !{!853, !883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !32, line: 14, baseType: !58, size: 192, align: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !32, size: 384, align: 8, elements: !885)
!885 = !{!853, !868, !886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !32, line: 14, baseType: !58, size: 192, align: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !32, line: 14, baseType: !16, size: 8, align: 8, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !32, line: 14, baseType: !889, size: 64, align: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 14, size: 64, align: 8, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 14, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!896, !903}
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !32, size: 192, align: 8, elements: !897)
!897 = !{!898, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !899, size: 8, align: 8)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !32, size: 8, align: 1, elements: !900)
!900 = !{!853, !901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !32, line: 14, baseType: !16, size: 8, align: 8)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !123, size: 128, align: 64, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !32, size: 576, align: 8, elements: !904)
!904 = !{!853, !868, !886, !887, !905, !993}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !32, line: 14, baseType: !906, size: 128, align: 64, offset: 384)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !32, size: 128, align: 8, elements: !907)
!907 = !{!908, !992}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !32, line: 14, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !32, size: 192, align: 8, elements: !911)
!911 = !{!76, !912, !988}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !32, line: 14, baseType: !913, size: 64, align: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !23, !435}
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !32, size: 256, align: 8, elements: !917)
!917 = !{!918, !122}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 14, baseType: !919, size: 128, align: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !8, line: 14, size: 128, align: 8, elements: !920)
!920 = !{!921, !403}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !32, size: 512, align: 8, elements: !924)
!924 = !{!76, !925, !932, !936, !940, !941, !983, !987}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !32, line: 14, baseType: !926, size: 64, align: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !23, !759}
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 15, size: 128, align: 8, elements: !930)
!930 = !{!931, !403}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !77, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !32, line: 14, baseType: !933, size: 64, align: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!35, !23, !929}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !32, line: 14, baseType: !937, size: 64, align: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!35, !23, !759}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !32, line: 14, baseType: !756, size: 64, align: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !32, line: 14, baseType: !942, size: 64, align: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !23}
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !8, line: 14, size: 128, align: 8, elements: !946)
!946 = !{!947, !403}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 14, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !32, size: 2240, align: 8, elements: !950)
!950 = !{!76, !473, !478, !482, !755, !764, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !32, line: 14, baseType: !808, size: 64, align: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !32, line: 14, baseType: !786, size: 64, align: 64, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !32, line: 14, baseType: !432, size: 64, align: 64, offset: 512)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 640)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 704)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !32, line: 14, baseType: !248, size: 64, align: 64, offset: 832)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 896)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1024)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1088)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !32, line: 14, baseType: !194, size: 64, align: 64, offset: 1216)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 1280)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !32, line: 14, baseType: !803, size: 64, align: 64, offset: 1344)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !32, line: 14, baseType: !808, size: 64, align: 64, offset: 1408)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !32, line: 14, baseType: !808, size: 64, align: 64, offset: 1472)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !32, line: 14, baseType: !479, size: 64, align: 64, offset: 1536)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !32, line: 14, baseType: !439, size: 64, align: 64, offset: 1600)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !32, line: 14, baseType: !815, size: 64, align: 64, offset: 1664)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !32, line: 14, baseType: !23, size: 64, align: 64, offset: 1728)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !32, line: 14, baseType: !539, size: 64, align: 64, offset: 1792)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !32, line: 14, baseType: !551, size: 64, align: 64, offset: 1856)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !32, line: 14, baseType: !522, size: 64, align: 64, offset: 1920)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !32, line: 14, baseType: !464, size: 64, align: 64, offset: 1984)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !32, line: 14, baseType: !682, size: 64, align: 64, offset: 2048)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !32, line: 14, baseType: !131, size: 64, align: 64, offset: 2112)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !32, line: 14, baseType: !980, size: 64, align: 64, offset: 2176)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!919, !23}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ValueOf", file: !32, line: 14, baseType: !984, size: 64, align: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!759, !23, !929}
