; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22contracts\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22ptypes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./98.go", directory: "/home/ming/go/src/chaincode_repo/github/98")
!5 = !{!6, !99}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "command_x2dline_x2darguments.seededRand", linkageName: "command_x2dline_x2darguments.seededRand", scope: !3, file: !8, line: 72, type: !9, isLocal: true, isDefinition: true)
!8 = !DIFile(filename: "98.go", directory: ".")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rand", file: !8, line: 7, size: 384, align: 8, elements: !11)
!11 = !{!12, !84, !96, !97}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "src", file: !8, line: 7, baseType: !13, size: 128, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source", file: !8, line: 7, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 7, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int64,*func(*void,int64)void}", file: !18, size: 192, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !74, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 7, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !23, line: 1, size: 512, align: 8, elements: !24)
!23 = !DIFile(filename: "<built-in>", directory: "")
!24 = !{!25, !27, !28, !30, !32, !33, !34, !35, !46, !48, !55, !73}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !23, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !23, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !23, line: 1, baseType: !29, size: 32, align: 32, offset: 128)
!29 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 160)
!31 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 168)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 176)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 184)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !23, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 1, size: 64, align: 8, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !44}
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "void")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !23, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !23, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !23, line: 1, size: 128, align: 8, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !23, line: 1, baseType: !47, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !23, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !23, line: 1, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !23, line: 1, size: 320, align: 8, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !23, line: 1, baseType: !49, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !23, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !23, line: 1, baseType: !62, size: 192, align: 64, offset: 128)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !63)
!63 = !{!64, !71, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !23, line: 1, size: 320, align: 8, elements: !67)
!67 = !{!59, !60, !68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Int63", file: !18, line: 7, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !44}
!78 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Seed", file: !18, line: 7, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!45, !44, !78}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "s64", file: !8, line: 7, baseType: !85, size: 128, align: 64, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source64", file: !8, line: 7, size: 128, align: 8, elements: !86)
!86 = !{!87, !83}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 7, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int64,*func(*void,int64)void,*func(*void)uint64}", file: !18, size: 256, align: 8, elements: !90)
!90 = !{!20, !74, !79, !91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Uint64", file: !18, line: 7, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !44}
!95 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "readVal", file: !8, line: 7, baseType: !78, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "readPos", file: !8, line: 7, baseType: !98, size: 8, align: 8, offset: 320)
!98 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !23, line: 1, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !18, size: 128, align: 8, elements: !102)
!102 = !{!103, !104, !108, !109, !110}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !18, line: 1, baseType: !43, size: 8, align: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !18, line: 1, baseType: !105, size: 24, align: 8, offset: 8)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 1, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 3, lowerBound: 0)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !18, line: 1, baseType: !43, size: 8, align: 8, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !18, line: 1, baseType: !43, size: 8, align: 8, offset: 40)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !18, line: 1, baseType: !95, size: 64, align: 64, offset: 64)
!111 = distinct !DISubprogram(name: "command_x2dline_x2darguments.SimplePaymentApp..eq", scope: null, file: !23, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !112)
!112 = !{}
!113 = !DILocalVariable(name: "key1", arg: 1, scope: !111, file: !23, line: 1, type: !44)
!114 = !DILocation(line: 0, scope: !111)
!115 = !DILocalVariable(name: "key2", arg: 2, scope: !111, file: !23, line: 1, type: !44)
!116 = !DILocalVariable(name: "$ret53", scope: !111, file: !23, line: 1, type: !43)
!117 = !DILocation(line: 1, column: 1, scope: !111)
!118 = distinct !DISubprogram(name: "command-line-arguments.SimplePaymentApp.AddAmount", linkageName: "command_x2dline_x2darguments.SimplePaymentApp.AddAmount", scope: null, file: !8, line: 461, type: !119, scopeLine: 461, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !112)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !133, !133, !1836, !50, !54}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !23, line: 1, size: 128, align: 8, elements: !122)
!122 = !{!123, !132}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 1, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!50, !44}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimplePaymentApp", file: !8, line: 17, size: 1152, align: 8, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !8, line: 18, baseType: !137, size: 1152, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !8, line: 13, size: 1152, align: 8, elements: !138)
!138 = !{!139, !140, !156, !160, !161, !162}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 13, baseType: !50, size: 128, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !8, line: 13, baseType: !141, size: 512, align: 64, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !8, line: 13, size: 512, align: 8, elements: !142)
!142 = !{!143, !144, !145, !151, !155}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !8, line: 13, baseType: !50, size: 128, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !8, line: 13, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !8, line: 13, size: 384, align: 8, elements: !148)
!148 = !{!139, !149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !8, line: 13, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !8, line: 13, size: 256, align: 8, elements: !154)
!154 = !{!139, !149}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !8, line: 13, baseType: !157, size: 128, align: 64, offset: 640)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 9, size: 128, align: 8, elements: !158)
!158 = !{!159, !83}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !21, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !8, line: 13, baseType: !157, size: 128, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !8, line: 13, baseType: !157, size: 128, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !8, line: 13, baseType: !163, size: 128, align: 64, offset: 1024)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !8, line: 13, size: 128, align: 8, elements: !164)
!164 = !{!165, !83}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 13, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !18, size: 192, align: 8, elements: !168)
!168 = !{!169, !170, !394}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 13, baseType: !21, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !18, line: 13, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!45, !44, !174}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !8, line: 13, size: 128, align: 8, elements: !175)
!175 = !{!176, !83}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 13, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !18, size: 384, align: 8, elements: !179)
!179 = !{!169, !180, !184, !193, !201, !202}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !18, line: 13, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!121, !44, !50, !50}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !18, line: 13, baseType: !185, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !44, !50}
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !18, size: 320, align: 8, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !18, line: 13, baseType: !50, size: 128, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !18, line: 13, baseType: !43, size: 8, align: 8, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 13, baseType: !121, size: 128, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !18, line: 13, baseType: !194, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !44}
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !18, size: 256, align: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 12, baseType: !50, size: 128, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 12, baseType: !121, size: 128, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !18, line: 13, baseType: !194, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !18, line: 13, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !44}
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !18, size: 192, align: 8, elements: !207)
!207 = !{!208, !393}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 13, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !8, line: 13, size: 10624, align: 8, elements: !211)
!211 = !{!212, !216, !217, !218, !219, !220, !221, !223, !225, !226, !227, !240, !269, !270, !304, !305, !307, !317, !318, !323, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !348, !372, !373, !374, !375, !386, !387, !388, !389, !390, !391, !392}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !8, line: 13, baseType: !213, size: 192, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !214)
!214 = !{!215, !71, !72}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !47, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !8, line: 13, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !8, line: 13, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !8, line: 13, baseType: !157, size: 128, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !8, line: 13, baseType: !54, size: 64, align: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !8, line: 13, baseType: !228, size: 64, align: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !8, line: 13, size: 256, align: 8, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !8, line: 13, baseType: !43, size: 8, align: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !8, line: 13, baseType: !233, size: 192, align: 64, offset: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !8, line: 13, size: 192, align: 8, elements: !234)
!234 = !{!235, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !8, line: 13, baseType: !241, size: 1984, align: 64, offset: 1536)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 13, size: 1984, align: 8, elements: !242)
!242 = !{!243, !247, !248, !249, !250, !251, !252, !253, !254, !255, !268}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !8, line: 13, baseType: !244, size: 192, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !245)
!245 = !{!246, !71, !72}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !49, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !8, line: 13, baseType: !256, size: 192, align: 64, offset: 1600)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !18, size: 192, align: 8, elements: !257)
!257 = !{!258, !71, !72}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !8, line: 13, size: 320, align: 8, elements: !261)
!261 = !{!262, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 13, baseType: !263, size: 192, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !8, line: 13, size: 192, align: 8, elements: !264)
!264 = !{!265, !238, !239}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 13, baseType: !157, size: 128, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !8, line: 13, baseType: !256, size: 192, align: 64, offset: 1792)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !8, line: 13, baseType: !241, size: 1984, align: 64, offset: 3520)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !8, line: 13, baseType: !271, size: 192, align: 64, offset: 5504)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !8, line: 6, size: 192, align: 8, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !8, line: 6, baseType: !95, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !8, line: 6, baseType: !78, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !8, line: 6, baseType: !276, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !8, line: 6, size: 832, align: 8, elements: !278)
!278 = !{!279, !280, !289, !300, !301, !302, !303}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 6, baseType: !50, size: 128, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !8, line: 6, baseType: !281, size: 192, align: 64, offset: 128)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !18, size: 192, align: 8, elements: !282)
!282 = !{!283, !71, !72}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !8, line: 6, size: 256, align: 8, elements: !286)
!286 = !{!279, !287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !8, line: 6, baseType: !54, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !8, line: 6, baseType: !43, size: 8, align: 8, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !8, line: 6, baseType: !290, size: 192, align: 64, offset: 320)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !18, size: 192, align: 8, elements: !291)
!291 = !{!292, !71, !72}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !8, line: 6, size: 128, align: 8, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !8, line: 6, baseType: !78, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !8, line: 6, baseType: !31, size: 8, align: 8, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !8, line: 6, baseType: !43, size: 8, align: 8, offset: 72)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !8, line: 6, baseType: !43, size: 8, align: 8, offset: 80)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !8, line: 6, baseType: !50, size: 128, align: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !8, line: 6, baseType: !78, size: 64, align: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !8, line: 6, baseType: !78, size: 64, align: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !8, line: 6, baseType: !284, size: 64, align: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !8, line: 13, baseType: !271, size: 192, align: 64, offset: 5696)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !8, line: 13, baseType: !306, size: 64, align: 64, offset: 5888)
!306 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !8, line: 13, baseType: !308, size: 192, align: 64, offset: 5952)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !18, size: 192, align: 8, elements: !309)
!309 = !{!310, !71, !72}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !8, line: 13, size: 448, align: 8, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !8, line: 13, baseType: !263, size: 192, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !8, line: 13, baseType: !308, size: 192, align: 64, offset: 6144)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !8, line: 13, baseType: !319, size: 192, align: 64, offset: 6336)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !18, size: 192, align: 8, elements: !320)
!320 = !{!321, !71, !72}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !8, line: 13, baseType: !324, size: 192, align: 64, offset: 6528)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !18, size: 192, align: 8, elements: !325)
!325 = !{!326, !71, !72}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !8, line: 13, baseType: !319, size: 192, align: 64, offset: 6720)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 6912)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 6920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !8, line: 13, baseType: !54, size: 64, align: 64, offset: 6976)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 7040)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 7104)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !8, line: 13, baseType: !213, size: 192, align: 64, offset: 7296)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 7488)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 7680)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 7872)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 8064)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !8, line: 13, baseType: !341, size: 192, align: 64, offset: 8256)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !18, size: 192, align: 8, elements: !342)
!342 = !{!343, !71, !72}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !8, line: 13, size: 192, align: 8, elements: !346)
!346 = !{!347, !238, !239}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !47, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !8, line: 13, baseType: !349, size: 192, align: 64, offset: 8448)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !18, size: 192, align: 8, elements: !350)
!350 = !{!351, !71, !72}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !8, line: 13, size: 1152, align: 8, elements: !355)
!355 = !{!356, !357, !358, !365, !366, !367, !368, !369, !370, !371}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !8, line: 13, baseType: !50, size: 128, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !8, line: 13, baseType: !359, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !8, line: 13, size: 320, align: 8, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !8, line: 13, baseType: !50, size: 128, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !8, line: 13, baseType: !50, size: 128, align: 64, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !8, line: 13, baseType: !43, size: 8, align: 8, offset: 8640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 8704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 8896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !8, line: 13, baseType: !376, size: 192, align: 64, offset: 9088)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !18, size: 192, align: 8, elements: !377)
!377 = !{!378, !71, !72}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !8, line: 13, size: 384, align: 8, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !8, line: 13, baseType: !345, size: 192, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !8, line: 13, baseType: !385, size: 192, align: 64, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !8, line: 13, size: 192, align: 8, elements: !346)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !8, line: 13, baseType: !376, size: 192, align: 64, offset: 9280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 9472)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 9664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 9856)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 10048)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !8, line: 13, baseType: !244, size: 192, align: 64, offset: 10240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !8, line: 13, baseType: !319, size: 192, align: 64, offset: 10432)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 13, baseType: !121, size: 128, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !18, line: 13, baseType: !395, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!45, !44, !398}
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !8, line: 12, size: 128, align: 8, elements: !399)
!399 = !{!400, !83}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 12, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !18, size: 2496, align: 8, elements: !403)
!403 = !{!404, !405, !409, !410, !414, !422, !430, !431, !432, !433, !450, !457, !1695, !1699, !1726, !1730, !1731, !1735, !1736, !1740, !1756, !1771, !1775, !1779, !1783, !1784, !1788, !1789, !1793, !1800, !1801, !1808, !1817, !1818, !1822, !1826, !1827, !1828, !1829}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 12, baseType: !21, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !18, line: 12, baseType: !406, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!197, !44, !50, !244}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !18, line: 12, baseType: !181, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !18, line: 12, baseType: !411, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!121, !44, !50}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !18, line: 12, baseType: !415, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !44}
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !419)
!419 = !{!420, !71, !72}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !18, line: 12, baseType: !423, size: 64, align: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !44}
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !18, size: 320, align: 8, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 11, baseType: !213, size: 192, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 11, baseType: !121, size: 128, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !18, line: 12, baseType: !423, size: 64, align: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !18, line: 12, baseType: !129, size: 64, align: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !18, line: 12, baseType: !423, size: 64, align: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !18, line: 12, baseType: !434, size: 64, align: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !44}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !23, line: 1, size: 384, align: 8, elements: !439)
!439 = !{!440, !441, !442, !443, !445, !446, !447, !448, !449}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !23, line: 1, baseType: !54, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 72)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !23, line: 1, baseType: !444, size: 16, align: 16, offset: 80)
!444 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !23, line: 1, baseType: !29, size: 32, align: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !23, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !18, line: 12, baseType: !451, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !44}
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !18, size: 320, align: 8, elements: !455)
!455 = !{!199, !456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 12, baseType: !244, size: 192, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !18, line: 12, baseType: !458, size: 64, align: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !44, !50}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !18, size: 256, align: 8, elements: !462)
!462 = !{!463, !200}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 12, baseType: !464, size: 128, align: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !8, line: 12, size: 128, align: 8, elements: !465)
!465 = !{!466, !83}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 12, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !18, size: 256, align: 8, elements: !469)
!469 = !{!404, !470, !474, !478}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 12, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!121, !44}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !18, line: 12, baseType: !475, size: 64, align: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!43, !44}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !18, line: 12, baseType: !479, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!482, !44}
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !18, size: 192, align: 8, elements: !483)
!483 = !{!484, !1694}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 12, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !8, line: 12, size: 704, align: 8, elements: !487)
!487 = !{!488, !489, !490, !1689, !1690, !1692, !1693}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !8, line: 12, baseType: !50, size: 128, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 12, baseType: !213, size: 192, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !8, line: 12, baseType: !491, size: 64, align: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !8, line: 11, size: 448, align: 8, elements: !493)
!493 = !{!494, !1685, !1686, !1687, !1688}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 11, baseType: !495, size: 64, align: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !8, line: 11, size: 64, align: 8, elements: !496)
!496 = !{!497, !499, !510, !517}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !8, line: 11, baseType: !498, align: 8)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !8, line: 11, align: 1, elements: !112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !8, line: 11, baseType: !500, align: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, align: 8, elements: !508)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 11, size: 64, align: 8, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 11, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!45}
!508 = !{!509}
!509 = !DISubrange(count: 0, lowerBound: 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !8, line: 11, baseType: !511, align: 32)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, align: 4, elements: !508)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !8, line: 6, size: 64, align: 4, elements: !513)
!513 = !{!514, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 6, baseType: !515, size: 32, align: 32)
!515 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !8, line: 6, baseType: !29, size: 32, align: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !8, line: 11, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !8, line: 11, size: 2624, align: 8, elements: !520)
!520 = !{!521, !684, !1477, !1485, !1490, !1491, !1492, !1587}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !8, line: 11, baseType: !522, size: 128, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !8, line: 4, size: 128, align: 8, elements: !523)
!523 = !{!524, !83}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 4, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !18, size: 2112, align: 8, elements: !527)
!527 = !{!528, !529, !533, !537, !538, !543, !544, !545, !549, !569, !570, !574, !582, !593, !594, !598, !599, !600, !605, !606, !655, !663, !664, !665, !666, !667, !668, !669, !670, !674, !675, !679, !680}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 4, baseType: !21, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!54, !44}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !18, line: 4, baseType: !534, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!43, !44, !522}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !18, line: 4, baseType: !539, size: 64, align: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !44}
!542 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !18, line: 4, baseType: !475, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !18, line: 4, baseType: !534, size: 64, align: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !18, line: 4, baseType: !546, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!522, !44}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !18, line: 4, baseType: !550, size: 64, align: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !44, !54}
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !8, line: 4, size: 832, align: 8, elements: !554)
!554 = !{!555, !556, !557, !558, !563, !564, !568}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 4, baseType: !50, size: 128, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !8, line: 4, baseType: !50, size: 128, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 4, baseType: !522, size: 128, align: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !8, line: 4, baseType: !559, size: 128, align: 64, offset: 384)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !8, line: 4, size: 128, align: 8, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !47, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !8, line: 4, baseType: !26, size: 64, align: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 4, baseType: !565, size: 192, align: 64, offset: 576)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !18, size: 192, align: 8, elements: !566)
!566 = !{!567, !71, !72}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !266, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !8, line: 4, baseType: !43, size: 8, align: 8, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !18, line: 4, baseType: !571, size: 64, align: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!553, !44, !565}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !18, line: 4, baseType: !575, size: 64, align: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !44, !50}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !18, size: 896, align: 8, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !553, size: 832, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !43, size: 8, align: 8, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !18, line: 4, baseType: !583, size: 64, align: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!578, !44, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 4, size: 64, align: 8, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 4, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!43, !50}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !18, line: 4, baseType: !534, size: 64, align: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !18, line: 4, baseType: !595, size: 64, align: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!522, !44, !54}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !18, line: 4, baseType: !475, size: 64, align: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !18, line: 4, baseType: !546, size: 64, align: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !18, line: 4, baseType: !601, size: 64, align: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!604, !44}
!604 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !18, line: 4, baseType: !607, size: 64, align: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !44, !54}
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !8, line: 4, size: 640, align: 8, elements: !611)
!611 = !{!555, !556, !557, !612, !654}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !8, line: 4, baseType: !613, size: 192, align: 64, offset: 384)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 4, size: 192, align: 8, elements: !614)
!614 = !{!615, !651, !652}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 4, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !8, line: 4, size: 512, align: 8, elements: !618)
!618 = !{!619, !620, !621, !622, !624, !625, !626, !627, !632, !633, !634, !650}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 4, baseType: !26, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 4, baseType: !26, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 4, baseType: !29, size: 32, align: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 4, baseType: !623, size: 8, align: 8, offset: 160)
!623 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 4, baseType: !31, size: 8, align: 8, offset: 168)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 4, baseType: !31, size: 8, align: 8, offset: 176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 4, baseType: !31, size: 8, align: 8, offset: 184)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 4, baseType: !628, size: 64, align: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 4, size: 64, align: 8, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 4, baseType: !40, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 4, baseType: !47, size: 64, align: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 4, baseType: !49, size: 64, align: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 4, baseType: !635, size: 64, align: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !8, line: 4, size: 320, align: 8, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 4, baseType: !49, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 4, baseType: !49, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 4, baseType: !641, size: 192, align: 64, offset: 128)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !18, size: 192, align: 8, elements: !642)
!642 = !{!643, !71, !72}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !8, line: 4, size: 320, align: 8, elements: !646)
!646 = !{!638, !639, !647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 4, baseType: !44, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 4, baseType: !44, size: 64, align: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 4, baseType: !44, size: 64, align: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 4, baseType: !44, size: 64, align: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !8, line: 4, baseType: !44, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !8, line: 4, baseType: !653, size: 64, align: 64, offset: 128)
!653 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 4, baseType: !54, size: 64, align: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !18, line: 4, baseType: !656, size: 64, align: 64, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !44, !50}
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !18, size: 704, align: 8, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !610, size: 640, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !43, size: 8, align: 8, offset: 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 4, baseType: !129, size: 64, align: 64, offset: 1344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 1536)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !18, line: 4, baseType: !530, size: 64, align: 64, offset: 1600)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !18, line: 4, baseType: !595, size: 64, align: 64, offset: 1664)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !18, line: 4, baseType: !129, size: 64, align: 64, offset: 1728)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !18, line: 4, baseType: !671, size: 64, align: 64, offset: 1792)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!26, !44}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 4, baseType: !129, size: 64, align: 64, offset: 1856)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !18, line: 4, baseType: !676, size: 64, align: 64, offset: 1920)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!616, !44}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !18, line: 4, baseType: !129, size: 64, align: 64, offset: 1984)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !18, line: 4, baseType: !681, size: 64, align: 64, offset: 2048)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!635, !44}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !8, line: 11, baseType: !685, size: 128, align: 64, offset: 128)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !686)
!686 = !{!687, !83}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !18, size: 1408, align: 8, elements: !690)
!690 = !{!691, !692, !1403, !1407, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1452, !1453, !1454, !1455, !1456, !1460, !1474, !1475, !1476}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 11, baseType: !21, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !18, line: 11, baseType: !693, size: 64, align: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !44}
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !697)
!697 = !{!698, !83}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !701)
!701 = !{!691, !702, !1399, !854, !855}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !703, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!706, !44, !723}
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !707)
!707 = !{!708, !83}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !18, size: 896, align: 8, elements: !711)
!711 = !{!691, !712, !717, !718, !719, !724, !1333, !831, !1025, !1334, !1338, !1356, !1033, !1377}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 11, baseType: !713, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !44}
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !8, line: 11, size: 128, align: 8, elements: !560)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 11, baseType: !720, size: 64, align: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !44}
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 11, size: 128, align: 8, elements: !560)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !725, size: 64, align: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!728, !44}
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !8, line: 11, size: 128, align: 8, elements: !729)
!729 = !{!730, !83}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !18, size: 128, align: 8, elements: !733)
!733 = !{!691, !734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !18, line: 11, baseType: !735, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !44}
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !8, line: 11, size: 128, align: 8, elements: !739)
!739 = !{!740, !83}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !741, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !18, size: 1088, align: 8, elements: !743)
!743 = !{!691, !744, !1104, !1105, !1109, !1114, !1118, !1119, !1120, !1121, !1122, !1123, !1297, !1308, !1312, !1316, !1329}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !18, line: 11, baseType: !745, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!45, !44, !748}
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !749)
!749 = !{!750, !83}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !18, size: 2112, align: 8, elements: !753)
!753 = !{!691, !754, !759, !763, !1034, !1043, !1064, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1086, !1090, !1091, !1092, !1093, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !18, line: 11, baseType: !755, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !44}
!758 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !18, line: 11, baseType: !760, size: 64, align: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!685, !44}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !18, line: 11, baseType: !764, size: 64, align: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !44}
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !768)
!768 = !{!769, !83}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !18, size: 832, align: 8, elements: !772)
!772 = !{!691, !773, !813, !814, !815, !816, !817, !818, !819, !1027, !1028, !1029, !1033}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !18, line: 11, baseType: !774, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !44}
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !778)
!778 = !{!779, !83}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 512, align: 8, elements: !782)
!782 = !{!691, !783, !787, !791, !796, !797, !801, !802}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !18, line: 11, baseType: !784, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!748, !44, !50}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !788, size: 64, align: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!748, !44, !723}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !18, line: 11, baseType: !792, size: 64, align: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!748, !44, !795}
!795 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !18, line: 11, baseType: !784, size: 64, align: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 11, baseType: !798, size: 64, align: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!748, !44, !54}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!45, !44, !806}
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !8, line: 11, size: 128, align: 8, elements: !807)
!807 = !{!808, !83}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !18, size: 128, align: 8, elements: !811)
!811 = !{!691, !812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 11, baseType: !713, size: 64, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 11, baseType: !720, size: 64, align: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 11, baseType: !820, size: 64, align: 64, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!823, !44}
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !8, line: 11, size: 128, align: 8, elements: !824)
!824 = !{!825, !83}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !18, size: 640, align: 8, elements: !828)
!828 = !{!691, !712, !717, !718, !719, !829, !830, !831, !1025, !1026}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 11, baseType: !832, size: 64, align: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!835, !44}
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !836)
!836 = !{!837, !83}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !18, size: 1216, align: 8, elements: !840)
!840 = !{!691, !841, !842, !856, !857, !878, !879, !880, !898, !899, !900, !901, !902, !903, !904, !905, !909, !985, !1024}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !18, line: 11, baseType: !843, size: 64, align: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !44}
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !847)
!847 = !{!848, !83}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !849, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !851)
!851 = !{!691, !852, !853, !854, !855}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !788, size: 64, align: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 11, baseType: !798, size: 64, align: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 11, baseType: !713, size: 64, align: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !18, line: 11, baseType: !858, size: 64, align: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!861, !44}
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !8, line: 11, size: 128, align: 8, elements: !862)
!862 = !{!863, !83}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 256, align: 8, elements: !866)
!866 = !{!691, !867, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 11, baseType: !868, size: 64, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!871, !44, !54}
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !8, line: 11, size: 192, align: 8, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !8, line: 11, baseType: !835, size: 128, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !8, line: 11, baseType: !43, size: 8, align: 8, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !8, line: 11, baseType: !43, size: 8, align: 8, offset: 136)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 11, baseType: !530, size: 64, align: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !18, line: 11, baseType: !881, size: 64, align: 64, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!884, !44}
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !885)
!885 = !{!886, !83}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !889)
!889 = !{!691, !890, !894, !854, !855}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !891, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!685, !44, !723}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 11, baseType: !895, size: 64, align: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!685, !44, !54}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 11, baseType: !720, size: 64, align: 64, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !18, line: 11, baseType: !713, size: 64, align: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !18, line: 11, baseType: !129, size: 64, align: 64, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 896)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 11, baseType: !906, size: 64, align: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!45, !44, !835}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !18, line: 11, baseType: !910, size: 64, align: 64, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !44}
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !914)
!914 = !{!915, !83}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !918)
!918 = !{!691, !919, !981, !854, !855}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !920, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !44, !723}
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !924)
!924 = !{!925, !83}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !18, size: 768, align: 8, elements: !928)
!928 = !{!691, !712, !717, !718, !929, !971, !972, !973, !974, !975, !976, !980}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !18, line: 11, baseType: !930, size: 64, align: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!933, !44}
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !8, line: 11, size: 128, align: 8, elements: !934)
!934 = !{!935, !83}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !938)
!938 = !{!691, !939, !967, !854, !855}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 11, baseType: !940, size: 64, align: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !44, !723}
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !8, line: 11, size: 128, align: 8, elements: !944)
!944 = !{!945, !83}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !18, size: 960, align: 8, elements: !948)
!948 = !{!691, !712, !717, !949, !815, !950, !951, !952, !953, !954, !955, !956, !957, !958, !962}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !18, line: 11, baseType: !760, size: 64, align: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !18, line: 11, baseType: !475, size: 64, align: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 11, baseType: !720, size: 64, align: 64, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 512)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !18, line: 11, baseType: !760, size: 64, align: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 640)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 704)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 11, baseType: !959, size: 64, align: 64, offset: 832)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!45, !44, !943}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 11, baseType: !963, size: 64, align: 64, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !44}
!966 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 11, baseType: !968, size: 64, align: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!943, !44, !54}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 11, baseType: !720, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 11, baseType: !44, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 11, baseType: !803, size: 64, align: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 11, baseType: !977, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
