; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22auction\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sha256\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/sha256\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22crypto/sha256\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./41.go", directory: "/home/ming/go/src/chaincode_repo/github/41")
!5 = !{!6, !23}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !25, line: 10, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "41.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !25, line: 10, size: 2624, align: 4, elements: !28)
!28 = !{!29, !33, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !25, line: 10, baseType: !30, size: 512, align: 8)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 1, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !25, line: 10, baseType: !34, size: 2048, align: 8, offset: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 1, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 256, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !25, line: 10, baseType: !38, size: 32, align: 32, offset: 2560)
!38 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 2592)
!40 = distinct !DISubprogram(name: "command_x2dline_x2darguments.BidReturn..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !43, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !{}
!46 = !DILocalVariable(name: "key1", arg: 1, scope: !40, file: !8, line: 1, type: !43)
!47 = !DILocation(line: 0, scope: !40)
!48 = !DILocalVariable(name: "key2", arg: 2, scope: !40, file: !8, line: 1, type: !43)
!49 = !DILocalVariable(name: "$ret51", scope: !40, file: !8, line: 1, type: !13)
!50 = !DILocation(line: 1, column: 1, scope: !40)
!51 = distinct !DISubprogram(name: "command_x2dline_x2darguments.PrivateBid..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!52 = !DILocalVariable(name: "key1", arg: 1, scope: !51, file: !8, line: 1, type: !43)
!53 = !DILocation(line: 0, scope: !51)
!54 = !DILocalVariable(name: "key2", arg: 2, scope: !51, file: !8, line: 1, type: !43)
!55 = !DILocalVariable(name: "$ret52", scope: !51, file: !8, line: 1, type: !13)
!56 = !DILocation(line: 1, column: 1, scope: !51)
!57 = distinct !DISubprogram(name: "command_x2dline_x2darguments.AskReturn..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!58 = !DILocalVariable(name: "key1", arg: 1, scope: !57, file: !8, line: 1, type: !43)
!59 = !DILocation(line: 0, scope: !57)
!60 = !DILocalVariable(name: "key2", arg: 2, scope: !57, file: !8, line: 1, type: !43)
!61 = !DILocalVariable(name: "$ret53", scope: !57, file: !8, line: 1, type: !13)
!62 = !DILocation(line: 1, column: 1, scope: !57)
!63 = distinct !DISubprogram(name: "command_x2dline_x2darguments.PrivateAsk..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!64 = !DILocalVariable(name: "key1", arg: 1, scope: !63, file: !8, line: 1, type: !43)
!65 = !DILocation(line: 0, scope: !63)
!66 = !DILocalVariable(name: "key2", arg: 2, scope: !63, file: !8, line: 1, type: !43)
!67 = !DILocalVariable(name: "$ret54", scope: !63, file: !8, line: 1, type: !13)
!68 = !DILocation(line: 1, column: 1, scope: !63)
!69 = distinct !DISubprogram(name: "command_x2dline_x2darguments.SmartContract..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!70 = !DILocalVariable(name: "key1", arg: 1, scope: !69, file: !8, line: 1, type: !43)
!71 = !DILocation(line: 0, scope: !69)
!72 = !DILocalVariable(name: "key2", arg: 2, scope: !69, file: !8, line: 1, type: !43)
!73 = !DILocalVariable(name: "$ret55", scope: !69, file: !8, line: 1, type: !13)
!74 = !DILocation(line: 1, column: 1, scope: !69)
!75 = distinct !DISubprogram(name: "command-line-arguments.SmartContract.Ask", linkageName: "command_x2dline_x2darguments.SmartContract.Ask", scope: null, file: !25, line: 119, type: !76, scopeLine: 119, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !140, !140, !1836, !81}
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !79)
!79 = !{!80, !87}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !81, size: 128, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !82)
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !88, size: 128, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !89)
!89 = !{!90, !139}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !93)
!93 = !{!94, !135}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !97)
!97 = !{!98, !100, !101, !103, !104, !105, !106, !107, !113, !114, !116, !134}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !99, size: 64, align: 64)
!99 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !99, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !102, size: 32, align: 32, offset: 128)
!102 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !84, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !115, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !115, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !123, size: 192, align: 64, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !124)
!124 = !{!125, !132, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !128)
!128 = !{!120, !121, !129, !130, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !86, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!81, !43}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !25, line: 34, size: 1152, align: 8, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !25, line: 35, baseType: !144, size: 1152, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !25, line: 16, size: 1152, align: 8, elements: !145)
!145 = !{!146, !147, !163, !168, !169, !170}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 16, baseType: !81, size: 128, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !25, line: 16, baseType: !148, size: 512, align: 64, offset: 128)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !25, line: 16, size: 512, align: 8, elements: !149)
!149 = !{!150, !151, !152, !158, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !25, line: 16, baseType: !81, size: 128, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !25, line: 16, baseType: !153, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !25, line: 16, size: 384, align: 8, elements: !155)
!155 = !{!146, !156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !25, line: 16, baseType: !159, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !25, line: 16, size: 256, align: 8, elements: !161)
!161 = !{!146, !156}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !25, line: 16, baseType: !164, size: 128, align: 64, offset: 640)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !25, line: 11, size: 128, align: 8, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !95, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !25, line: 16, baseType: !164, size: 128, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !25, line: 16, baseType: !164, size: 128, align: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !25, line: 16, baseType: !171, size: 128, align: 64, offset: 1024)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !25, line: 16, size: 128, align: 8, elements: !172)
!172 = !{!173, !167}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !10, size: 192, align: 8, elements: !176)
!176 = !{!177, !178, !399}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 16, baseType: !95, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !10, line: 16, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!44, !43, !182}
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !25, line: 16, size: 128, align: 8, elements: !183)
!183 = !{!184, !167}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !10, size: 384, align: 8, elements: !187)
!187 = !{!177, !188, !192, !201, !205, !206}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !10, line: 16, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!88, !43, !81, !81}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !10, line: 16, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !43, !81}
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !10, size: 320, align: 8, elements: !197)
!197 = !{!198, !199, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !10, line: 16, baseType: !81, size: 128, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !10, line: 16, baseType: !13, size: 8, align: 8, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 16, baseType: !88, size: 128, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !10, line: 16, baseType: !202, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!78, !43}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !10, line: 16, baseType: !202, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !10, line: 16, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !43}
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !10, size: 192, align: 8, elements: !211)
!211 = !{!212, !398}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !25, line: 16, size: 10624, align: 8, elements: !215)
!215 = !{!216, !220, !221, !222, !223, !224, !225, !227, !229, !230, !231, !244, !273, !274, !309, !310, !312, !322, !323, !328, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !353, !377, !378, !379, !380, !391, !392, !393, !394, !395, !396, !397}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !25, line: 16, baseType: !217, size: 192, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !218)
!218 = !{!219, !132, !133}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !84, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !25, line: 16, baseType: !226, size: 64, align: 64, offset: 1152)
!226 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !25, line: 16, baseType: !228, size: 64, align: 64, offset: 1216)
!228 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !25, line: 16, baseType: !164, size: 128, align: 64, offset: 1280)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 16, baseType: !86, size: 64, align: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 16, baseType: !232, size: 64, align: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !25, line: 16, size: 256, align: 8, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !25, line: 16, baseType: !13, size: 8, align: 8)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !25, line: 16, baseType: !237, size: 192, align: 64, offset: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !25, line: 16, size: 192, align: 8, elements: !238)
!238 = !{!239, !242, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !86, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !25, line: 16, baseType: !245, size: 1984, align: 64, offset: 1536)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 16, size: 1984, align: 8, elements: !246)
!246 = !{!247, !251, !252, !253, !254, !255, !256, !257, !258, !259, !272}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !25, line: 16, baseType: !248, size: 192, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !249)
!249 = !{!250, !132, !133}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !115, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !25, line: 16, baseType: !260, size: 192, align: 64, offset: 1600)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !10, size: 192, align: 8, elements: !261)
!261 = !{!262, !132, !133}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !25, line: 16, size: 320, align: 8, elements: !265)
!265 = !{!266, !271}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 16, baseType: !267, size: 192, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !25, line: 16, size: 192, align: 8, elements: !268)
!268 = !{!269, !242, !243}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 16, baseType: !164, size: 128, align: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !25, line: 16, baseType: !260, size: 192, align: 64, offset: 1792)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !25, line: 16, baseType: !245, size: 1984, align: 64, offset: 3520)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !25, line: 16, baseType: !275, size: 192, align: 64, offset: 5504)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !25, line: 15, size: 192, align: 8, elements: !276)
!276 = !{!277, !278, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !25, line: 15, baseType: !22, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !25, line: 15, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !25, line: 15, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !25, line: 15, size: 832, align: 8, elements: !283)
!283 = !{!284, !285, !294, !305, !306, !307, !308}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 15, baseType: !81, size: 128, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !25, line: 15, baseType: !286, size: 192, align: 64, offset: 128)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !10, size: 192, align: 8, elements: !287)
!287 = !{!288, !132, !133}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !25, line: 15, size: 256, align: 8, elements: !291)
!291 = !{!284, !292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !25, line: 15, baseType: !86, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !25, line: 15, baseType: !295, size: 192, align: 64, offset: 320)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !10, size: 192, align: 8, elements: !296)
!296 = !{!297, !132, !133}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !25, line: 15, size: 128, align: 8, elements: !300)
!300 = !{!301, !302, !303, !304}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !25, line: 15, baseType: !279, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !25, line: 15, baseType: !16, size: 8, align: 8, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 72)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !25, line: 15, baseType: !81, size: 128, align: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !25, line: 15, baseType: !279, size: 64, align: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !25, line: 15, baseType: !279, size: 64, align: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !25, line: 15, baseType: !289, size: 64, align: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !25, line: 16, baseType: !275, size: 192, align: 64, offset: 5696)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !25, line: 16, baseType: !311, size: 64, align: 64, offset: 5888)
!311 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !25, line: 16, baseType: !313, size: 192, align: 64, offset: 5952)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !10, size: 192, align: 8, elements: !314)
!314 = !{!315, !132, !133}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !25, line: 16, size: 448, align: 8, elements: !318)
!318 = !{!319, !320, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !25, line: 16, baseType: !267, size: 192, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !25, line: 16, baseType: !313, size: 192, align: 64, offset: 6144)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !25, line: 16, baseType: !324, size: 192, align: 64, offset: 6336)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !10, size: 192, align: 8, elements: !325)
!325 = !{!326, !132, !133}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !25, line: 16, baseType: !329, size: 192, align: 64, offset: 6528)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !10, size: 192, align: 8, elements: !330)
!330 = !{!331, !132, !133}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !25, line: 16, baseType: !324, size: 192, align: 64, offset: 6720)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 6912)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 6920)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !25, line: 16, baseType: !86, size: 64, align: 64, offset: 6976)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 7040)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 7104)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !25, line: 16, baseType: !217, size: 192, align: 64, offset: 7296)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 7488)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 7680)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 7872)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 8064)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !25, line: 16, baseType: !346, size: 192, align: 64, offset: 8256)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !10, size: 192, align: 8, elements: !347)
!347 = !{!348, !132, !133}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !25, line: 16, size: 192, align: 8, elements: !351)
!351 = !{!352, !242, !243}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !84, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !25, line: 16, baseType: !354, size: 192, align: 64, offset: 8448)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !10, size: 192, align: 8, elements: !355)
!355 = !{!356, !132, !133}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !25, line: 16, size: 1152, align: 8, elements: !360)
!360 = !{!361, !362, !363, !370, !371, !372, !373, !374, !375, !376}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !25, line: 16, baseType: !81, size: 128, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !25, line: 16, baseType: !364, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !25, line: 16, size: 320, align: 8, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !25, line: 16, baseType: !81, size: 128, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !25, line: 16, baseType: !81, size: 128, align: 64, offset: 1024)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 8640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 8704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 8896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !25, line: 16, baseType: !381, size: 192, align: 64, offset: 9088)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !10, size: 192, align: 8, elements: !382)
!382 = !{!383, !132, !133}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !25, line: 16, size: 384, align: 8, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !25, line: 16, baseType: !350, size: 192, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !25, line: 16, baseType: !390, size: 192, align: 64, offset: 192)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !25, line: 16, size: 192, align: 8, elements: !351)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !25, line: 16, baseType: !381, size: 192, align: 64, offset: 9280)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 9472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 9664)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 9856)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 10048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !25, line: 16, baseType: !248, size: 192, align: 64, offset: 10240)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !25, line: 16, baseType: !324, size: 192, align: 64, offset: 10432)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !88, size: 128, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !10, line: 16, baseType: !400, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!44, !43, !403}
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 15, size: 128, align: 8, elements: !404)
!404 = !{!405, !167}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !408)
!408 = !{!409, !410, !414, !415, !419, !427, !435, !436, !437, !438, !455, !462, !1696, !1700, !1727, !1731, !1732, !1736, !1737, !1741, !1756, !1771, !1775, !1779, !1783, !1784, !1788, !1789, !1793, !1800, !1801, !1808, !1817, !1818, !1822, !1826, !1827, !1828, !1829}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 15, baseType: !95, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 15, baseType: !411, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!78, !43, !81, !248}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 15, baseType: !189, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 15, baseType: !416, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!88, !43, !81}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 15, baseType: !420, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !43}
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !424)
!424 = !{!425, !132, !133}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 15, baseType: !428, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !43}
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !217, size: 192, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !88, size: 128, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 15, baseType: !428, size: 64, align: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 15, baseType: !136, size: 64, align: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 15, baseType: !428, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 15, baseType: !439, size: 64, align: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !43}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !444)
!444 = !{!445, !446, !447, !448, !450, !451, !452, !453, !454}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !86, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !449, size: 16, align: 16, offset: 80)
!449 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !102, size: 32, align: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !99, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !43}
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !460)
!460 = !{!80, !461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !248, size: 192, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 15, baseType: !463, size: 64, align: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !43, !81}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !467)
!467 = !{!468, !87}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !469, size: 128, align: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 15, size: 128, align: 8, elements: !470)
!470 = !{!471, !167}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !474)
!474 = !{!409, !475, !479, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 15, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!88, !43}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!13, !43}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 15, baseType: !484, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !43}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !488)
!488 = !{!489, !1182}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 15, size: 704, align: 8, elements: !492)
!492 = !{!493, !494, !495, !1691, !1692, !1694, !1695}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 15, baseType: !81, size: 128, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 15, baseType: !217, size: 192, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 15, baseType: !496, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 15, size: 448, align: 8, elements: !498)
!498 = !{!499, !1687, !1688, !1689, !1690}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 15, baseType: !500, size: 64, align: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 15, size: 64, align: 8, elements: !501)
!501 = !{!502, !504, !515, !521}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 15, baseType: !503, align: 8)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 15, align: 1, elements: !45)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 15, baseType: !505, align: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, align: 8, elements: !513)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 15, size: 64, align: 8, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 15, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!44}
!513 = !{!514}
!514 = !DISubrange(count: 0, lowerBound: 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 15, baseType: !516, align: 32)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, align: 4, elements: !513)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 15, size: 64, align: 4, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 15, baseType: !38, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 15, baseType: !102, size: 32, align: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 15, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 15, size: 2624, align: 8, elements: !524)
!524 = !{!525, !688, !1479, !1487, !1492, !1493, !1494, !1589}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 15, baseType: !526, size: 128, align: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 11, size: 128, align: 8, elements: !527)
!527 = !{!528, !167}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 11, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !531)
!531 = !{!532, !533, !537, !541, !542, !547, !548, !549, !553, !573, !574, !578, !586, !597, !598, !602, !603, !604, !609, !610, !659, !667, !668, !669, !670, !671, !672, !673, !674, !678, !679, !683, !684}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 11, baseType: !95, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!86, !43}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 11, baseType: !538, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!13, !43, !526}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 11, baseType: !543, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !43}
!546 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 11, baseType: !480, size: 64, align: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 11, baseType: !538, size: 64, align: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 11, baseType: !550, size: 64, align: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!526, !43}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 11, baseType: !554, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !43, !86}
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 11, size: 832, align: 8, elements: !558)
!558 = !{!559, !560, !561, !562, !567, !568, !572}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 11, baseType: !81, size: 128, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 11, baseType: !81, size: 128, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 11, baseType: !526, size: 128, align: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 11, baseType: !563, size: 128, align: 64, offset: 384)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 11, size: 128, align: 8, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !84, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 11, baseType: !99, size: 64, align: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !569, size: 192, align: 64, offset: 576)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !570)
!570 = !{!571, !132, !133}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !270, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 11, baseType: !13, size: 8, align: 8, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 11, baseType: !575, size: 64, align: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!557, !43, !569}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 11, baseType: !579, size: 64, align: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !43, !81}
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !557, size: 832, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 832)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 11, baseType: !587, size: 64, align: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!582, !43, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!13, !81}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 11, baseType: !538, size: 64, align: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 11, baseType: !599, size: 64, align: 64, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!526, !43, !86}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 11, baseType: !480, size: 64, align: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 11, baseType: !550, size: 64, align: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 11, baseType: !605, size: 64, align: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !43}
!608 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 11, baseType: !611, size: 64, align: 64, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !43, !86}
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !25, line: 11, size: 640, align: 8, elements: !615)
!615 = !{!559, !560, !561, !616, !658}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !25, line: 11, baseType: !617, size: 192, align: 64, offset: 384)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 11, size: 192, align: 8, elements: !618)
!618 = !{!619, !655, !656}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !25, line: 11, size: 512, align: 8, elements: !622)
!622 = !{!623, !624, !625, !626, !628, !629, !630, !631, !636, !637, !638, !654}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 11, baseType: !99, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 11, baseType: !99, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 11, baseType: !102, size: 32, align: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !25, line: 11, baseType: !627, size: 8, align: 8, offset: 160)
!627 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 168)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 176)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 184)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !25, line: 11, baseType: !632, size: 64, align: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !112, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 11, baseType: !84, size: 64, align: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 11, baseType: !115, size: 64, align: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 11, baseType: !639, size: 64, align: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !25, line: 11, size: 320, align: 8, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 11, baseType: !115, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 11, baseType: !115, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 11, baseType: !645, size: 192, align: 64, offset: 128)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !646)
!646 = !{!647, !132, !133}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !25, line: 11, size: 320, align: 8, elements: !650)
!650 = !{!642, !643, !651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !25, line: 11, baseType: !657, size: 64, align: 64, offset: 128)
!657 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !86, size: 64, align: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 11, baseType: !660, size: 64, align: 64, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !43, !81}
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !614, size: 640, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 11, baseType: !136, size: 64, align: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 11, baseType: !534, size: 64, align: 64, offset: 1600)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 11, baseType: !599, size: 64, align: 64, offset: 1664)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 11, baseType: !136, size: 64, align: 64, offset: 1728)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 11, baseType: !675, size: 64, align: 64, offset: 1792)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!99, !43}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 11, baseType: !136, size: 64, align: 64, offset: 1856)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 11, baseType: !680, size: 64, align: 64, offset: 1920)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!620, !43}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 11, baseType: !136, size: 64, align: 64, offset: 1984)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 11, baseType: !685, size: 64, align: 64, offset: 2048)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!639, !43}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !25, line: 15, baseType: !689, size: 128, align: 64, offset: 128)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !690)
!690 = !{!691, !167}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !694)
!694 = !{!409, !695, !1405, !1409, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1454, !1455, !1456, !1457, !1458, !1462, !1476, !1477, !1478}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 15, baseType: !696, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!699, !43}
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !700)
!700 = !{!701, !167}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !704)
!704 = !{!409, !705, !1401, !857, !858}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !706, size: 64, align: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !43, !726}
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !710)
!710 = !{!711, !167}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !714)
!714 = !{!409, !715, !720, !721, !722, !727, !1335, !834, !1028, !1336, !1340, !1358, !1036, !1379}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !716, size: 64, align: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!719, !43}
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !25, line: 15, size: 128, align: 8, elements: !564)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !723, size: 64, align: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !43}
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 15, size: 128, align: 8, elements: !564)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !728, size: 64, align: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !43}
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !25, line: 15, size: 128, align: 8, elements: !732)
!732 = !{!733, !167}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !736)
!736 = !{!409, !737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 15, baseType: !738, size: 64, align: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !43}
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !25, line: 15, size: 128, align: 8, elements: !742)
!742 = !{!743, !167}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !746)
!746 = !{!409, !747, !1107, !1108, !1112, !1117, !1121, !1122, !1123, !1124, !1125, !1126, !1299, !1310, !1314, !1318, !1331}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 15, baseType: !748, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!44, !43, !751}
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !752)
!752 = !{!753, !167}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !756)
!756 = !{!409, !757, !762, !766, !1037, !1046, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1089, !1093, !1094, !1095, !1096, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 15, baseType: !758, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !43}
!761 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 15, baseType: !763, size: 64, align: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!689, !43}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 15, baseType: !767, size: 64, align: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!770, !43}
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !771)
!771 = !{!772, !167}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !775)
!775 = !{!409, !776, !816, !817, !818, !819, !820, !821, !822, !1030, !1031, !1032, !1036}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 15, baseType: !777, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !43}
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !781)
!781 = !{!782, !167}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !785)
!785 = !{!409, !786, !790, !794, !799, !800, !804, !805}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 15, baseType: !787, size: 64, align: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!751, !43, !81}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !791, size: 64, align: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!751, !43, !726}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 15, baseType: !795, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!751, !43, !798}
!798 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 15, baseType: !787, size: 64, align: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !801, size: 64, align: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!751, !43, !86}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !806, size: 64, align: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!44, !43, !809}
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !25, line: 15, size: 128, align: 8, elements: !810)
!810 = !{!811, !167}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !814)
!814 = !{!409, !815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !716, size: 64, align: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !723, size: 64, align: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !823, size: 64, align: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !43}
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !25, line: 15, size: 128, align: 8, elements: !827)
!827 = !{!828, !167}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !831)
!831 = !{!409, !715, !720, !721, !722, !832, !833, !834, !1028, !1029}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !835, size: 64, align: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !43}
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !839)
!839 = !{!840, !167}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !841, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !843)
!843 = !{!409, !844, !845, !859, !860, !881, !882, !883, !901, !902, !903, !904, !905, !906, !907, !908, !912, !988, !1027}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 15, baseType: !846, size: 64, align: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !43}
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !850)
!850 = !{!851, !167}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !854)
!854 = !{!409, !855, !856, !857, !858}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !791, size: 64, align: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !801, size: 64, align: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !806, size: 64, align: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !716, size: 64, align: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 15, baseType: !861, size: 64, align: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !43}
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !25, line: 15, size: 128, align: 8, elements: !865)
!865 = !{!866, !167}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !869)
!869 = !{!409, !870, !879, !880}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !871, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !43, !86}
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !25, line: 15, size: 192, align: 8, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !25, line: 15, baseType: !838, size: 128, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 136)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !806, size: 64, align: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !534, size: 64, align: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 15, baseType: !884, size: 64, align: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !43}
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !888)
!888 = !{!889, !167}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !892)
!892 = !{!409, !893, !897, !857, !858}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !894, size: 64, align: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!689, !43, !726}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !898, size: 64, align: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!689, !43, !86}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !723, size: 64, align: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 15, baseType: !716, size: 64, align: 64, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 768)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 15, baseType: !136, size: 64, align: 64, offset: 832)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !806, size: 64, align: 64, offset: 896)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 15, baseType: !909, size: 64, align: 64, offset: 960)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!44, !43, !838}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 15, baseType: !913, size: 64, align: 64, offset: 1024)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !43}
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !917)
!917 = !{!918, !167}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !921)
!921 = !{!409, !922, !984, !857, !858}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !923, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !43, !726}
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !927)
!927 = !{!928, !167}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !931)
!931 = !{!409, !715, !720, !721, !932, !974, !975, !976, !977, !978, !979, !983}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 15, baseType: !933, size: 64, align: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !43}
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !937)
!937 = !{!938, !167}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !941)
!941 = !{!409, !942, !970, !857, !858}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !943, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!946, !43, !726}
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !947)
!947 = !{!948, !167}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !951)
!951 = !{!409, !715, !720, !952, !818, !953, !954, !955, !956, !957, !958, !959, !960, !961, !965}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 15, baseType: !763, size: 64, align: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 15, baseType: !480, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !723, size: 64, align: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 15, baseType: !763, size: 64, align: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !806, size: 64, align: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 15, baseType: !962, size: 64, align: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!44, !43, !946}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 15, baseType: !966, size: 64, align: 64, offset: 896)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !43}
!969 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!946, !43, !86}
