; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22debug\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22logs\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/kbkontrakt/hlfabric-ccdevkit/logs\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/kbkontrakt/hlfabric-ccdevkit/logs\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22logrus\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/sirupsen/logrus\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/sirupsen/logrus\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./91.go", directory: "/home/ming/go/src/chaincode_repo/github/91join")
!5 = !{!6, !123}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "command_x2dline_x2darguments.debugLog", linkageName: "command_x2dline_x2darguments.debugLog", scope: !3, file: !8, line: 26, type: !9, isLocal: true, isDefinition: true)
!8 = !DIFile(filename: "91.go", directory: ".")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaggedLogger", file: !8, line: 20, size: 384, align: 8, elements: !11)
!11 = !{!12, !105, !119}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "logger", file: !8, line: 20, baseType: !13, size: 128, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !8, line: 20, size: 128, align: 8, elements: !14)
!14 = !{!15, !85}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 20, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*any,int,int})void,*func(*void,string,struct{*any,int,int})void,*func(*void,struct{*any,int,int})void,*func(*void,string,struct{*any,int,int})void,*func(*void,struct{*any,int,int})void,*func(*void,string,struct{*any,int,int})void,*func(*void,Level)bool,*func(*void,Level)void,*func(*void,struct{*any,int,int})void,*func(*void,string,struct{*any,int,int})void}", file: !18, size: 704, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !74, !86, !90, !91, !92, !93, !94, !99, !103, !104}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 20, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !23, line: 1, size: 512, align: 8, elements: !24)
!23 = !DIFile(filename: "<built-in>", directory: "")
!24 = !{!25, !27, !28, !30, !32, !33, !34, !35, !46, !48, !55, !73}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !23, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !23, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !23, line: 1, baseType: !29, size: 32, align: 32, offset: 128)
!29 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 160)
!31 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 168)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 176)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 184)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !23, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 1, size: 64, align: 8, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !44}
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "void")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !23, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !23, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !23, line: 1, size: 128, align: 8, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !23, line: 1, baseType: !47, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !23, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !23, line: 1, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !23, line: 1, size: 320, align: 8, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !23, line: 1, baseType: !49, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !23, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !23, line: 1, baseType: !62, size: 192, align: 64, offset: 128)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !63)
!63 = !{!64, !71, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !23, line: 1, size: 320, align: 8, elements: !67)
!67 = !{!59, !60, !68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Debug", file: !18, line: 20, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!45, !44, !78}
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*any,int,int}", file: !18, size: 192, align: 8, elements: !79)
!79 = !{!80, !71, !72}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 21, size: 128, align: 8, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !21, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Debugf", file: !18, line: 20, baseType: !87, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!45, !44, !50, !78}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 20, baseType: !75, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Errorf", file: !18, line: 20, baseType: !87, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !18, line: 20, baseType: !75, size: 64, align: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Infof", file: !18, line: 20, baseType: !87, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "IsLevelEnabled", file: !18, line: 20, baseType: !95, size: 64, align: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!43, !44, !98}
!98 = !DIBasicType(name: "Level", size: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "SetLevel", file: !18, line: 20, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!45, !44, !98}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Warning", file: !18, line: 20, baseType: !75, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Warningf", file: !18, line: 20, baseType: !87, size: 64, align: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tags", file: !8, line: 20, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !23, line: 1, size: 384, align: 8, elements: !108)
!108 = !{!109, !110, !111, !112, !114, !115, !116, !117, !118}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !23, line: 1, baseType: !54, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !23, line: 1, baseType: !31, size: 8, align: 8, offset: 72)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !23, line: 1, baseType: !113, size: 16, align: 16, offset: 80)
!113 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !23, line: 1, baseType: !29, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !23, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tagsOrder", file: !8, line: 20, baseType: !120, size: 192, align: 64, offset: 192)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !121)
!121 = !{!122, !71, !72}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !49, size: 64, align: 64)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !23, line: 1, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !18, size: 128, align: 8, elements: !126)
!126 = !{!127, !128, !132, !133, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !18, line: 1, baseType: !43, size: 8, align: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !18, line: 1, baseType: !129, size: 24, align: 8, offset: 8)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 1, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 3, lowerBound: 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !18, line: 1, baseType: !43, size: 8, align: 8, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !18, line: 1, baseType: !43, size: 8, align: 8, offset: 40)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !18, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!136 = distinct !DISubprogram(name: "command_x2dline_x2darguments..import", scope: null, file: !8, line: 15, type: !137, scopeLine: 15, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!45}
!139 = !{}
!140 = !DILocation(line: 1, column: 1, scope: !141)
!141 = !DILexicalBlockFile(scope: !136, file: !23, discriminator: 0)
!142 = !DILocation(line: 26, column: 38, scope: !143)
!143 = !DILexicalBlockFile(scope: !136, file: !8, discriminator: 0)
!144 = !DILocation(line: 26, column: 21, scope: !143)
!145 = !DILocation(line: 26, column: 5, scope: !143)
!146 = distinct !DISubprogram(name: "command_x2dline_x2darguments.debugGetStateByEmptyKey..eq", scope: null, file: !23, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !139)
!147 = !DILocalVariable(name: "key1", arg: 1, scope: !146, file: !23, line: 1, type: !44)
!148 = !DILocation(line: 0, scope: !146)
!149 = !DILocalVariable(name: "key2", arg: 2, scope: !146, file: !23, line: 1, type: !44)
!150 = !DILocalVariable(name: "$ret71", scope: !146, file: !23, line: 1, type: !43)
!151 = !DILocation(line: 1, column: 1, scope: !146)
!152 = distinct !DISubprogram(name: "command-line-arguments.debugGetStateByEmptyKey.CreateCompositeKey..stub", linkageName: "command_x2dline_x2darguments.debugGetStateByEmptyKey.CreateCompositeKey..stub", scope: null, file: !8, line: 23, type: !153, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !139)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !171, !171, !50, !120}
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !18, size: 256, align: 8, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !50, size: 128, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !159, size: 128, align: 64, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !23, line: 1, size: 128, align: 8, elements: !160)
!160 = !{!161, !170}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 1, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!50, !44}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !23, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.debugGetStateByEmptyKey", file: !8, line: 28, size: 128, align: 8, elements: !173)
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ChaincodeStubInterface", file: !8, line: 29, baseType: !175, size: 128, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !8, line: 23, size: 128, align: 8, elements: !176)
!176 = !{!177, !85}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void).google.golang.org/protobuf/internal/impl.extensionMap,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{.google.golang.org/protobuf/internal/impl.extensionMap,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !18, size: 2496, align: 8, elements: !180)
!180 = !{!181, !182, !186, !190, !194, !205, !213, !214, !215, !216, !220, !227, !1460, !1464, !1491, !1495, !1496, !1500, !1501, !1505, !1520, !1535, !1539, !1543, !1547, !1548, !1552, !1553, !1557, !1564, !1565, !1572, !1581, !1582, !1586, !1590, !1591, !1592, !1593}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 23, baseType: !21, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !18, line: 23, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!155, !44, !50, !120}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !18, line: 23, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!159, !44, !50, !50}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !18, line: 23, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!159, !44, !50}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !18, line: 23, baseType: !195, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !44}
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !199)
!199 = !{!200, !71, !72}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !203)
!203 = !{!204, !71, !72}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !47, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !18, line: 23, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !44}
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !18, size: 320, align: 8, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !202, size: 192, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !159, size: 128, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !18, line: 23, baseType: !206, size: 64, align: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !18, line: 23, baseType: !206, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !18, line: 23, baseType: !217, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!106, !44}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !18, line: 23, baseType: !221, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !44}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !18, size: 320, align: 8, elements: !225)
!225 = !{!157, !226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !120, size: 192, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !18, line: 23, baseType: !228, size: 64, align: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !44, !50}
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !18, size: 256, align: 8, elements: !232)
!232 = !{!233, !158}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !234, size: 128, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !8, line: 23, size: 128, align: 8, elements: !235)
!235 = !{!236, !85}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !18, size: 256, align: 8, elements: !239)
!239 = !{!181, !240, !244, !248}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 23, baseType: !241, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!159, !44}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!43, !44}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !18, line: 23, baseType: !249, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !44}
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !18, size: 192, align: 8, elements: !253)
!253 = !{!254, !949}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !8, line: 23, size: 704, align: 8, elements: !257)
!257 = !{!258, !259, !260, !1455, !1456, !1458, !1459}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !8, line: 23, baseType: !50, size: 128, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 23, baseType: !202, size: 192, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !8, line: 23, baseType: !261, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !8, line: 23, size: 448, align: 8, elements: !263)
!263 = !{!264, !1450, !1451, !1452, !1454}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 23, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !8, line: 23, size: 64, align: 8, elements: !266)
!266 = !{!267, !269, !278, !285}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !8, line: 23, baseType: !268, align: 8)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !8, line: 23, align: 1, elements: !139)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !8, line: 23, baseType: !270, align: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, align: 8, elements: !276)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !273)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!276 = !{!277}
!277 = !DISubrange(count: 0, lowerBound: 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !8, line: 23, baseType: !279, align: 32)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, align: 4, elements: !276)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !8, line: 21, size: 64, align: 4, elements: !281)
!281 = !{!282, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 21, baseType: !283, size: 32, align: 32)
!283 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !8, line: 21, baseType: !29, size: 32, align: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !8, line: 23, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !8, line: 23, size: 2624, align: 8, elements: !288)
!288 = !{!289, !452, !1246, !1254, !1255, !1256, !1257, !1352}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !8, line: 23, baseType: !290, size: 128, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !8, line: 23, size: 128, align: 8, elements: !291)
!291 = !{!292, !85}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !18, size: 2112, align: 8, elements: !295)
!295 = !{!181, !296, !300, !304, !305, !310, !311, !312, !316, !337, !338, !342, !350, !361, !362, !366, !367, !368, !373, !374, !423, !431, !432, !433, !434, !435, !436, !437, !438, !442, !443, !447, !448}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!54, !44}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !18, line: 23, baseType: !301, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!43, !44, !290}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !18, line: 23, baseType: !306, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !44}
!309 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !18, line: 23, baseType: !301, size: 64, align: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !18, line: 23, baseType: !313, size: 64, align: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!290, !44}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !18, line: 23, baseType: !317, size: 64, align: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !44, !54}
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !8, line: 23, size: 832, align: 8, elements: !321)
!321 = !{!322, !323, !324, !325, !330, !331, !336}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 23, baseType: !50, size: 128, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !8, line: 23, baseType: !50, size: 128, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 23, baseType: !290, size: 128, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !8, line: 23, baseType: !326, size: 128, align: 64, offset: 384)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !8, line: 23, size: 128, align: 8, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !47, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !8, line: 23, baseType: !26, size: 64, align: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 23, baseType: !332, size: 192, align: 64, offset: 576)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !18, size: 192, align: 8, elements: !333)
!333 = !{!334, !71, !72}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !8, line: 23, baseType: !43, size: 8, align: 8, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !18, line: 23, baseType: !339, size: 64, align: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!320, !44, !332}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !18, line: 23, baseType: !343, size: 64, align: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !44, !50}
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !18, size: 896, align: 8, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !320, size: 832, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !43, size: 8, align: 8, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !18, line: 23, baseType: !351, size: 64, align: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!346, !44, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!43, !50}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !18, line: 23, baseType: !301, size: 64, align: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !18, line: 23, baseType: !363, size: 64, align: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!290, !44, !54}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !18, line: 23, baseType: !313, size: 64, align: 64, offset: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !18, line: 23, baseType: !369, size: 64, align: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!372, !44}
!372 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 1152)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !18, line: 23, baseType: !375, size: 64, align: 64, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !44, !54}
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !8, line: 23, size: 640, align: 8, elements: !379)
!379 = !{!322, !323, !324, !380, !422}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !8, line: 23, baseType: !381, size: 192, align: 64, offset: 384)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 23, size: 192, align: 8, elements: !382)
!382 = !{!383, !419, !420}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !8, line: 23, size: 512, align: 8, elements: !386)
!386 = !{!387, !388, !389, !390, !392, !393, !394, !395, !400, !401, !402, !418}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 23, baseType: !26, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 23, baseType: !26, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 23, baseType: !29, size: 32, align: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 23, baseType: !391, size: 8, align: 8, offset: 160)
!391 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 23, baseType: !31, size: 8, align: 8, offset: 168)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 23, baseType: !31, size: 8, align: 8, offset: 176)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 23, baseType: !31, size: 8, align: 8, offset: 184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 23, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !40, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 23, baseType: !47, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 23, baseType: !49, size: 64, align: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 23, baseType: !403, size: 64, align: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !8, line: 23, size: 320, align: 8, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 23, baseType: !49, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 23, baseType: !49, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 23, baseType: !409, size: 192, align: 64, offset: 128)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !18, size: 192, align: 8, elements: !410)
!410 = !{!411, !71, !72}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !8, line: 23, size: 320, align: 8, elements: !414)
!414 = !{!406, !407, !415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 23, baseType: !44, size: 64, align: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !44, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 23, baseType: !44, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 23, baseType: !44, size: 64, align: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !8, line: 23, baseType: !44, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !8, line: 23, baseType: !421, size: 64, align: 64, offset: 128)
!421 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !18, line: 23, baseType: !424, size: 64, align: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!427, !44, !50}
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !18, size: 704, align: 8, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !378, size: 640, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !43, size: 8, align: 8, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 1344)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 1408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 1472)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 1536)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 1600)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !18, line: 23, baseType: !363, size: 64, align: 64, offset: 1664)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 1728)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !18, line: 23, baseType: !439, size: 64, align: 64, offset: 1792)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!26, !44}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 1856)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !18, line: 23, baseType: !444, size: 64, align: 64, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!384, !44}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 1984)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !18, line: 23, baseType: !449, size: 64, align: 64, offset: 2048)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!403, !44}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !8, line: 23, baseType: !453, size: 128, align: 64, offset: 128)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !454)
!454 = !{!455, !85}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !18, size: 1408, align: 8, elements: !458)
!458 = !{!181, !459, !1172, !1176, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1221, !1222, !1223, !1224, !1225, !1229, !1243, !1244, !1245}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !18, line: 23, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !44}
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !464)
!464 = !{!465, !85}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !468)
!468 = !{!181, !469, !1168, !621, !622}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !44, !490}
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !474)
!474 = !{!475, !85}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !18, size: 896, align: 8, elements: !478)
!478 = !{!181, !479, !484, !485, !486, !491, !1102, !598, !794, !1103, !1107, !1125, !802, !1146}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 23, baseType: !480, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !44}
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !8, line: 23, size: 128, align: 8, elements: !327)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !44}
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 23, size: 128, align: 8, elements: !327)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !492, size: 64, align: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !44}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !8, line: 23, size: 128, align: 8, elements: !496)
!496 = !{!497, !85}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !18, size: 128, align: 8, elements: !500)
!500 = !{!181, !501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !18, line: 23, baseType: !502, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !44}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !8, line: 23, size: 128, align: 8, elements: !506)
!506 = !{!507, !85}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !18, size: 1088, align: 8, elements: !510)
!510 = !{!181, !511, !872, !873, !877, !884, !888, !889, !890, !891, !892, !893, !1066, !1077, !1081, !1085, !1098}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !18, line: 23, baseType: !512, size: 64, align: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!45, !44, !515}
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !516)
!516 = !{!517, !85}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !18, size: 2112, align: 8, elements: !520)
!520 = !{!181, !521, !526, !530, !803, !811, !832, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !854, !858, !859, !860, !861, !865, !866, !867, !868, !869, !870, !871}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !18, line: 23, baseType: !522, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !44}
!525 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !18, line: 23, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!453, !44}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !18, line: 23, baseType: !531, size: 64, align: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !44}
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !535)
!535 = !{!536, !85}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !18, size: 832, align: 8, elements: !539)
!539 = !{!181, !540, !580, !581, !582, !583, !584, !585, !586, !796, !797, !798, !802}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !18, line: 23, baseType: !541, size: 64, align: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !44}
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !545)
!545 = !{!546, !85}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 512, align: 8, elements: !549)
!549 = !{!181, !550, !554, !558, !563, !564, !568, !569}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !18, line: 23, baseType: !551, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!515, !44, !50}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !555, size: 64, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!515, !44, !490}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !18, line: 23, baseType: !559, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!515, !44, !562}
!562 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !18, line: 23, baseType: !551, size: 64, align: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !565, size: 64, align: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!515, !44, !54}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!45, !44, !573}
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !8, line: 23, size: 128, align: 8, elements: !574)
!574 = !{!575, !85}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !18, size: 128, align: 8, elements: !578)
!578 = !{!181, !579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 23, baseType: !480, size: 64, align: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !587, size: 64, align: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !44}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !8, line: 23, size: 128, align: 8, elements: !591)
!591 = !{!592, !85}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !18, size: 640, align: 8, elements: !595)
!595 = !{!181, !479, !484, !485, !486, !596, !597, !598, !794, !795}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !599, size: 64, align: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !44}
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !603)
!603 = !{!604, !85}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !18, size: 1216, align: 8, elements: !607)
!607 = !{!181, !608, !609, !623, !624, !645, !646, !647, !665, !666, !667, !668, !669, !670, !671, !672, !676, !752, !793}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !18, line: 23, baseType: !610, size: 64, align: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!613, !44}
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !614)
!614 = !{!615, !85}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !618)
!618 = !{!181, !619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !555, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !565, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 23, baseType: !480, size: 64, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !18, line: 23, baseType: !625, size: 64, align: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !44}
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !8, line: 23, size: 128, align: 8, elements: !629)
!629 = !{!630, !85}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 256, align: 8, elements: !633)
!633 = !{!181, !634, !643, !644}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !44, !54}
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !8, line: 23, size: 192, align: 8, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !8, line: 23, baseType: !602, size: 128, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !8, line: 23, baseType: !43, size: 8, align: 8, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !8, line: 23, baseType: !43, size: 8, align: 8, offset: 136)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !18, line: 23, baseType: !648, size: 64, align: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !44}
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !652)
!652 = !{!653, !85}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !656)
!656 = !{!181, !657, !661, !621, !622}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !658, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!453, !44, !490}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !662, size: 64, align: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!453, !44, !54}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !18, line: 23, baseType: !480, size: 64, align: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !673, size: 64, align: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!45, !44, !602}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !18, line: 23, baseType: !677, size: 64, align: 64, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !44}
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !681)
!681 = !{!682, !85}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !685)
!685 = !{!181, !686, !748, !621, !622}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !687, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !44, !490}
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !691)
!691 = !{!692, !85}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !18, size: 768, align: 8, elements: !695)
!695 = !{!181, !479, !484, !485, !696, !738, !739, !740, !741, !742, !743, !747}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !18, line: 23, baseType: !697, size: 64, align: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !44}
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !8, line: 23, size: 128, align: 8, elements: !701)
!701 = !{!702, !85}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 320, align: 8, elements: !705)
!705 = !{!181, !706, !734, !621, !622}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !18, line: 23, baseType: !707, size: 64, align: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !44, !490}
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !711)
!711 = !{!712, !85}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !18, size: 960, align: 8, elements: !715)
!715 = !{!181, !479, !484, !716, !582, !717, !718, !719, !720, !721, !722, !723, !724, !725, !729}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !18, line: 23, baseType: !527, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !18, line: 23, baseType: !527, size: 64, align: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !726, size: 64, align: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!45, !44, !710}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!733, !44}
!733 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !735, size: 64, align: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!710, !44, !54}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !744, size: 64, align: 64, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!45, !44, !690}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !749, size: 64, align: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!690, !44, !54}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !18, line: 23, baseType: !753, size: 64, align: 64, offset: 1088)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!756, !44}
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !8, line: 23, size: 128, align: 8, elements: !757)
!757 = !{!758, !85}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !18, size: 384, align: 8, elements: !761)
!761 = !{!181, !762, !783, !787, !791, !792}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !18, line: 23, baseType: !763, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !44, !590}
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !8, line: 23, size: 960, align: 8, elements: !767)
!767 = !{!768, !775, !776, !777, !778, !779, !780, !781, !782}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 23, baseType: !769, size: 192, align: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !8, line: 23, size: 192, align: 8, elements: !770)
!770 = !{!771, !773, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !8, line: 23, baseType: !120, size: 192, align: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !8, line: 23, baseType: !50, size: 128, align: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !8, line: 23, baseType: !50, size: 128, align: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !8, line: 23, baseType: !54, size: 64, align: 64, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !18, line: 23, baseType: !784, size: 64, align: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!766, !44, !769}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !788, size: 64, align: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!766, !44, !54}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !599, size: 64, align: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !799, size: 64, align: 64, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!45, !44, !534}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !18, line: 23, baseType: !804, size: 64, align: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !44}
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !8, line: 23, size: 192, align: 8, elements: !808)
!808 = !{!269, !809, !419, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 23, baseType: !44, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !8, line: 23, baseType: !135, size: 64, align: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !18, line: 23, baseType: !812, size: 64, align: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !44}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !816)
!816 = !{!817, !85}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !18, size: 768, align: 8, elements: !820)
!820 = !{!181, !479, !484, !485, !486, !821, !739, !826, !827, !742, !828, !747}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !18, line: 23, baseType: !822, size: 64, align: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !44}
!825 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !587, size: 64, align: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !599, size: 64, align: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !829, size: 64, align: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!45, !44, !815}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !18, line: 23, baseType: !833, size: 64, align: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!473, !44}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !18, line: 23, baseType: !480, size: 64, align: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 704)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !18, line: 23, baseType: !297, size: 64, align: 64, offset: 768)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 960)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 1024)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 1088)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 1152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 1216)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !18, line: 23, baseType: !850, size: 64, align: 64, offset: 1280)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !44}
!853 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !18, line: 23, baseType: !855, size: 64, align: 64, offset: 1344)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!515, !44}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !18, line: 23, baseType: !855, size: 64, align: 64, offset: 1408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !18, line: 23, baseType: !527, size: 64, align: 64, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !18, line: 23, baseType: !487, size: 64, align: 64, offset: 1536)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !18, line: 23, baseType: !862, size: 64, align: 64, offset: 1600)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!562, !44}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 1664)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !18, line: 23, baseType: !587, size: 64, align: 64, offset: 1728)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !18, line: 23, baseType: !599, size: 64, align: 64, offset: 1792)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !18, line: 23, baseType: !570, size: 64, align: 64, offset: 1856)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 1920)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !18, line: 23, baseType: !730, size: 64, align: 64, offset: 1984)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !18, line: 23, baseType: !167, size: 64, align: 64, offset: 2048)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !18, line: 23, baseType: !527, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 23, baseType: !874, size: 64, align: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!807, !44, !515}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !18, line: 23, baseType: !878, size: 64, align: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !44}
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !8, line: 23, size: 192, align: 8, elements: !882)
!882 = !{!883, !773, !774}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !47, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !18, line: 23, baseType: !885, size: 64, align: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!43, !44, !515}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !18, line: 23, baseType: !245, size: 64, align: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !18, line: 23, baseType: !874, size: 64, align: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !18, line: 23, baseType: !44, size: 64, align: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !18, line: 23, baseType: !874, size: 64, align: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !18, line: 23, baseType: !894, size: 64, align: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !44}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !18, size: 384, align: 8, elements: !899)
!899 = !{!900, !901, !902, !917, !935, !1038, !1050}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !18, line: 23, baseType: !268, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !18, line: 23, baseType: !135, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !18, line: 23, baseType: !903, size: 64, align: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!910, !913}
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !18, size: 64, align: 8, elements: !911)
!911 = !{!900, !912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !18, line: 23, baseType: !54, size: 64, align: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !18, size: 192, align: 8, elements: !914)
!914 = !{!900, !915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !18, line: 23, baseType: !505, size: 128, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !18, line: 23, baseType: !31, size: 8, align: 8, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !18, line: 23, baseType: !918, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !920)
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!925, !931}
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !18, size: 320, align: 8, elements: !926)
!926 = !{!927, !212}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !928, size: 192, align: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !18, size: 192, align: 8, elements: !929)
!929 = !{!900, !930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !18, line: 23, baseType: !202, size: 192, align: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !18, size: 384, align: 8, elements: !932)
!932 = !{!900, !915, !933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !18, line: 23, baseType: !202, size: 192, align: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !18, line: 23, baseType: !31, size: 8, align: 8, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !18, line: 23, baseType: !936, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 23, size: 64, align: 8, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 23, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !950}
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !18, size: 192, align: 8, elements: !944)
!944 = !{!945, !949}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !946, size: 8, align: 8)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !18, size: 8, align: 1, elements: !947)
!947 = !{!900, !948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !18, line: 23, baseType: !31, size: 8, align: 8)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !159, size: 128, align: 64, offset: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !18, size: 576, align: 8, elements: !951)
!951 = !{!900, !915, !933, !934, !952, !1037}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !18, line: 23, baseType: !953, size: 128, align: 64, offset: 384)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !18, size: 128, align: 8, elements: !954)
!954 = !{!955, !1036}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !18, line: 23, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !18, size: 192, align: 8, elements: !958)
!958 = !{!181, !959, !1032}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !18, line: 23, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !44, !483}
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !18, size: 256, align: 8, elements: !964)
!964 = !{!965, !158}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 23, baseType: !966, size: 128, align: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !8, line: 23, size: 128, align: 8, elements: !967)
!967 = !{!968, !85}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !18, size: 512, align: 8, elements: !971)
!971 = !{!181, !972, !976, !980, !984, !985, !1027, !1031}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !18, line: 23, baseType: !973, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!82, !44, !807}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !18, line: 23, baseType: !977, size: 64, align: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!43, !44, !82}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !18, line: 23, baseType: !981, size: 64, align: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!43, !44, !807}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !18, line: 23, baseType: !804, size: 64, align: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !18, line: 23, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!989, !44}
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !8, line: 23, size: 128, align: 8, elements: !990)
!990 = !{!991, !85}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 23, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !18, size: 2240, align: 8, elements: !994)
!994 = !{!181, !521, !526, !530, !803, !811, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !18, line: 23, baseType: !855, size: 64, align: 64, offset: 384)
