; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22chaincode\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./29.go", directory: "/home/ming/go/src/chaincode_repo/github/29")
!5 = !{!6, !23}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !25, line: 5, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "29.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !25, line: 5, size: 2624, align: 4, elements: !28)
!28 = !{!29, !33, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !25, line: 5, baseType: !30, size: 512, align: 8)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 1, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !25, line: 5, baseType: !34, size: 2048, align: 8, offset: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 1, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 256, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !25, line: 5, baseType: !38, size: 32, align: 32, offset: 2560)
!38 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !25, line: 5, baseType: !13, size: 8, align: 8, offset: 2592)
!40 = distinct !DISubprogram(name: "command_x2dline_x2darguments.AssetPrivateDetails..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !43, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !{}
!46 = !DILocalVariable(name: "key1", arg: 1, scope: !40, file: !8, line: 1, type: !43)
!47 = !DILocation(line: 0, scope: !40)
!48 = !DILocalVariable(name: "key2", arg: 2, scope: !40, file: !8, line: 1, type: !43)
!49 = !DILocalVariable(name: "$ret46", scope: !40, file: !8, line: 1, type: !13)
!50 = !DILocation(line: 1, column: 1, scope: !40)
!51 = distinct !DISubprogram(name: "command_x2dline_x2darguments.TransferAgreement..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!52 = !DILocalVariable(name: "key1", arg: 1, scope: !51, file: !8, line: 1, type: !43)
!53 = !DILocation(line: 0, scope: !51)
!54 = !DILocalVariable(name: "key2", arg: 2, scope: !51, file: !8, line: 1, type: !43)
!55 = !DILocalVariable(name: "$ret47", scope: !51, file: !8, line: 1, type: !13)
!56 = !DILocation(line: 1, column: 1, scope: !51)
!57 = distinct !DISubprogram(name: "command-line-arguments.SmartContract.CreatePrivateAsset", linkageName: "command_x2dline_x2darguments.SmartContract.CreatePrivateAsset", scope: null, file: !25, line: 35, type: !58, scopeLine: 35, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !118, !118, !1815}
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !61)
!61 = !{!62, !117}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !65)
!65 = !{!66, !113}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !69)
!69 = !{!70, !72, !73, !75, !76, !77, !78, !79, !85, !87, !94, !112}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !74, size: 32, align: 32, offset: 128)
!74 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !80, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !86, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !88, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !86, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !95, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !88, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !88, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !101, size: 192, align: 64, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !102)
!102 = !{!103, !110, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!98, !99, !107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !93, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!89, !43}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !25, line: 592, size: 1152, align: 8, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !25, line: 593, baseType: !122, size: 1152, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !25, line: 13, size: 1152, align: 8, elements: !123)
!123 = !{!124, !125, !141, !146, !147, !148}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 13, baseType: !89, size: 128, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !25, line: 13, baseType: !126, size: 512, align: 64, offset: 128)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !25, line: 13, size: 512, align: 8, elements: !127)
!127 = !{!128, !129, !130, !136, !140}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !25, line: 13, baseType: !89, size: 128, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !25, line: 13, baseType: !131, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !25, line: 13, size: 384, align: 8, elements: !133)
!133 = !{!124, !134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !25, line: 13, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !25, line: 13, size: 256, align: 8, elements: !139)
!139 = !{!124, !134}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !25, line: 13, baseType: !142, size: 128, align: 64, offset: 640)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !25, line: 11, size: 128, align: 8, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !67, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !25, line: 13, baseType: !142, size: 128, align: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !25, line: 13, baseType: !142, size: 128, align: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !25, line: 13, baseType: !149, size: 128, align: 64, offset: 1024)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !25, line: 13, size: 128, align: 8, elements: !150)
!150 = !{!151, !145}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !10, size: 192, align: 8, elements: !154)
!154 = !{!155, !156, !381}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 13, baseType: !67, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !10, line: 13, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!44, !43, !160}
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !25, line: 13, size: 128, align: 8, elements: !161)
!161 = !{!162, !145}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !10, size: 384, align: 8, elements: !165)
!165 = !{!155, !166, !170, !179, !187, !188}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !10, line: 13, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!60, !43, !89, !89}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !10, line: 13, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !43, !89}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !10, size: 320, align: 8, elements: !175)
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !10, line: 13, baseType: !89, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !10, line: 13, baseType: !13, size: 8, align: 8, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 13, baseType: !60, size: 128, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !10, line: 13, baseType: !180, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !43}
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !89, size: 128, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !60, size: 128, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !10, line: 13, baseType: !180, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !10, line: 13, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !43}
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !10, size: 192, align: 8, elements: !193)
!193 = !{!194, !380}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !25, line: 13, size: 10624, align: 8, elements: !197)
!197 = !{!198, !202, !203, !204, !205, !206, !207, !209, !211, !212, !213, !226, !255, !256, !291, !292, !294, !304, !305, !310, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !335, !359, !360, !361, !362, !373, !374, !375, !376, !377, !378, !379}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !25, line: 13, baseType: !199, size: 192, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !200)
!200 = !{!201, !110, !111}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !86, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !25, line: 13, baseType: !208, size: 64, align: 64, offset: 1152)
!208 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !25, line: 13, baseType: !210, size: 64, align: 64, offset: 1216)
!210 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !25, line: 13, baseType: !142, size: 128, align: 64, offset: 1280)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 13, baseType: !93, size: 64, align: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 13, baseType: !214, size: 64, align: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !25, line: 13, size: 256, align: 8, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !25, line: 13, baseType: !13, size: 8, align: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !25, line: 13, baseType: !219, size: 192, align: 64, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !25, line: 13, size: 192, align: 8, elements: !220)
!220 = !{!221, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !93, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !25, line: 13, baseType: !227, size: 1984, align: 64, offset: 1536)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 13, size: 1984, align: 8, elements: !228)
!228 = !{!229, !233, !234, !235, !236, !237, !238, !239, !240, !241, !254}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !25, line: 13, baseType: !230, size: 192, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !231)
!231 = !{!232, !110, !111}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !88, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !25, line: 13, baseType: !242, size: 192, align: 64, offset: 1600)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !10, size: 192, align: 8, elements: !243)
!243 = !{!244, !110, !111}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !25, line: 13, size: 320, align: 8, elements: !247)
!247 = !{!248, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 13, baseType: !249, size: 192, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !25, line: 13, size: 192, align: 8, elements: !250)
!250 = !{!251, !224, !225}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 13, baseType: !142, size: 128, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !25, line: 13, baseType: !242, size: 192, align: 64, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !25, line: 13, baseType: !227, size: 1984, align: 64, offset: 3520)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !25, line: 13, baseType: !257, size: 192, align: 64, offset: 5504)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !25, line: 8, size: 192, align: 8, elements: !258)
!258 = !{!259, !260, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !25, line: 8, baseType: !22, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !25, line: 8, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !25, line: 8, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !25, line: 8, size: 832, align: 8, elements: !265)
!265 = !{!266, !267, !276, !287, !288, !289, !290}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 8, baseType: !89, size: 128, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !25, line: 8, baseType: !268, size: 192, align: 64, offset: 128)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !10, size: 192, align: 8, elements: !269)
!269 = !{!270, !110, !111}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !25, line: 8, size: 256, align: 8, elements: !273)
!273 = !{!266, !274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !25, line: 8, baseType: !93, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !25, line: 8, baseType: !13, size: 8, align: 8, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !25, line: 8, baseType: !277, size: 192, align: 64, offset: 320)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !10, size: 192, align: 8, elements: !278)
!278 = !{!279, !110, !111}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !25, line: 8, size: 128, align: 8, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !25, line: 8, baseType: !261, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !25, line: 8, baseType: !16, size: 8, align: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !25, line: 8, baseType: !13, size: 8, align: 8, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !25, line: 8, baseType: !13, size: 8, align: 8, offset: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !25, line: 8, baseType: !89, size: 128, align: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !25, line: 8, baseType: !261, size: 64, align: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !25, line: 8, baseType: !261, size: 64, align: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !25, line: 8, baseType: !271, size: 64, align: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !25, line: 13, baseType: !257, size: 192, align: 64, offset: 5696)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !25, line: 13, baseType: !293, size: 64, align: 64, offset: 5888)
!293 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !25, line: 13, baseType: !295, size: 192, align: 64, offset: 5952)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !10, size: 192, align: 8, elements: !296)
!296 = !{!297, !110, !111}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !25, line: 13, size: 448, align: 8, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !25, line: 13, baseType: !249, size: 192, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !25, line: 13, baseType: !295, size: 192, align: 64, offset: 6144)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !25, line: 13, baseType: !306, size: 192, align: 64, offset: 6336)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !10, size: 192, align: 8, elements: !307)
!307 = !{!308, !110, !111}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !25, line: 13, baseType: !311, size: 192, align: 64, offset: 6528)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !10, size: 192, align: 8, elements: !312)
!312 = !{!313, !110, !111}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !25, line: 13, baseType: !306, size: 192, align: 64, offset: 6720)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 6912)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 6920)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !25, line: 13, baseType: !93, size: 64, align: 64, offset: 6976)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 7040)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 7104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 7296)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 7488)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 7872)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 8064)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !25, line: 13, baseType: !328, size: 192, align: 64, offset: 8256)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !10, size: 192, align: 8, elements: !329)
!329 = !{!330, !110, !111}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !25, line: 13, size: 192, align: 8, elements: !333)
!333 = !{!334, !224, !225}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !86, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !25, line: 13, baseType: !336, size: 192, align: 64, offset: 8448)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !10, size: 192, align: 8, elements: !337)
!337 = !{!338, !110, !111}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !25, line: 13, size: 1152, align: 8, elements: !342)
!342 = !{!343, !344, !345, !352, !353, !354, !355, !356, !357, !358}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !25, line: 13, baseType: !89, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !25, line: 13, baseType: !346, size: 64, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !25, line: 13, size: 320, align: 8, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !25, line: 13, baseType: !89, size: 128, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 896)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !25, line: 13, baseType: !89, size: 128, align: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 8640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 8704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 8896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !25, line: 13, baseType: !363, size: 192, align: 64, offset: 9088)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !10, size: 192, align: 8, elements: !364)
!364 = !{!365, !110, !111}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !25, line: 13, size: 384, align: 8, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !25, line: 13, baseType: !332, size: 192, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !25, line: 13, baseType: !372, size: 192, align: 64, offset: 192)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !25, line: 13, size: 192, align: 8, elements: !333)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !25, line: 13, baseType: !363, size: 192, align: 64, offset: 9280)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 9472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 9664)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 9856)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 10048)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !25, line: 13, baseType: !230, size: 192, align: 64, offset: 10240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !25, line: 13, baseType: !306, size: 192, align: 64, offset: 10432)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !60, size: 128, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !10, line: 13, baseType: !382, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!44, !43, !385}
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 13, size: 128, align: 8, elements: !386)
!386 = !{!387, !145}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !390)
!390 = !{!155, !391, !395, !396, !400, !408, !416, !417, !418, !419, !436, !443, !1676, !1680, !1706, !1710, !1711, !1715, !1716, !1720, !1735, !1750, !1754, !1758, !1762, !1763, !1767, !1768, !1772, !1779, !1780, !1787, !1796, !1797, !1801, !1805, !1806, !1807, !1808}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 13, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!183, !43, !89, !230}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 13, baseType: !167, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 13, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!60, !43, !89}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 13, baseType: !401, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !43}
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !405)
!405 = !{!406, !110, !111}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 13, baseType: !409, size: 64, align: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !43}
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !199, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !60, size: 128, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 13, baseType: !409, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 13, baseType: !114, size: 64, align: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 13, baseType: !409, size: 64, align: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 13, baseType: !420, size: 64, align: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !43}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !425)
!425 = !{!426, !427, !428, !429, !431, !432, !433, !434, !435}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !93, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !430, size: 16, align: 16, offset: 80)
!430 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !74, size: 32, align: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !71, size: 64, align: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 13, baseType: !437, size: 64, align: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !43}
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !441)
!441 = !{!185, !442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !230, size: 192, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 13, baseType: !444, size: 64, align: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !43, !89}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !448)
!448 = !{!449, !186}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !450, size: 128, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 13, size: 128, align: 8, elements: !451)
!451 = !{!452, !145}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !455)
!455 = !{!155, !456, !460, !464}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 13, baseType: !457, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!60, !43}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!13, !43}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 13, baseType: !465, size: 64, align: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !43}
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !469)
!469 = !{!470, !380}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 13, size: 704, align: 8, elements: !473)
!473 = !{!474, !475, !476, !1671, !1672, !1674, !1675}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 13, baseType: !89, size: 128, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 13, baseType: !199, size: 192, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 13, baseType: !477, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 13, size: 448, align: 8, elements: !479)
!479 = !{!480, !1667, !1668, !1669, !1670}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 13, baseType: !481, size: 64, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 13, size: 64, align: 8, elements: !482)
!482 = !{!483, !485, !496, !502}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 13, baseType: !484, align: 8)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 13, align: 1, elements: !45)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 13, baseType: !486, align: 64)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, align: 8, elements: !494)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 13, size: 64, align: 8, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 13, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!44}
!494 = !{!495}
!495 = !DISubrange(count: 0, lowerBound: 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 13, baseType: !497, align: 32)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, align: 4, elements: !494)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 8, size: 64, align: 4, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 8, baseType: !38, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 8, baseType: !74, size: 32, align: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 13, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 13, size: 2624, align: 8, elements: !505)
!505 = !{!506, !669, !1459, !1467, !1472, !1473, !1474, !1569}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 13, baseType: !507, size: 128, align: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 6, size: 128, align: 8, elements: !508)
!508 = !{!509, !145}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 6, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !512)
!512 = !{!513, !514, !518, !522, !523, !528, !529, !530, !534, !554, !555, !559, !567, !578, !579, !583, !584, !585, !590, !591, !640, !648, !649, !650, !651, !652, !653, !654, !655, !659, !660, !664, !665}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 6, baseType: !67, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!93, !43}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 6, baseType: !519, size: 64, align: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!13, !43, !507}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 6, baseType: !524, size: 64, align: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !43}
!527 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 6, baseType: !461, size: 64, align: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 6, baseType: !519, size: 64, align: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 6, baseType: !531, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!507, !43}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 6, baseType: !535, size: 64, align: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !43, !93}
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 6, size: 832, align: 8, elements: !539)
!539 = !{!540, !541, !542, !543, !548, !549, !553}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 6, baseType: !89, size: 128, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 6, baseType: !89, size: 128, align: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 6, baseType: !507, size: 128, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 6, baseType: !544, size: 128, align: 64, offset: 384)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 6, size: 128, align: 8, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !86, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 6, baseType: !71, size: 64, align: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 6, baseType: !550, size: 192, align: 64, offset: 576)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !551)
!551 = !{!552, !110, !111}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !252, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 6, baseType: !13, size: 8, align: 8, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 6, baseType: !556, size: 64, align: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!538, !43, !550}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 6, baseType: !560, size: 64, align: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !43, !89}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 6, baseType: !538, size: 832, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 6, baseType: !13, size: 8, align: 8, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 6, baseType: !568, size: 64, align: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!563, !43, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 6, size: 64, align: 8, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 6, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!13, !89}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 6, baseType: !519, size: 64, align: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 6, baseType: !580, size: 64, align: 64, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!507, !43, !93}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 6, baseType: !461, size: 64, align: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 6, baseType: !531, size: 64, align: 64, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 6, baseType: !586, size: 64, align: 64, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!589, !43}
!589 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 6, baseType: !592, size: 64, align: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !43, !93}
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !25, line: 6, size: 640, align: 8, elements: !596)
!596 = !{!540, !541, !542, !597, !639}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !25, line: 6, baseType: !598, size: 192, align: 64, offset: 384)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 6, size: 192, align: 8, elements: !599)
!599 = !{!600, !636, !637}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 6, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !25, line: 6, size: 512, align: 8, elements: !603)
!603 = !{!604, !605, !606, !607, !609, !610, !611, !612, !617, !618, !619, !635}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 6, baseType: !71, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 6, baseType: !71, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 6, baseType: !74, size: 32, align: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !25, line: 6, baseType: !608, size: 8, align: 8, offset: 160)
!608 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 6, baseType: !16, size: 8, align: 8, offset: 168)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 6, baseType: !16, size: 8, align: 8, offset: 176)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 6, baseType: !16, size: 8, align: 8, offset: 184)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !25, line: 6, baseType: !613, size: 64, align: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 6, size: 64, align: 8, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 6, baseType: !84, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 6, baseType: !86, size: 64, align: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 6, baseType: !88, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 6, baseType: !620, size: 64, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !25, line: 6, size: 320, align: 8, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 6, baseType: !88, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 6, baseType: !88, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 6, baseType: !626, size: 192, align: 64, offset: 128)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !627)
!627 = !{!628, !110, !111}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !25, line: 6, size: 320, align: 8, elements: !631)
!631 = !{!623, !624, !632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 6, baseType: !43, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 6, baseType: !43, size: 64, align: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 6, baseType: !43, size: 64, align: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 6, baseType: !43, size: 64, align: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 6, baseType: !43, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !25, line: 6, baseType: !638, size: 64, align: 64, offset: 128)
!638 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 6, baseType: !93, size: 64, align: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 6, baseType: !641, size: 64, align: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!644, !43, !89}
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 6, baseType: !595, size: 640, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 6, baseType: !13, size: 8, align: 8, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 6, baseType: !114, size: 64, align: 64, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 1408)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 1472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 1536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 6, baseType: !515, size: 64, align: 64, offset: 1600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 6, baseType: !580, size: 64, align: 64, offset: 1664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 6, baseType: !114, size: 64, align: 64, offset: 1728)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 6, baseType: !656, size: 64, align: 64, offset: 1792)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!71, !43}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 6, baseType: !114, size: 64, align: 64, offset: 1856)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 6, baseType: !661, size: 64, align: 64, offset: 1920)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!601, !43}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 6, baseType: !114, size: 64, align: 64, offset: 1984)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 6, baseType: !666, size: 64, align: 64, offset: 2048)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!620, !43}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !25, line: 13, baseType: !670, size: 128, align: 64, offset: 128)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !671)
!671 = !{!672, !145}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !675)
!675 = !{!155, !676, !1385, !1389, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1434, !1435, !1436, !1437, !1438, !1442, !1456, !1457, !1458}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 13, baseType: !677, size: 64, align: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !43}
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !681)
!681 = !{!682, !145}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !685)
!685 = !{!155, !686, !1381, !838, !839}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !687, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !43, !707}
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !691)
!691 = !{!692, !145}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !695)
!695 = !{!155, !696, !701, !702, !703, !708, !1315, !815, !1009, !1316, !1320, !1338, !1017, !1359}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 13, baseType: !697, size: 64, align: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !43}
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !25, line: 13, size: 128, align: 8, elements: !545)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 13, baseType: !704, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !43}
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 13, size: 128, align: 8, elements: !545)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !709, size: 64, align: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !43}
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !25, line: 13, size: 128, align: 8, elements: !713)
!713 = !{!714, !145}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !717)
!717 = !{!155, !718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 13, baseType: !719, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !43}
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !25, line: 13, size: 128, align: 8, elements: !723)
!723 = !{!724, !145}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !727)
!727 = !{!155, !728, !1088, !1089, !1093, !1098, !1102, !1103, !1104, !1105, !1106, !1107, !1279, !1290, !1294, !1298, !1311}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 13, baseType: !729, size: 64, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!44, !43, !732}
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !733)
!733 = !{!734, !145}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !737)
!737 = !{!155, !738, !743, !747, !1018, !1027, !1048, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1070, !1074, !1075, !1076, !1077, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 13, baseType: !739, size: 64, align: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !43}
!742 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 13, baseType: !744, size: 64, align: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!670, !43}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 13, baseType: !748, size: 64, align: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !43}
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !752)
!752 = !{!753, !145}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !756)
!756 = !{!155, !757, !797, !798, !799, !800, !801, !802, !803, !1011, !1012, !1013, !1017}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 13, baseType: !758, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !43}
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !762)
!762 = !{!763, !145}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !766)
!766 = !{!155, !767, !771, !775, !780, !781, !785, !786}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 13, baseType: !768, size: 64, align: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!732, !43, !89}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !772, size: 64, align: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!732, !43, !707}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 13, baseType: !776, size: 64, align: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!732, !43, !779}
!779 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 13, baseType: !768, size: 64, align: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !782, size: 64, align: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!732, !43, !93}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!44, !43, !790}
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !25, line: 13, size: 128, align: 8, elements: !791)
!791 = !{!792, !145}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !795)
!795 = !{!155, !796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 13, baseType: !697, size: 64, align: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 13, baseType: !704, size: 64, align: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 13, baseType: !804, size: 64, align: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !43}
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !25, line: 13, size: 128, align: 8, elements: !808)
!808 = !{!809, !145}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !812)
!812 = !{!155, !696, !701, !702, !703, !813, !814, !815, !1009, !1010}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 13, baseType: !816, size: 64, align: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !43}
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !820)
!820 = !{!821, !145}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !824)
!824 = !{!155, !825, !826, !840, !841, !862, !863, !864, !882, !883, !884, !885, !886, !887, !888, !889, !893, !969, !1008}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 13, baseType: !827, size: 64, align: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!830, !43}
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !831)
!831 = !{!832, !145}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !835)
!835 = !{!155, !836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !772, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !782, size: 64, align: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 13, baseType: !697, size: 64, align: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 13, baseType: !842, size: 64, align: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !43}
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !25, line: 13, size: 128, align: 8, elements: !846)
!846 = !{!847, !145}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !850)
!850 = !{!155, !851, !860, !861}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !852, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !43, !93}
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !25, line: 13, size: 192, align: 8, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !25, line: 13, baseType: !819, size: 128, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !25, line: 13, baseType: !13, size: 8, align: 8, offset: 136)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 13, baseType: !515, size: 64, align: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 13, baseType: !865, size: 64, align: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!868, !43}
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !869)
!869 = !{!870, !145}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !873)
!873 = !{!155, !874, !878, !838, !839}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !875, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!670, !43, !707}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !879, size: 64, align: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!670, !43, !93}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 13, baseType: !704, size: 64, align: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 13, baseType: !697, size: 64, align: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 13, baseType: !114, size: 64, align: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 13, baseType: !890, size: 64, align: 64, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!44, !43, !819}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 13, baseType: !894, size: 64, align: 64, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !43}
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !898)
!898 = !{!899, !145}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !902)
!902 = !{!155, !903, !965, !838, !839}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !904, size: 64, align: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !43, !707}
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !908)
!908 = !{!909, !145}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !912)
!912 = !{!155, !696, !701, !702, !913, !955, !956, !957, !958, !959, !960, !964}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 13, baseType: !914, size: 64, align: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!917, !43}
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !25, line: 13, size: 128, align: 8, elements: !918)
!918 = !{!919, !145}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !922)
!922 = !{!155, !923, !951, !838, !839}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 13, baseType: !924, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!927, !43, !707}
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !25, line: 13, size: 128, align: 8, elements: !928)
!928 = !{!929, !145}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !932)
!932 = !{!155, !696, !701, !933, !799, !934, !935, !936, !937, !938, !939, !940, !941, !942, !946}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 13, baseType: !744, size: 64, align: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 13, baseType: !461, size: 64, align: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 13, baseType: !704, size: 64, align: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 13, baseType: !744, size: 64, align: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 13, baseType: !943, size: 64, align: 64, offset: 832)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!44, !43, !927}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 13, baseType: !947, size: 64, align: 64, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!950, !43}
!950 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !952, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!927, !43, !93}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 13, baseType: !704, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 13, baseType: !43, size: 64, align: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 13, baseType: !787, size: 64, align: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 13, baseType: !961, size: 64, align: 64, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!44, !43, !907}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 13, baseType: !947, size: 64, align: 64, offset: 704)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 13, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!907, !43, !93}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 13, baseType: !970, size: 64, align: 64, offset: 1088)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !43}
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !25, line: 13, size: 128, align: 8, elements: !974)
!974 = !{!975, !145}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 13, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
