; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22test\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22peer\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.x2ecom/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22indirectimport \22"
module asm "\09.ascii \22proto\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "./testCode.go", directory: "/gocodes/errConcurrency")
!5 = !{}
!6 = !{!7}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !9, line: 1, type: !10, isLocal: false, isDefinition: true)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !11, size: 128, align: 8, elements: !12)
!11 = !DIFile(filename: "", directory: "")
!12 = !{!13, !15, !20, !21, !22}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !11, line: 1, baseType: !14, size: 8, align: 8)
!14 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !11, line: 1, baseType: !16, size: 24, align: 8, offset: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 1, elements: !18)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !{!19}
!19 = !DISubrange(count: 3)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!24 = distinct !DISubprogram(name: "test.Init..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Init", scope: null, file: !25, line: 17, type: !26, scopeLine: 17, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!25 = !DIFile(filename: "testCode.go", directory: ".")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !49, !49, !51}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !25, line: 10, size: 640, align: 8, elements: !29)
!29 = !{!30, !32, !39, !45, !47, !48}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !25, line: 10, baseType: !31, size: 32, align: 32)
!31 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !25, line: 10, baseType: !33, size: 128, align: 64, offset: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !34)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 192)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !36, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !38, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 10, baseType: !46, align: 8, offset: 384)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !5)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 10, baseType: !31, size: 32, align: 32, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "BadChaincode", file: !25, line: 14, align: 8, elements: !5)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 10, size: 128, align: 8, elements: !52)
!52 = !{!53, !222}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 10, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !11, size: 2432, align: 8, elements: !56)
!56 = !{!57, !100, !123, !127, !131, !139, !147, !148, !149, !150, !167, !174, !223, !227, !254, !258, !259, !263, !264, !268, !284, !296, !300, !304, !308, !309, !313, !314, !318, !325, !326, !333, !337, !341, !345, !346, !347, !348}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 10, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 512, align: 8, elements: !60)
!60 = !{!61, !63, !64, !66, !67, !68, !69, !70, !80, !81, !83, !99}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !65, size: 32, align: 32, offset: 128)
!65 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 184)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !9, line: 1, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!14, !78, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "void")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !36, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !84, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !86)
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !82, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !82, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !90, size: 192, align: 64, offset: 128)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !91)
!91 = !{!92, !43, !44}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !95)
!95 = !{!87, !88, !96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !11, line: 10, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !78, !33, !120}
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !11, size: 256, align: 8, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !33, size: 128, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !108, size: 128, align: 64, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !109)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !11, size: 128, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !58, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !11, line: 1, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!33, !78}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !11, size: 192, align: 8, elements: !121)
!121 = !{!122, !43, !44}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !82, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !11, line: 10, baseType: !124, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!108, !78, !33, !33}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !11, line: 10, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!108, !78, !33}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !11, line: 10, baseType: !132, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !78}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !11, size: 192, align: 8, elements: !136)
!136 = !{!137, !43, !44}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !11, line: 10, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !78}
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !11, size: 320, align: 8, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 11, baseType: !40, size: 192, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 11, baseType: !108, size: 128, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !11, line: 10, baseType: !140, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !11, line: 10, baseType: !116, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !11, line: 10, baseType: !140, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !11, line: 10, baseType: !151, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !78}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !156)
!156 = !{!157, !158, !159, !160, !162, !163, !164, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !38, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !161, size: 16, align: 16, offset: 80)
!161 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !65, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !62, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !78, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !11, line: 10, baseType: !168, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !78}
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !11, size: 320, align: 8, elements: !172)
!172 = !{!106, !173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !120, size: 192, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !11, line: 10, baseType: !175, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !78, !33}
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !11, size: 256, align: 8, elements: !179)
!179 = !{!180, !107}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !181, size: 128, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 10, size: 128, align: 8, elements: !182)
!182 = !{!183, !222}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 10, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !11, size: 256, align: 8, elements: !186)
!186 = !{!57, !187, !191, !195}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 10, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!108, !78}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !11, line: 10, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!14, !78}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !11, line: 10, baseType: !196, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !78}
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !11, size: 192, align: 8, elements: !200)
!200 = !{!201, !221}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 10, size: 704, align: 8, elements: !204)
!204 = !{!205, !206, !207, !217, !218, !219, !220}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 10, baseType: !33, size: 128, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 10, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 10, size: 384, align: 8, elements: !210)
!210 = !{!211, !213, !214, !215, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", file: !25, line: 10, baseType: !212, size: 64, align: 64)
!212 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Nanos", file: !25, line: 10, baseType: !31, size: 32, align: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 10, baseType: !46, align: 8, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 10, baseType: !31, size: 32, align: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "IsDelete", file: !25, line: 10, baseType: !14, size: 8, align: 8, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 10, baseType: !46, align: 8, offset: 392)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 10, baseType: !31, size: 32, align: 32, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !108, size: 128, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateData", file: !11, line: 10, baseType: !224, size: 64, align: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!143, !78, !33, !33}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByPartialCompositeKey", file: !11, line: 10, baseType: !228, size: 64, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !78, !33, !33, !120}
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,error}", file: !11, size: 256, align: 8, elements: !232)
!232 = !{!233, !107}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !234, size: 128, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "StateQueryIteratorInterface", file: !25, line: 10, size: 128, align: 8, elements: !235)
!235 = !{!236, !222}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 10, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KV,error}}", file: !11, size: 256, align: 8, elements: !239)
!239 = !{!57, !187, !191, !240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !11, line: 10, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !78}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KV,error}", file: !11, size: 192, align: 8, elements: !245)
!245 = !{!246, !221}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "KV", file: !25, line: 10, size: 704, align: 8, elements: !249)
!249 = !{!250, !251, !252, !253, !219, !220}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", file: !25, line: 10, baseType: !33, size: 128, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !25, line: 10, baseType: !33, size: 128, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 10, baseType: !46, align: 8, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataByRange", file: !11, line: 10, baseType: !255, size: 64, align: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!231, !78, !33, !33, !33}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataHash", file: !11, line: 10, baseType: !224, size: 64, align: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataQueryResult", file: !11, line: 10, baseType: !260, size: 64, align: 64, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!231, !78, !33, !33}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrivateDataValidationParameter", file: !11, line: 10, baseType: !224, size: 64, align: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResult", file: !11, line: 10, baseType: !265, size: 64, align: 64, offset: 1152)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!231, !78, !33}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GetQueryResultWithPagination", file: !11, line: 10, baseType: !269, size: 64, align: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !78, !33, !31, !33}
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StateQueryIteratorInterface,*QueryResponseMetadata,error}", file: !11, size: 320, align: 8, elements: !273)
!273 = !{!233, !274, !283}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !275, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueryResponseMetadata", file: !25, line: 10, size: 448, align: 8, elements: !277)
!277 = !{!278, !279, !280, !281, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "FetchedRecordsCount", file: !25, line: 10, baseType: !31, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Bookmark", file: !25, line: 10, baseType: !33, size: 128, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 10, baseType: !46, align: 8, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 10, baseType: !31, size: 32, align: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !108, size: 128, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "GetSignedProposal", file: !11, line: 10, baseType: !285, size: 64, align: 64, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !78}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignedProposal,error}", file: !11, size: 192, align: 8, elements: !289)
!289 = !{!290, !221}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignedProposal", file: !25, line: 10, size: 640, align: 8, elements: !293)
!293 = !{!294, !295, !45, !47, !48}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ProposalBytes", file: !25, line: 10, baseType: !40, size: 192, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !25, line: 10, baseType: !40, size: 192, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "GetState", file: !11, line: 10, baseType: !297, size: 64, align: 64, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!143, !78, !33}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKey", file: !11, line: 10, baseType: !301, size: 64, align: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!231, !78, !33, !120}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByPartialCompositeKeyWithPagination", file: !11, line: 10, baseType: !305, size: 64, align: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!272, !78, !33, !120, !31, !33}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRange", file: !11, line: 10, baseType: !260, size: 64, align: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateByRangeWithPagination", file: !11, line: 10, baseType: !310, size: 64, align: 64, offset: 1600)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!272, !78, !33, !33, !31, !33}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "GetStateValidationParameter", file: !11, line: 10, baseType: !297, size: 64, align: 64, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringArgs", file: !11, line: 10, baseType: !315, size: 64, align: 64, offset: 1728)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!120, !78}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "GetTransient", file: !11, line: 10, baseType: !319, size: 64, align: 64, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !78}
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Values,error}", file: !11, size: 192, align: 8, elements: !323)
!323 = !{!324, !221}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !154, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxID", file: !11, line: 10, baseType: !116, size: 64, align: 64, offset: 1856)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "GetTxTimestamp", file: !11, line: 10, baseType: !327, size: 64, align: 64, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !78}
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Timestamp,error}", file: !11, size: 192, align: 8, elements: !331)
!331 = !{!332, !221}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !208, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "InvokeChaincode", file: !11, line: 10, baseType: !334, size: 64, align: 64, offset: 1984)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!28, !78, !33, !135, !33}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PutPrivateData", file: !11, line: 10, baseType: !338, size: 64, align: 64, offset: 2048)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!108, !78, !33, !33, !40}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "PutState", file: !11, line: 10, baseType: !342, size: 64, align: 64, offset: 2112)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!108, !78, !33, !40}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "SetEvent", file: !11, line: 10, baseType: !342, size: 64, align: 64, offset: 2176)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "SetPrivateDataValidationParameter", file: !11, line: 10, baseType: !338, size: 64, align: 64, offset: 2240)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SetStateValidationParameter", file: !11, line: 10, baseType: !342, size: 64, align: 64, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SplitCompositeKey", file: !11, line: 10, baseType: !349, size: 64, align: 64, offset: 2368)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !78, !33}
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int},error}", file: !11, size: 448, align: 8, elements: !353)
!353 = !{!106, !173, !354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 10, baseType: !108, size: 128, align: 64, offset: 320)
!355 = !DILocalVariable(name: "t", arg: 1, scope: !24, file: !25, line: 17, type: !49)
!356 = !DILocation(line: 0, scope: !24)
!357 = !DILocalVariable(name: "stub", arg: 2, scope: !24, file: !25, line: 17, type: !51)
!358 = !DILocation(line: 18, column: 28, scope: !24)
!359 = !DILocation(line: 18, column: 14, scope: !24)
!360 = !DILocation(line: 18, column: 2, scope: !24)
!361 = distinct !DISubprogram(name: "test.Invoke..1command-line-arguments.BadChaincode", linkageName: "command..z2dline..z2darguments.BadChaincode.Invoke", scope: null, file: !25, line: 21, type: !26, scopeLine: 21, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!362 = !DILocalVariable(name: "t", arg: 1, scope: !361, file: !25, line: 21, type: !49)
!363 = !DILocation(line: 0, scope: !361)
!364 = !DILocalVariable(name: "stub", arg: 2, scope: !361, file: !25, line: 21, type: !51)
!365 = !DILocalVariable(name: "key", scope: !366, file: !25, line: 22, type: !33)
!366 = distinct !DILexicalBlock(scope: !361, file: !25, line: 21, column: 1)
!367 = !DILocalVariable(name: "data", scope: !366, file: !25, line: 23, type: !33)
!368 = !DILocation(line: 24, column: 30, scope: !366)
!369 = !DILocation(line: 24, column: 2, scope: !366)
!370 = !DILocation(line: 25, column: 31, scope: !366)
!371 = !DILocation(line: 25, column: 2, scope: !366)
!372 = !DILocation(line: 26, column: 28, scope: !366)
!373 = !DILocation(line: 26, column: 14, scope: !366)
!374 = !DILocation(line: 26, column: 2, scope: !366)
!375 = distinct !DISubprogram(name: "test.command-line-arguments..thunk0", scope: null, file: !25, line: 24, type: !376, scopeLine: 24, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!376 = !DISubroutineType(types: !377)
!377 = !{!79, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ChaincodeStubInterface,string,struct{*uint8,int,int}}", file: !11, size: 448, align: 8, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "object", file: !11, line: 24, baseType: !51, size: 128, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !11, line: 24, baseType: !33, size: 128, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "a1", file: !11, line: 24, baseType: !40, size: 192, align: 64, offset: 256)
!384 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !375, file: !25, line: 24, type: !378)
!385 = !DILocation(line: 0, scope: !375)
!386 = !DILocation(line: 24, column: 2, scope: !375)
!387 = distinct !DISubprogram(name: "test.command-line-arguments..thunk1", scope: null, file: !25, line: 25, type: !376, scopeLine: 25, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!388 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !387, file: !25, line: 25, type: !378)
!389 = !DILocation(line: 0, scope: !387)
!390 = !DILocation(line: 25, column: 2, scope: !387)
