; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cid\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/pkg/cid\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./25.go", directory: "/home/ming/go/src/chaincode_repo/github/25")
!5 = !{!6, !267, !279, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !584, !586, !588, !590, !592, !594, !596, !598, !600, !602, !604, !606, !608, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !774, !776}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "main.logger", linkageName: "main.logger", scope: !3, file: !8, line: 38, type: !9, isLocal: true, isDefinition: true)
!8 = !DIFile(filename: "25.go", directory: ".")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "FabricLogger", file: !8, line: 11, size: 64, align: 8, elements: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "s", file: !8, line: 11, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "SugaredLogger", file: !8, line: 11, size: 64, align: 8, elements: !15)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "base", file: !8, line: 11, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !8, line: 11, size: 768, align: 8, elements: !19)
!19 = !{!20, !212, !213, !214, !215, !216, !217, !225, !226}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "core", file: !8, line: 11, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Core", file: !8, line: 11, size: 128, align: 8, elements: !22)
!22 = !{!23, !175}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Entry,*CheckedEntry)*CheckedEntry,*func(*void,Level)bool,*func(*void)error,*func(*void,struct{*Field,int,int})Core,*func(*void,Entry,struct{*Field,int,int})error}", file: !26, size: 384, align: 8, elements: !27)
!26 = !DIFile(filename: "", directory: "")
!27 = !{!28, !82, !184, !188, !189, !208}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !26, line: 11, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !31, line: 1, size: 512, align: 8, elements: !32)
!31 = !DIFile(filename: "<built-in>", directory: "")
!32 = !{!33, !35, !36, !38, !40, !41, !42, !43, !54, !56, !63, !81}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !31, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !31, line: 1, baseType: !34, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !31, line: 1, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !31, line: 1, baseType: !39, size: 8, align: 8, offset: 160)
!39 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !31, line: 1, baseType: !39, size: 8, align: 8, offset: 168)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !31, line: 1, baseType: !39, size: 8, align: 8, offset: 176)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !31, line: 1, baseType: !39, size: 8, align: 8, offset: 184)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !31, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !52, !52}
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "void")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !31, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !31, line: 1, baseType: !57, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !31, line: 1, size: 128, align: 8, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !31, line: 1, baseType: !55, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !31, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !31, line: 1, baseType: !64, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !31, line: 1, size: 320, align: 8, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !31, line: 1, baseType: !57, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !31, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !31, line: 1, baseType: !70, size: 192, align: 64, offset: 128)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !26, size: 192, align: 8, elements: !71)
!71 = !{!72, !79, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !31, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!67, !68, !76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !31, line: 1, baseType: !52, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !31, line: 1, baseType: !52, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !31, line: 1, baseType: !52, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !26, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !26, line: 1, baseType: !62, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !31, line: 1, baseType: !52, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Check", file: !26, line: 11, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !52, !90, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "CheckedEntry", file: !8, line: 11, size: 1472, align: 8, elements: !88)
!88 = !{!89, !141, !176, !177, !179}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", file: !8, line: 11, baseType: !90, size: 1088, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !8, line: 11, size: 1088, align: 8, elements: !91)
!91 = !{!92, !94, !130, !131, !132, !140}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Level", file: !8, line: 11, baseType: !93, size: 8, align: 8)
!93 = !DIBasicType(name: "Level", size: 8, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !8, line: 11, baseType: !95, size: 192, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !8, line: 8, size: 192, align: 8, elements: !96)
!96 = !{!97, !99, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !8, line: 8, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !8, line: 8, baseType: !102, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !8, line: 8, size: 832, align: 8, elements: !104)
!104 = !{!105, !106, !115, !126, !127, !128, !129}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 8, baseType: !58, size: 128, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !8, line: 8, baseType: !107, size: 192, align: 64, offset: 128)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !26, size: 192, align: 8, elements: !108)
!108 = !{!109, !79, !80}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !8, line: 8, size: 256, align: 8, elements: !112)
!112 = !{!105, !113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !8, line: 8, baseType: !62, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !8, line: 8, baseType: !51, size: 8, align: 8, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !8, line: 8, baseType: !116, size: 192, align: 64, offset: 320)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !26, size: 192, align: 8, elements: !117)
!117 = !{!118, !79, !80}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !8, line: 8, size: 128, align: 8, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !8, line: 8, baseType: !100, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !8, line: 8, baseType: !39, size: 8, align: 8, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !8, line: 8, baseType: !51, size: 8, align: 8, offset: 72)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !8, line: 8, baseType: !51, size: 8, align: 8, offset: 80)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !8, line: 8, baseType: !58, size: 128, align: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !8, line: 8, baseType: !110, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "LoggerName", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Caller", file: !8, line: 11, baseType: !133, size: 448, align: 64, offset: 512)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryCaller", file: !8, line: 11, size: 448, align: 8, elements: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Defined", file: !8, line: 11, baseType: !51, size: 8, align: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "PC", file: !8, line: 11, baseType: !34, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Line", file: !8, line: 11, baseType: !62, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Function", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Stack", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorOutput", file: !8, line: 11, baseType: !142, size: 128, align: 64, offset: 1088)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteSyncer", file: !8, line: 11, size: 128, align: 8, elements: !143)
!143 = !{!144, !175}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !26, size: 192, align: 8, elements: !147)
!147 = !{!28, !148, !164}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Sync", file: !26, line: 11, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !52}
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !31, line: 1, size: 128, align: 8, elements: !153)
!153 = !{!154, !163}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !31, line: 1, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !26, size: 128, align: 8, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !26, line: 1, baseType: !29, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !26, line: 1, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!58, !52}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !31, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !26, line: 11, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !52, !172}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !26, size: 192, align: 8, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !26, line: 4, baseType: !62, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !26, line: 4, baseType: !152, size: 128, align: 64, offset: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !26, size: 192, align: 8, elements: !173)
!173 = !{!174, !79, !80}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !55, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", file: !8, line: 11, baseType: !51, size: 8, align: 8, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "should", file: !8, line: 11, baseType: !178, size: 8, align: 8, offset: 1224)
!178 = !DIBasicType(name: "CheckWriteAction", size: 8, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cores", file: !8, line: 11, baseType: !180, size: 192, align: 64, offset: 1280)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Core,int,int}", file: !26, size: 192, align: 8, elements: !181)
!181 = !{!182, !79, !80}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !26, line: 11, baseType: !185, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!51, !52, !93}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Sync", file: !26, line: 11, baseType: !149, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "With", file: !26, line: 11, baseType: !190, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!21, !52, !193}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Field,int,int}", file: !26, size: 192, align: 8, elements: !194)
!194 = !{!195, !79, !80}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !26, line: 1, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Field", file: !8, line: 11, size: 512, align: 8, elements: !198)
!198 = !{!199, !200, !202, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !8, line: 11, baseType: !58, size: 128, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 11, baseType: !201, size: 8, align: 8, offset: 128)
!201 = !DIBasicType(name: "FieldType", size: 8, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Integer", file: !8, line: 11, baseType: !100, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !8, line: 11, baseType: !205, size: 128, align: 64, offset: 384)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 8, size: 128, align: 8, elements: !206)
!206 = !{!207, !175}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !29, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !26, line: 11, baseType: !209, size: 64, align: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!152, !52, !90, !193}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "development", file: !8, line: 11, baseType: !51, size: 8, align: 8, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "addCaller", file: !8, line: 11, baseType: !51, size: 8, align: 8, offset: 136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "onFatal", file: !8, line: 11, baseType: !178, size: 8, align: 8, offset: 144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 11, baseType: !58, size: 128, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "errorOutput", file: !8, line: 11, baseType: !142, size: 128, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "addStack", file: !8, line: 11, baseType: !218, size: 128, align: 64, offset: 448)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "LevelEnabler", file: !8, line: 11, size: 128, align: 8, elements: !219)
!219 = !{!220, !175}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Level)bool}", file: !26, size: 128, align: 8, elements: !223)
!223 = !{!28, !224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !26, line: 11, baseType: !185, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "callerSkip", file: !8, line: 11, baseType: !62, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "clock", file: !8, line: 11, baseType: !227, size: 128, align: 64, offset: 640)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Clock", file: !8, line: 11, size: 128, align: 8, elements: !228)
!228 = !{!229, !175}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Duration)*Ticker,*func(*void)Time}", file: !26, size: 192, align: 8, elements: !232)
!232 = !{!28, !233, !263}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "NewTicker", file: !26, line: 11, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !52, !262}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ticker", file: !8, line: 8, size: 640, align: 8, elements: !239)
!239 = !{!240, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "C", file: !8, line: 8, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !31, line: 1, align: 1, elements: !243)
!243 = !{}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !8, line: 8, baseType: !245, size: 576, align: 64, offset: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.runtimeTimer", file: !8, line: 8, size: 576, align: 8, elements: !246)
!246 = !{!247, !248, !249, !250, !258, !259, !260, !261}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !8, line: 8, baseType: !34, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !8, line: 8, baseType: !251, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 8, size: 64, align: 8, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 8, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!53, !205, !34}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !8, line: 8, baseType: !205, size: 128, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !8, line: 8, baseType: !34, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !8, line: 8, baseType: !100, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !8, line: 8, baseType: !37, size: 32, align: 32, offset: 512)
!262 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Now", file: !26, line: 11, baseType: !264, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!95, !52}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !31, line: 1, type: !269, isLocal: false, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !26, size: 128, align: 8, elements: !270)
!270 = !{!271, !272, !276, !277, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !26, line: 1, baseType: !51, size: 8, align: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !26, line: 1, baseType: !273, size: 24, align: 8, offset: 8)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, align: 1, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 3, lowerBound: 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !26, line: 1, baseType: !51, size: 8, align: 8, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !26, line: 1, baseType: !51, size: 8, align: 8, offset: 40)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !26, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "bufio..types", linkageName: "bufio..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !26, size: 128, align: 8, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !26, line: 1, baseType: !62, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !26, line: 1, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1, lowerBound: 0)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "bytes..types", linkageName: "bytes..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "compress_1flate..types", linkageName: "compress_1flate..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "compress_1gzip..types", linkageName: "compress_1gzip..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "context..types", linkageName: "context..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "crypto..types", linkageName: "crypto..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "crypto_1cipher..types", linkageName: "crypto_1cipher..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "crypto_1dsa..types", linkageName: "crypto_1dsa..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "crypto_1ecdsa..types", linkageName: "crypto_1ecdsa..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519..types", linkageName: "crypto_1ed25519_1internal_1edwards25519..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519_1field..types", linkageName: "crypto_1ed25519_1internal_1edwards25519_1field..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "crypto_1elliptic..types", linkageName: "crypto_1elliptic..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1fiat..types", linkageName: "crypto_1elliptic_1internal_1fiat..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1nistec..types", linkageName: "crypto_1elliptic_1internal_1nistec..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "crypto_1internal_1randutil..types", linkageName: "crypto_1internal_1randutil..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "crypto_1md5..types", linkageName: "crypto_1md5..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "crypto_1rand..types", linkageName: "crypto_1rand..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "crypto_1rsa..types", linkageName: "crypto_1rsa..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "crypto_1sha1..types", linkageName: "crypto_1sha1..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "crypto_1sha256..types", linkageName: "crypto_1sha256..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "crypto_1sha512..types", linkageName: "crypto_1sha512..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "crypto_1tls..types", linkageName: "crypto_1tls..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "crypto_1x509..types", linkageName: "crypto_1x509..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "crypto_1x509_1pkix..types", linkageName: "crypto_1x509_1pkix..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "encoding_1asn1..types", linkageName: "encoding_1asn1..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "encoding_1base64..types", linkageName: "encoding_1base64..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "encoding_1binary..types", linkageName: "encoding_1binary..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "encoding_1hex..types", linkageName: "encoding_1hex..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "encoding_1json..types", linkageName: "encoding_1json..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "encoding_1pem..types", linkageName: "encoding_1pem..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "errors..types", linkageName: "errors..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "flag..types", linkageName: "flag..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "fmt..types", linkageName: "fmt..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1jsonpb..types", linkageName: "github_0com_1golang_1protobuf_1jsonpb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1proto..types", linkageName: "github_0com_1golang_1protobuf_1proto..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1any..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1any..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1duration..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1duration..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1empty..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1empty..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_1common_1flogging..types", linkageName: "github_0com_1hyperledger_1fabric_1common_1flogging..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_1common_1flogging_1fabenc..types", linkageName: "github_0com_1hyperledger_1fabric_1common_1flogging_1fabenc..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1pkg_1attrmgr..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1pkg_1attrmgr..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1pkg_1cid..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1pkg_1cid..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "github_0com_1sykesm_1zap_x2dlogfmt..types", linkageName: "github_0com_1sykesm_1zap_x2dlogfmt..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "go_0uber_0org_1atomic..types", linkageName: "go_0uber_0org_1atomic..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "go_0uber_0org_1multierr..types", linkageName: "go_0uber_0org_1multierr..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap..types", linkageName: "go_0uber_0org_1zap..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1internal_1bufferpool..types", linkageName: "go_0uber_0org_1zap_1internal_1bufferpool..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1internal_1exit..types", linkageName: "go_0uber_0org_1zap_1internal_1exit..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1zapcore..types", linkageName: "go_0uber_0org_1zap_1zapcore..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1zapgrpc..types", linkageName: "go_0uber_0org_1zap_1zapgrpc..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "go_1token..types", linkageName: "go_1token..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20..types", linkageName: "golang_0org_1x_1crypto_1chacha20..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20poly1305..types", linkageName: "golang_0org_1x_1crypto_1chacha20poly1305..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519..types", linkageName: "golang_0org_1x_1crypto_1curve25519..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", linkageName: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1dns_1dnsmessage..types", linkageName: "golang_0org_1x_1net_1dns_1dnsmessage..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2..types", linkageName: "golang_0org_1x_1net_1http2..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2_1hpack..types", linkageName: "golang_0org_1x_1net_1http2_1hpack..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpguts..types", linkageName: "golang_0org_1x_1net_1http_1httpguts..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpproxy..types", linkageName: "golang_0org_1x_1net_1http_1httpproxy..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1idna..types", linkageName: "golang_0org_1x_1net_1idna..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1internal_1timeseries..types", linkageName: "golang_0org_1x_1net_1internal_1timeseries..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1trace..types", linkageName: "golang_0org_1x_1net_1trace..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "golang_0org_1x_1sys_1unix..types", linkageName: "golang_0org_1x_1sys_1unix..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1secure_1bidirule..types", linkageName: "golang_0org_1x_1text_1secure_1bidirule..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1transform..types", linkageName: "golang_0org_1x_1text_1transform..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1bidi..types", linkageName: "golang_0org_1x_1text_1unicode_1bidi..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1norm..types", linkageName: "golang_0org_1x_1text_1unicode_1norm..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", linkageName: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc..types", linkageName: "google_0golang_0org_1grpc..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer..types", linkageName: "google_0golang_0org_1grpc_1balancer..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1base..types", linkageName: "google_0golang_0org_1grpc_1balancer_1base..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", linkageName: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", linkageName: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1codes..types", linkageName: "google_0golang_0org_1grpc_1codes..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1connectivity..types", linkageName: "google_0golang_0org_1grpc_1connectivity..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials..types", linkageName: "google_0golang_0org_1grpc_1credentials..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding..types", linkageName: "google_0golang_0org_1grpc_1encoding..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding_1proto..types", linkageName: "google_0golang_0org_1grpc_1encoding_1proto..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1grpclog..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal..types", linkageName: "google_0golang_0org_1grpc_1internal..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1backoff..types", linkageName: "google_0golang_0org_1grpc_1internal_1backoff..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancerload..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancerload..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1binarylog..types", linkageName: "google_0golang_0org_1grpc_1internal_1binarylog..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1channelz..types", linkageName: "google_0golang_0org_1grpc_1internal_1channelz..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1credentials..types", linkageName: "google_0golang_0org_1grpc_1internal_1credentials..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1envconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1envconfig..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpclog..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcrand..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcrand..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1syscall..types", linkageName: "google_0golang_0org_1grpc_1internal_1syscall..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1resolver..types", linkageName: "google_0golang_0org_1grpc_1resolver..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protojson..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protojson..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protowire..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protowire..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descfmt..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descfmt..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descopts..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descopts..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1detrand..types", linkageName: "google_0golang_0org_1protobuf_1internal_1detrand..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1errors..types", linkageName: "google_0golang_0org_1protobuf_1internal_1errors..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filedesc..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filedesc..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filetype..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filetype..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1impl..types", linkageName: "google_0golang_0org_1protobuf_1internal_1impl..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1order..types", linkageName: "google_0golang_0org_1protobuf_1internal_1order..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1proto..types", linkageName: "google_0golang_0org_1protobuf_1proto..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "hash_1crc32..types", linkageName: "hash_1crc32..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "html..types", linkageName: "html..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "html_1template..types", linkageName: "html_1template..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "internal_1intern..types", linkageName: "internal_1intern..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "internal_1oserror..types", linkageName: "internal_1oserror..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "internal_1poll..types", linkageName: "internal_1poll..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "internal_1reflectlite..types", linkageName: "internal_1reflectlite..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "internal_1testlog..types", linkageName: "internal_1testlog..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "io..types", linkageName: "io..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "io_1fs..types", linkageName: "io_1fs..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "io_1ioutil..types", linkageName: "io_1ioutil..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "log..types", linkageName: "log..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "math..types", linkageName: "math..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "math_1big..types", linkageName: "math_1big..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "math_1rand..types", linkageName: "math_1rand..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "mime..types", linkageName: "mime..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "mime_1multipart..types", linkageName: "mime_1multipart..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "mime_1quotedprintable..types", linkageName: "mime_1quotedprintable..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "net..types", linkageName: "net..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "net_1http..types", linkageName: "net_1http..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "net_1http_1httputil..types", linkageName: "net_1http_1httputil..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "net_1http_1internal..types", linkageName: "net_1http_1internal..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "net_1netip..types", linkageName: "net_1netip..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "net_1textproto..types", linkageName: "net_1textproto..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "os..types", linkageName: "os..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "path..types", linkageName: "path..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "path_1filepath..types", linkageName: "path_1filepath..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "reflect..types", linkageName: "reflect..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "regexp..types", linkageName: "regexp..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "regexp_1syntax..types", linkageName: "regexp_1syntax..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "sort..types", linkageName: "sort..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "strconv..types", linkageName: "strconv..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "sync..types", linkageName: "sync..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "syscall..types", linkageName: "syscall..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "text_1tabwriter..types", linkageName: "text_1tabwriter..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "text_1template..types", linkageName: "text_1template..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "text_1template_1parse..types", linkageName: "text_1template_1parse..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "time..types", linkageName: "time..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "unicode..types", linkageName: "unicode..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "container_1list..types", linkageName: "container_1list..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "crypto_1aes..types", linkageName: "crypto_1aes..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "crypto_1des..types", linkageName: "crypto_1des..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "crypto_1ed25519..types", linkageName: "crypto_1ed25519..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "crypto_1hmac..types", linkageName: "crypto_1hmac..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "crypto_1internal_1subtle..types", linkageName: "crypto_1internal_1subtle..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "crypto_1rc4..types", linkageName: "crypto_1rc4..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "crypto_1subtle..types", linkageName: "crypto_1subtle..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "encoding..types", linkageName: "encoding..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes..types", linkageName: "github_0com_1golang_1protobuf_1ptypes..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "github_0com_1pkg_1errors..types", linkageName: "github_0com_1pkg_1errors..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1buffer..types", linkageName: "go_0uber_0org_1zap_1buffer..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "go_0uber_0org_1zap_1internal_1color..types", linkageName: "go_0uber_0org_1zap_1internal_1color..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1hkdf..types", linkageName: "golang_0org_1x_1crypto_1hkdf..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1poly1305..types", linkageName: "golang_0org_1x_1crypto_1internal_1poly1305..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1subtle..types", linkageName: "golang_0org_1x_1crypto_1internal_1subtle..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "golang_0org_1x_1sys_1internal_1unsafeheader..types", linkageName: "golang_0org_1x_1sys_1internal_1unsafeheader..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1attributes..types", linkageName: "google_0golang_0org_1grpc_1attributes..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1backoff..types", linkageName: "google_0golang_0org_1grpc_1backoff..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", linkageName: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1channelz..types", linkageName: "google_0golang_0org_1grpc_1channelz..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials_1insecure..types", linkageName: "google_0golang_0org_1grpc_1credentials_1insecure..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1buffer..types", linkageName: "google_0golang_0org_1grpc_1internal_1buffer..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcsync..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcsync..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcutil..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcutil..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1metadata..types", linkageName: "google_0golang_0org_1grpc_1internal_1metadata..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1pretty..types", linkageName: "google_0golang_0org_1grpc_1internal_1pretty..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1status..types", linkageName: "google_0golang_0org_1grpc_1internal_1status..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1keepalive..types", linkageName: "google_0golang_0org_1grpc_1keepalive..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1metadata..types", linkageName: "google_0golang_0org_1grpc_1metadata..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1peer..types", linkageName: "google_0golang_0org_1grpc_1peer..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1serviceconfig..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1stats..types", linkageName: "google_0golang_0org_1grpc_1stats..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1status..types", linkageName: "google_0golang_0org_1grpc_1status..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1tap..types", linkageName: "google_0golang_0org_1grpc_1tap..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1prototext..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1prototext..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1flags..types", linkageName: "google_0golang_0org_1protobuf_1internal_1flags..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1genid..types", linkageName: "google_0golang_0org_1protobuf_1internal_1genid..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1pragma..types", linkageName: "google_0golang_0org_1protobuf_1internal_1pragma..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1set..types", linkageName: "google_0golang_0org_1protobuf_1internal_1set..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1strs..types", linkageName: "google_0golang_0org_1protobuf_1internal_1strs..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1version..types", linkageName: "google_0golang_0org_1protobuf_1internal_1version..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "hash..types", linkageName: "hash..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "hash_1fnv..types", linkageName: "hash_1fnv..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "internal_1abi..types", linkageName: "internal_1abi..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "internal_1fmtsort..types", linkageName: "internal_1fmtsort..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "internal_1goarch..types", linkageName: "internal_1goarch..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "internal_1godebug..types", linkageName: "internal_1godebug..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "internal_1goexperiment..types", linkageName: "internal_1goexperiment..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "internal_1goos..types", linkageName: "internal_1goos..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "internal_1itoa..types", linkageName: "internal_1itoa..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "internal_1nettrace..types", linkageName: "internal_1nettrace..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "internal_1race..types", linkageName: "internal_1race..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "internal_1singleflight..types", linkageName: "internal_1singleflight..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "internal_1syscall_1execenv..types", linkageName: "internal_1syscall_1execenv..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "internal_1syscall_1unix..types", linkageName: "internal_1syscall_1unix..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "internal_1unsafeheader..types", linkageName: "internal_1unsafeheader..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "math_1bits..types", linkageName: "math_1bits..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "net_1http_1httptrace..types", linkageName: "net_1http_1httptrace..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "net_1http_1internal_1ascii..types", linkageName: "net_1http_1internal_1ascii..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "net_1url..types", linkageName: "net_1url..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "strings..types", linkageName: "strings..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "sync_1atomic..types", linkageName: "sync_1atomic..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "unicode_1utf16..types", linkageName: "unicode_1utf16..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "unicode_1utf8..types", linkageName: "unicode_1utf8..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !3, file: !26, type: !281, isLocal: false, isDefinition: true)
!778 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !8, line: 1, type: !779, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !243)
!779 = !DISubroutineType(types: !780)
!780 = !{!53}
!781 = !DILocation(line: 1, column: 1, scope: !782)
!782 = !DILexicalBlockFile(scope: !778, file: !31, discriminator: 0)
!783 = !DILocation(line: 38, column: 23, scope: !784)
!784 = !DILexicalBlockFile(scope: !778, file: !8, discriminator: 0)
!785 = !DILocation(line: 38, column: 5, scope: !784)
!786 = !DILocation(line: 5, column: 1, scope: !787)
!787 = !DILexicalBlockFile(scope: !778, file: !788, discriminator: 0)
!788 = !DIFile(filename: "_gomod_.go", directory: "/tmp/go-build/b001")
!789 = distinct !DISubprogram(name: "main.SmartContract.Init", scope: null, file: !8, line: 34, type: !790, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !243)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !801, !801, !803}
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !8, line: 9, size: 640, align: 8, elements: !793)
!793 = !{!794, !796, !797, !798, !799, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !8, line: 9, baseType: !795, size: 32, align: 32)
!795 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !8, line: 9, baseType: !58, size: 128, align: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !8, line: 9, baseType: !172, size: 192, align: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !8, line: 9, baseType: !242, align: 8, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !8, line: 9, baseType: !172, size: 192, align: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !8, line: 9, baseType: !795, size: 32, align: 32, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !8, line: 17, align: 1, elements: !243)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !8, line: 9, size: 128, align: 8, elements: !804)
!804 = !{!805, !175}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 9, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
