; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22auction\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sha256\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/sha256\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22crypto/sha256\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./89.go", directory: "/home/ming/go/src/chaincode_repo/github/89join")
!5 = !{!6, !23}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !25, line: 10, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "89.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !25, line: 10, size: 2624, align: 4, elements: !28)
!28 = !{!29, !33, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !25, line: 10, baseType: !30, size: 512, align: 8)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 1, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !25, line: 10, baseType: !34, size: 2048, align: 8, offset: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 1, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 256, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !25, line: 10, baseType: !38, size: 32, align: 32, offset: 2560)
!38 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 2592)
!40 = distinct !DISubprogram(name: "command_x2dline_x2darguments.SmartContract..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !43, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !{}
!46 = !DILocalVariable(name: "key1", arg: 1, scope: !40, file: !8, line: 1, type: !43)
!47 = !DILocation(line: 0, scope: !40)
!48 = !DILocalVariable(name: "key2", arg: 2, scope: !40, file: !8, line: 1, type: !43)
!49 = !DILocalVariable(name: "$ret21", scope: !40, file: !8, line: 1, type: !13)
!50 = !DILocation(line: 1, column: 1, scope: !40)
!51 = distinct !DISubprogram(name: "command-line-arguments.SmartContract.CloseAuction", linkageName: "command_x2dline_x2darguments.SmartContract.CloseAuction", scope: null, file: !25, line: 289, type: !52, scopeLine: 289, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !112, !112, !1817, !83}
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !55)
!55 = !{!56, !111}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !59)
!59 = !{!60, !107}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !63)
!63 = !{!64, !66, !67, !69, !70, !71, !72, !73, !79, !81, !88, !106}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !68, size: 32, align: 32, offset: 128)
!68 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !74, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !80, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !80, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !89, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !82, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !82, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !95, size: 192, align: 64, offset: 128)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !96)
!96 = !{!97, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !100)
!100 = !{!92, !93, !101, !102, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !87, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!83, !43}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !25, line: 22, size: 1152, align: 8, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !25, line: 23, baseType: !116, size: 1152, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !25, line: 17, size: 1152, align: 8, elements: !117)
!117 = !{!118, !119, !135, !140, !141, !142}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 17, baseType: !83, size: 128, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !25, line: 17, baseType: !120, size: 512, align: 64, offset: 128)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !25, line: 17, size: 512, align: 8, elements: !121)
!121 = !{!122, !123, !124, !130, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !25, line: 17, baseType: !83, size: 128, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !25, line: 17, baseType: !125, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !25, line: 17, size: 384, align: 8, elements: !127)
!127 = !{!118, !128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !25, line: 17, baseType: !131, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !25, line: 17, size: 256, align: 8, elements: !133)
!133 = !{!118, !128}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !25, line: 17, baseType: !136, size: 128, align: 64, offset: 640)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !25, line: 13, size: 128, align: 8, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !61, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !25, line: 17, baseType: !136, size: 128, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !25, line: 17, baseType: !136, size: 128, align: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !25, line: 17, baseType: !143, size: 128, align: 64, offset: 1024)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !25, line: 17, size: 128, align: 8, elements: !144)
!144 = !{!145, !139}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 17, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !10, size: 192, align: 8, elements: !148)
!148 = !{!149, !150, !375}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 17, baseType: !61, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !10, line: 17, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!44, !43, !154}
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !25, line: 17, size: 128, align: 8, elements: !155)
!155 = !{!156, !139}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 17, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !10, size: 384, align: 8, elements: !159)
!159 = !{!149, !160, !164, !173, !181, !182}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !10, line: 17, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!54, !43, !83, !83}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !10, line: 17, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !43, !83}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !10, size: 320, align: 8, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !10, line: 17, baseType: !83, size: 128, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !10, line: 17, baseType: !13, size: 8, align: 8, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 17, baseType: !54, size: 128, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !10, line: 17, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !43}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !83, size: 128, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !54, size: 128, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !10, line: 17, baseType: !174, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !10, line: 17, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !43}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !10, size: 192, align: 8, elements: !187)
!187 = !{!188, !374}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !25, line: 17, size: 10624, align: 8, elements: !191)
!191 = !{!192, !196, !197, !198, !199, !200, !201, !203, !205, !206, !207, !220, !249, !250, !285, !286, !288, !298, !299, !304, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !329, !353, !354, !355, !356, !367, !368, !369, !370, !371, !372, !373}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !25, line: 17, baseType: !193, size: 192, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !194)
!194 = !{!195, !104, !105}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !80, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !25, line: 17, baseType: !202, size: 64, align: 64, offset: 1152)
!202 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !25, line: 17, baseType: !204, size: 64, align: 64, offset: 1216)
!204 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !25, line: 17, baseType: !136, size: 128, align: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 17, baseType: !87, size: 64, align: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 17, baseType: !208, size: 64, align: 64, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !25, line: 17, size: 256, align: 8, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !25, line: 17, baseType: !13, size: 8, align: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !25, line: 17, baseType: !213, size: 192, align: 64, offset: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !25, line: 17, size: 192, align: 8, elements: !214)
!214 = !{!215, !218, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !87, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !25, line: 17, baseType: !221, size: 1984, align: 64, offset: 1536)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 17, size: 1984, align: 8, elements: !222)
!222 = !{!223, !227, !228, !229, !230, !231, !232, !233, !234, !235, !248}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !25, line: 17, baseType: !224, size: 192, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !225)
!225 = !{!226, !104, !105}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !82, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !25, line: 17, baseType: !236, size: 192, align: 64, offset: 1600)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !10, size: 192, align: 8, elements: !237)
!237 = !{!238, !104, !105}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !25, line: 17, size: 320, align: 8, elements: !241)
!241 = !{!242, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 17, baseType: !243, size: 192, align: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !25, line: 17, size: 192, align: 8, elements: !244)
!244 = !{!245, !218, !219}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 17, baseType: !136, size: 128, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !25, line: 17, baseType: !236, size: 192, align: 64, offset: 1792)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !25, line: 17, baseType: !221, size: 1984, align: 64, offset: 3520)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !25, line: 17, baseType: !251, size: 192, align: 64, offset: 5504)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !25, line: 16, size: 192, align: 8, elements: !252)
!252 = !{!253, !254, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !25, line: 16, baseType: !22, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !25, line: 16, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !25, line: 16, baseType: !257, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !25, line: 16, size: 832, align: 8, elements: !259)
!259 = !{!260, !261, !270, !281, !282, !283, !284}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 16, baseType: !83, size: 128, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !25, line: 16, baseType: !262, size: 192, align: 64, offset: 128)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !10, size: 192, align: 8, elements: !263)
!263 = !{!264, !104, !105}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !25, line: 16, size: 256, align: 8, elements: !267)
!267 = !{!260, !268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !25, line: 16, baseType: !87, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !25, line: 16, baseType: !271, size: 192, align: 64, offset: 320)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !10, size: 192, align: 8, elements: !272)
!272 = !{!273, !104, !105}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !25, line: 16, size: 128, align: 8, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !25, line: 16, baseType: !255, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !25, line: 16, baseType: !16, size: 8, align: 8, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 72)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !25, line: 16, baseType: !83, size: 128, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !25, line: 16, baseType: !255, size: 64, align: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !25, line: 16, baseType: !255, size: 64, align: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !25, line: 16, baseType: !265, size: 64, align: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !25, line: 17, baseType: !251, size: 192, align: 64, offset: 5696)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !25, line: 17, baseType: !287, size: 64, align: 64, offset: 5888)
!287 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !25, line: 17, baseType: !289, size: 192, align: 64, offset: 5952)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !10, size: 192, align: 8, elements: !290)
!290 = !{!291, !104, !105}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !25, line: 17, size: 448, align: 8, elements: !294)
!294 = !{!295, !296, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !25, line: 17, baseType: !243, size: 192, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !25, line: 17, baseType: !289, size: 192, align: 64, offset: 6144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !25, line: 17, baseType: !300, size: 192, align: 64, offset: 6336)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !10, size: 192, align: 8, elements: !301)
!301 = !{!302, !104, !105}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !25, line: 17, baseType: !305, size: 192, align: 64, offset: 6528)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !10, size: 192, align: 8, elements: !306)
!306 = !{!307, !104, !105}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !25, line: 17, baseType: !300, size: 192, align: 64, offset: 6720)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 6912)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 6920)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !25, line: 17, baseType: !87, size: 64, align: 64, offset: 6976)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 7040)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 7104)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !25, line: 17, baseType: !193, size: 192, align: 64, offset: 7296)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 7488)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 7680)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 7872)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 8064)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !25, line: 17, baseType: !322, size: 192, align: 64, offset: 8256)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !10, size: 192, align: 8, elements: !323)
!323 = !{!324, !104, !105}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !25, line: 17, size: 192, align: 8, elements: !327)
!327 = !{!328, !218, !219}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !80, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !25, line: 17, baseType: !330, size: 192, align: 64, offset: 8448)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !10, size: 192, align: 8, elements: !331)
!331 = !{!332, !104, !105}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !25, line: 17, size: 1152, align: 8, elements: !336)
!336 = !{!337, !338, !339, !346, !347, !348, !349, !350, !351, !352}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !25, line: 17, baseType: !83, size: 128, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !25, line: 17, baseType: !340, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !25, line: 17, size: 320, align: 8, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !25, line: 17, baseType: !83, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !25, line: 17, baseType: !83, size: 128, align: 64, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !25, line: 17, baseType: !13, size: 8, align: 8, offset: 8640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 8704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 8896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !25, line: 17, baseType: !357, size: 192, align: 64, offset: 9088)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !10, size: 192, align: 8, elements: !358)
!358 = !{!359, !104, !105}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !25, line: 17, size: 384, align: 8, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !25, line: 17, baseType: !326, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !25, line: 17, baseType: !366, size: 192, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !25, line: 17, size: 192, align: 8, elements: !327)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !25, line: 17, baseType: !357, size: 192, align: 64, offset: 9280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 9472)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 9664)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 9856)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 10048)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !25, line: 17, baseType: !224, size: 192, align: 64, offset: 10240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !25, line: 17, baseType: !300, size: 192, align: 64, offset: 10432)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !54, size: 128, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !10, line: 17, baseType: !376, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!44, !43, !379}
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 16, size: 128, align: 8, elements: !380)
!380 = !{!381, !139}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !384)
!384 = !{!385, !386, !390, !391, !395, !403, !411, !412, !413, !414, !431, !438, !1676, !1680, !1707, !1711, !1712, !1716, !1717, !1721, !1737, !1752, !1756, !1760, !1764, !1765, !1769, !1770, !1774, !1781, !1782, !1789, !1798, !1799, !1803, !1807, !1808, !1809, !1810}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 16, baseType: !61, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 16, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!177, !43, !83, !224}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 16, baseType: !161, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 16, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!54, !43, !83}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 16, baseType: !396, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!399, !43}
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !400)
!400 = !{!401, !104, !105}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 16, baseType: !404, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !43}
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !193, size: 192, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !54, size: 128, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 16, baseType: !404, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 16, baseType: !108, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 16, baseType: !404, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 16, baseType: !415, size: 64, align: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !43}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !420)
!420 = !{!421, !422, !423, !424, !426, !427, !428, !429, !430}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !87, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !425, size: 16, align: 16, offset: 80)
!425 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !68, size: 32, align: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !65, size: 64, align: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 16, baseType: !432, size: 64, align: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !43}
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !436)
!436 = !{!179, !437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !224, size: 192, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 16, baseType: !439, size: 64, align: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !43, !83}
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !443)
!443 = !{!444, !180}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !445, size: 128, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 16, size: 128, align: 8, elements: !446)
!446 = !{!447, !139}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !450)
!450 = !{!385, !451, !455, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 16, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!54, !43}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 16, baseType: !456, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!13, !43}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 16, baseType: !460, size: 64, align: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !43}
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !464)
!464 = !{!465, !1675}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 16, size: 704, align: 8, elements: !468)
!468 = !{!469, !470, !471, !1670, !1671, !1673, !1674}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 16, baseType: !83, size: 128, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 16, baseType: !193, size: 192, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 16, baseType: !472, size: 64, align: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 16, size: 448, align: 8, elements: !474)
!474 = !{!475, !1666, !1667, !1668, !1669}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 16, baseType: !476, size: 64, align: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 16, size: 64, align: 8, elements: !477)
!477 = !{!478, !480, !491, !497}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 16, baseType: !479, align: 8)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 15, align: 1, elements: !45)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 16, baseType: !481, align: 64)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, align: 8, elements: !489)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 18, size: 64, align: 8, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 18, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!44}
!489 = !{!490}
!490 = !DISubrange(count: 0, lowerBound: 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 16, baseType: !492, align: 32)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, align: 4, elements: !489)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 15, size: 64, align: 4, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 15, baseType: !38, size: 32, align: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 15, baseType: !68, size: 32, align: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 16, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 15, size: 2624, align: 8, elements: !500)
!500 = !{!501, !664, !1458, !1466, !1471, !1472, !1473, !1568}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 15, baseType: !502, size: 128, align: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 11, size: 128, align: 8, elements: !503)
!503 = !{!504, !139}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 11, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !507)
!507 = !{!508, !509, !513, !517, !518, !523, !524, !525, !529, !549, !550, !554, !562, !573, !574, !578, !579, !580, !585, !586, !635, !643, !644, !645, !646, !647, !648, !649, !650, !654, !655, !659, !660}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 11, baseType: !61, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!87, !43}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 11, baseType: !514, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!13, !43, !502}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 11, baseType: !519, size: 64, align: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !43}
!522 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 11, baseType: !456, size: 64, align: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 11, baseType: !514, size: 64, align: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 11, baseType: !526, size: 64, align: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!502, !43}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 11, baseType: !530, size: 64, align: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !43, !87}
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 11, size: 832, align: 8, elements: !534)
!534 = !{!535, !536, !537, !538, !543, !544, !548}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 11, baseType: !83, size: 128, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 11, baseType: !83, size: 128, align: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 11, baseType: !502, size: 128, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 11, baseType: !539, size: 128, align: 64, offset: 384)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 11, size: 128, align: 8, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !80, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 11, baseType: !65, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !545, size: 192, align: 64, offset: 576)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !546)
!546 = !{!547, !104, !105}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !246, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 11, baseType: !13, size: 8, align: 8, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 11, baseType: !551, size: 64, align: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!533, !43, !545}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 11, baseType: !555, size: 64, align: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !43, !83}
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !533, size: 832, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 832)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 11, baseType: !563, size: 64, align: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!558, !43, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!13, !83}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 11, baseType: !514, size: 64, align: 64, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 11, baseType: !575, size: 64, align: 64, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!502, !43, !87}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 11, baseType: !456, size: 64, align: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 11, baseType: !526, size: 64, align: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 11, baseType: !581, size: 64, align: 64, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!584, !43}
!584 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 11, baseType: !587, size: 64, align: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !43, !87}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !25, line: 11, size: 640, align: 8, elements: !591)
!591 = !{!535, !536, !537, !592, !634}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !25, line: 11, baseType: !593, size: 192, align: 64, offset: 384)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 11, size: 192, align: 8, elements: !594)
!594 = !{!595, !631, !632}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !25, line: 11, size: 512, align: 8, elements: !598)
!598 = !{!599, !600, !601, !602, !604, !605, !606, !607, !612, !613, !614, !630}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 11, baseType: !65, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 11, baseType: !65, size: 64, align: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 11, baseType: !68, size: 32, align: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !25, line: 11, baseType: !603, size: 8, align: 8, offset: 160)
!603 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 168)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 11, baseType: !16, size: 8, align: 8, offset: 184)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !25, line: 11, baseType: !608, size: 64, align: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 11, size: 64, align: 8, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 11, baseType: !78, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 11, baseType: !80, size: 64, align: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 11, baseType: !82, size: 64, align: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 11, baseType: !615, size: 64, align: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !25, line: 11, size: 320, align: 8, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 11, baseType: !82, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 11, baseType: !82, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 11, baseType: !621, size: 192, align: 64, offset: 128)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !622)
!622 = !{!623, !104, !105}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !25, line: 11, size: 320, align: 8, elements: !626)
!626 = !{!618, !619, !627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 11, baseType: !43, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !25, line: 11, baseType: !633, size: 64, align: 64, offset: 128)
!633 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 11, baseType: !87, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 11, baseType: !636, size: 64, align: 64, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !43, !83}
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !590, size: 640, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 11, baseType: !108, size: 64, align: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 1536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 11, baseType: !510, size: 64, align: 64, offset: 1600)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 11, baseType: !575, size: 64, align: 64, offset: 1664)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 11, baseType: !108, size: 64, align: 64, offset: 1728)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 11, baseType: !651, size: 64, align: 64, offset: 1792)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!65, !43}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 11, baseType: !108, size: 64, align: 64, offset: 1856)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 11, baseType: !656, size: 64, align: 64, offset: 1920)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!596, !43}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 11, baseType: !108, size: 64, align: 64, offset: 1984)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 11, baseType: !661, size: 64, align: 64, offset: 2048)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!615, !43}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !25, line: 15, baseType: !665, size: 128, align: 64, offset: 128)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !666)
!666 = !{!667, !139}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !670)
!670 = !{!671, !672, !1384, !1388, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1433, !1434, !1435, !1436, !1437, !1441, !1455, !1456, !1457}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 15, baseType: !61, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 15, baseType: !673, size: 64, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !43}
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !677)
!677 = !{!678, !139}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !681)
!681 = !{!671, !682, !1380, !834, !835}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !683, size: 64, align: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !43, !703}
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !687)
!687 = !{!688, !139}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !691)
!691 = !{!671, !692, !697, !698, !699, !704, !1314, !811, !1005, !1315, !1319, !1337, !1013, !1358}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !693, size: 64, align: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !43}
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !25, line: 15, size: 128, align: 8, elements: !540)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !700, size: 64, align: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !43}
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 15, size: 128, align: 8, elements: !540)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !705, size: 64, align: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !43}
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !25, line: 15, size: 128, align: 8, elements: !709)
!709 = !{!710, !139}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !713)
!713 = !{!671, !714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 15, baseType: !715, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !43}
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !25, line: 15, size: 128, align: 8, elements: !719)
!719 = !{!720, !139}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !723)
!723 = !{!671, !724, !1085, !1086, !1090, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1278, !1289, !1293, !1297, !1310}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 15, baseType: !725, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!44, !43, !728}
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !729)
!729 = !{!730, !139}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !733)
!733 = !{!671, !734, !739, !743, !1014, !1024, !1045, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1067, !1071, !1072, !1073, !1074, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 15, baseType: !735, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !43}
!738 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 15, baseType: !740, size: 64, align: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!665, !43}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 15, baseType: !744, size: 64, align: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !43}
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !748)
!748 = !{!749, !139}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !752)
!752 = !{!671, !753, !793, !794, !795, !796, !797, !798, !799, !1007, !1008, !1009, !1013}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 15, baseType: !754, size: 64, align: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !43}
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !758)
!758 = !{!759, !139}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !762)
!762 = !{!671, !763, !767, !771, !776, !777, !781, !782}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 15, baseType: !764, size: 64, align: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!728, !43, !83}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !768, size: 64, align: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!728, !43, !703}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 15, baseType: !772, size: 64, align: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!728, !43, !775}
!775 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 15, baseType: !764, size: 64, align: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !778, size: 64, align: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!728, !43, !87}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!44, !43, !786}
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !25, line: 15, size: 128, align: 8, elements: !787)
!787 = !{!788, !139}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !789, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !791)
!791 = !{!671, !792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !693, size: 64, align: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !700, size: 64, align: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !800, size: 64, align: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !43}
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !25, line: 15, size: 128, align: 8, elements: !804)
!804 = !{!805, !139}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !808)
!808 = !{!671, !692, !697, !698, !699, !809, !810, !811, !1005, !1006}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !812, size: 64, align: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !43}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !816)
!816 = !{!817, !139}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !820)
!820 = !{!671, !821, !822, !836, !837, !858, !859, !860, !878, !879, !880, !881, !882, !883, !884, !885, !889, !965, !1004}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 15, baseType: !823, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !43}
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !827)
!827 = !{!828, !139}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !831)
!831 = !{!671, !832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !768, size: 64, align: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !778, size: 64, align: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 15, baseType: !693, size: 64, align: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 15, baseType: !838, size: 64, align: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!841, !43}
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !25, line: 15, size: 128, align: 8, elements: !842)
!842 = !{!843, !139}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !844, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !846)
!846 = !{!671, !847, !856, !857}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !848, size: 64, align: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!851, !43, !87}
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !25, line: 15, size: 192, align: 8, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !25, line: 15, baseType: !815, size: 128, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !25, line: 15, baseType: !13, size: 8, align: 8, offset: 136)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 15, baseType: !510, size: 64, align: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 15, baseType: !861, size: 64, align: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !43}
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !865)
!865 = !{!866, !139}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !869)
!869 = !{!671, !870, !874, !834, !835}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !871, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!665, !43, !703}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !875, size: 64, align: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!665, !43, !87}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !700, size: 64, align: 64, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 15, baseType: !693, size: 64, align: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 15, baseType: !108, size: 64, align: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 15, baseType: !886, size: 64, align: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!44, !43, !815}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 15, baseType: !890, size: 64, align: 64, offset: 1024)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!893, !43}
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !894)
!894 = !{!895, !139}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !898)
!898 = !{!671, !899, !961, !834, !835}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !900, size: 64, align: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!903, !43, !703}
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !904)
!904 = !{!905, !139}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !908)
!908 = !{!671, !692, !697, !698, !909, !951, !952, !953, !954, !955, !956, !960}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 15, baseType: !910, size: 64, align: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !43}
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !25, line: 15, size: 128, align: 8, elements: !914)
!914 = !{!915, !139}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !918)
!918 = !{!671, !919, !947, !834, !835}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 15, baseType: !920, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !43, !703}
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !25, line: 15, size: 128, align: 8, elements: !924)
!924 = !{!925, !139}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !928)
!928 = !{!671, !692, !697, !929, !795, !930, !931, !932, !933, !934, !935, !936, !937, !938, !942}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 15, baseType: !740, size: 64, align: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 15, baseType: !456, size: 64, align: 64, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !700, size: 64, align: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 15, baseType: !740, size: 64, align: 64, offset: 576)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 640)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 704)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 768)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 15, baseType: !939, size: 64, align: 64, offset: 832)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!44, !43, !923}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 15, baseType: !943, size: 64, align: 64, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!946, !43}
!946 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !948, size: 64, align: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!923, !43, !87}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 15, baseType: !700, size: 64, align: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 15, baseType: !43, size: 64, align: 64, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 15, baseType: !783, size: 64, align: 64, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 15, baseType: !957, size: 64, align: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!44, !43, !903}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 15, baseType: !943, size: 64, align: 64, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 15, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!903, !43, !87}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 15, baseType: !966, size: 64, align: 64, offset: 1088)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !43}
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !25, line: 15, size: 128, align: 8, elements: !970)
!970 = !{!971, !139}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 15, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
