; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22test\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22peer\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-protos-go/peer\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22indirectimport \22"
module asm "\09.ascii \22impl\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!4 = !DIFile(filename: "./privacyleak.go", directory: "/home/ming/go/src/chaincode_repo/taintAnalysis/errPrivacyLeak")
!5 = distinct !DISubprogram(name: "command-line-arguments.BadChaincode.Init", linkageName: "command_x2dline_x2darguments.BadChaincode.Init", scope: null, file: !6, line: 11, type: !7, scopeLine: 11, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !31)
!6 = !DIFile(filename: "privacyleak.go", directory: ".")
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !34, !34, !36}
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !6, line: 5, size: 640, align: 8, elements: !10)
!10 = !{!11, !13, !22, !29, !32, !33}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !6, line: 5, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !6, line: 5, baseType: !14, size: 128, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !15, line: 1, size: 128, align: 8, elements: !16)
!15 = !DIFile(filename: "<built-in>", directory: "")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !15, line: 1, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !15, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !6, line: 5, baseType: !23, size: 192, align: 64, offset: 192)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !24, size: 192, align: 8, elements: !25)
!24 = !DIFile(filename: "", directory: "")
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !18, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !21, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !6, line: 5, baseType: !30, align: 8, offset: 384)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !15, line: 1, align: 1, elements: !31)
!31 = !{}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !6, line: 5, baseType: !23, size: 192, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !6, line: 5, baseType: !12, size: 32, align: 32, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "BadChaincode", file: !6, line: 9, align: 1, elements: !31)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !6, line: 5, size: 128, align: 8, elements: !37)
!37 = !{!38, !386}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !24, size: 2496, align: 8, elements: !41)
!41 = !{!42, !86, !109, !113, !117, !125, !133, !134, !135, !136, !153, !160, !1403, !1407, !1434, !1438, !1439, !1443, !1444, !1448, !1463, !1475, !1479, !1483, !1487, !1488, !1492, !1493, !1497, !1504, !1505, !1512, !1516, !1517, !1521, !1525, !1526, !1527, !1528}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 5, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !15, line: 1, size: 512, align: 8, elements: !45)
!45 = !{!46, !48, !49, !51, !52, !53, !54, !55, !66, !67, !69, !85}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !15, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !15, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !15, line: 1, baseType: !50, size: 32, align: 32, offset: 128)
!50 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 168)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 184)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !15, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !15, line: 1, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !15, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !64}
!63 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "void")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !15, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !15, line: 1, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !15, line: 1, baseType: !70, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !15, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !15, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !15, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !15, line: 1, baseType: !76, size: 192, align: 64, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !24, size: 192, align: 8, elements: !77)
!77 = !{!78, !27, !28}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !15, line: 1, size: 320, align: 8, elements: !81)
!81 = !{!73, !74, !82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !24, line: 5, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !64, !14, !106}
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !24, size: 256, align: 8, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !14, size: 128, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !94, size: 128, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !15, line: 1, size: 128, align: 8, elements: !95)
!95 = !{!96, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !15, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !24, size: 128, align: 8, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !43, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !24, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!14, !64}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !24, size: 192, align: 8, elements: !107)
!107 = !{!108, !27, !28}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !68, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !24, line: 5, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!94, !64, !14, !14}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !24, line: 5, baseType: !114, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!94, !64, !14}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !24, line: 5, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !64}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !24, size: 192, align: 8, elements: !122)
!122 = !{!123, !27, !28}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !24, line: 5, baseType: !126, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !64}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !24, size: 320, align: 8, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 6, baseType: !23, size: 192, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 6, baseType: !94, size: 128, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !24, line: 5, baseType: !126, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !24, line: 5, baseType: !126, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !24, line: 5, baseType: !137, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !64}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !15, line: 1, size: 384, align: 8, elements: !142)
!142 = !{!143, !144, !145, !146, !148, !149, !150, !151, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !15, line: 1, baseType: !21, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !15, line: 1, baseType: !19, size: 8, align: 8, offset: 72)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !15, line: 1, baseType: !147, size: 16, align: 16, offset: 80)
!147 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !15, line: 1, baseType: !50, size: 32, align: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !15, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !15, line: 1, baseType: !64, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !24, line: 5, baseType: !154, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !64}
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !24, size: 320, align: 8, elements: !158)
!158 = !{!92, !159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !106, size: 192, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !24, line: 5, baseType: !161, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !64, !14}
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !24, size: 256, align: 8, elements: !165)
!165 = !{!166, !93}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !6, line: 5, size: 128, align: 8, elements: !168)
!168 = !{!169, !386}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !24, size: 256, align: 8, elements: !172)
!172 = !{!42, !173, !177, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !24, line: 5, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!94, !64}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!63, !64}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !24, line: 5, baseType: !182, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !64}
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !24, size: 192, align: 8, elements: !186)
!186 = !{!187, !886}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !6, line: 5, size: 704, align: 8, elements: !190)
!190 = !{!191, !192, !193, !1399, !1400, !1401, !1402}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !6, line: 5, baseType: !14, size: 128, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !6, line: 5, baseType: !23, size: 192, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !6, line: 5, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !6, line: 5, size: 448, align: 8, elements: !196)
!196 = !{!197, !1394, !1395, !1396, !1398}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !6, line: 5, baseType: !198, size: 64, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !6, line: 5, size: 64, align: 8, elements: !199)
!199 = !{!200, !202, !213, !219}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !6, line: 5, baseType: !201, align: 8)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !6, line: 5, align: 1, elements: !31)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !6, line: 5, baseType: !203, align: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, align: 8, elements: !211)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!65}
!211 = !{!212}
!212 = !DISubrange(count: 0, lowerBound: 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !6, line: 5, baseType: !214, align: 32)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, align: 4, elements: !211)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !6, line: 5, size: 64, align: 4, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !6, line: 5, baseType: !12, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !6, line: 5, baseType: !50, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !6, line: 5, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !6, line: 5, size: 2624, align: 8, elements: !222)
!222 = !{!223, !387, !1186, !1194, !1199, !1200, !1201, !1296}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !6, line: 5, baseType: !224, size: 128, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !6, line: 5, size: 128, align: 8, elements: !225)
!225 = !{!226, !386}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !24, size: 2112, align: 8, elements: !229)
!229 = !{!42, !230, !234, !238, !239, !244, !245, !246, !250, !271, !272, !276, !284, !295, !296, !300, !301, !302, !307, !308, !357, !365, !366, !367, !368, !369, !370, !371, !372, !376, !377, !381, !382}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!21, !64}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !24, line: 5, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!63, !64, !224}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !24, line: 5, baseType: !240, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !64}
!243 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !24, line: 5, baseType: !235, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !24, line: 5, baseType: !247, size: 64, align: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!224, !64}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !24, line: 5, baseType: !251, size: 64, align: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!254, !64, !21}
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !6, line: 5, size: 832, align: 8, elements: !255)
!255 = !{!256, !257, !258, !259, !264, !265, !270}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !6, line: 5, baseType: !14, size: 128, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !6, line: 5, baseType: !14, size: 128, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !6, line: 5, baseType: !224, size: 128, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !6, line: 5, baseType: !260, size: 128, align: 64, offset: 384)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !6, line: 5, size: 128, align: 8, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !6, line: 1, baseType: !18, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !6, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !6, line: 5, baseType: !47, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !6, line: 5, baseType: !266, size: 192, align: 64, offset: 576)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !24, size: 192, align: 8, elements: !267)
!267 = !{!268, !27, !28}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !6, line: 5, baseType: !63, size: 8, align: 8, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !24, line: 5, baseType: !273, size: 64, align: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!254, !64, !266}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !24, line: 5, baseType: !277, size: 64, align: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !64, !14}
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !24, size: 896, align: 8, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !254, size: 832, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !63, size: 8, align: 8, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !24, line: 5, baseType: !285, size: 64, align: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!280, !64, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!63, !14}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !24, line: 5, baseType: !235, size: 64, align: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !24, line: 5, baseType: !297, size: 64, align: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!224, !64, !21}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !24, line: 5, baseType: !247, size: 64, align: 64, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !24, line: 5, baseType: !303, size: 64, align: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !64}
!306 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !24, line: 5, baseType: !309, size: 64, align: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !64, !21}
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !6, line: 5, size: 640, align: 8, elements: !313)
!313 = !{!256, !257, !258, !314, !356}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !6, line: 5, baseType: !315, size: 192, align: 64, offset: 384)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !6, line: 5, size: 192, align: 8, elements: !316)
!316 = !{!317, !353, !354}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !6, line: 5, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !6, line: 5, size: 512, align: 8, elements: !320)
!320 = !{!321, !322, !323, !324, !326, !327, !328, !329, !334, !335, !336, !352}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !6, line: 5, baseType: !47, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !6, line: 5, baseType: !47, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !6, line: 5, baseType: !50, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !6, line: 5, baseType: !325, size: 8, align: 8, offset: 160)
!325 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !6, line: 5, baseType: !19, size: 8, align: 8, offset: 168)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !6, line: 5, baseType: !19, size: 8, align: 8, offset: 176)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !6, line: 5, baseType: !19, size: 8, align: 8, offset: 184)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !6, line: 5, baseType: !330, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !60, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !6, line: 5, baseType: !18, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !6, line: 5, baseType: !68, size: 64, align: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !6, line: 5, baseType: !337, size: 64, align: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !6, line: 5, size: 320, align: 8, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !6, line: 5, baseType: !68, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !6, line: 5, baseType: !68, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !6, line: 5, baseType: !343, size: 192, align: 64, offset: 128)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !24, size: 192, align: 8, elements: !344)
!344 = !{!345, !27, !28}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !6, line: 5, size: 320, align: 8, elements: !348)
!348 = !{!340, !341, !349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !6, line: 5, baseType: !64, size: 64, align: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !6, line: 5, baseType: !64, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !6, line: 5, baseType: !64, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !6, line: 5, baseType: !64, size: 64, align: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !6, line: 5, baseType: !64, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !6, line: 5, baseType: !355, size: 64, align: 64, offset: 128)
!355 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !24, line: 5, baseType: !358, size: 64, align: 64, offset: 1280)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !64, !14}
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !24, size: 704, align: 8, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !312, size: 640, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !63, size: 8, align: 8, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 1408)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 1472)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 1536)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 1600)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !24, line: 5, baseType: !297, size: 64, align: 64, offset: 1664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !24, line: 5, baseType: !373, size: 64, align: 64, offset: 1792)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!47, !64}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1856)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !24, line: 5, baseType: !378, size: 64, align: 64, offset: 1920)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!318, !64}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1984)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !24, line: 5, baseType: !383, size: 64, align: 64, offset: 2048)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!337, !64}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !6, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !6, line: 5, baseType: !388, size: 128, align: 64, offset: 128)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !389)
!389 = !{!390, !386}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !24, size: 1408, align: 8, elements: !393)
!393 = !{!42, !394, !1112, !1116, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1161, !1162, !1163, !1164, !1165, !1169, !1183, !1184, !1185}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !24, line: 5, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !64}
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !399)
!399 = !{!400, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 320, align: 8, elements: !403)
!403 = !{!42, !404, !1108, !556, !557}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !64, !425}
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !409)
!409 = !{!410, !386}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !24, size: 896, align: 8, elements: !413)
!413 = !{!42, !414, !419, !420, !421, !426, !1042, !533, !729, !1043, !1047, !1065, !737, !1086}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !64}
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !6, line: 5, size: 128, align: 8, elements: !261)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !64}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !6, line: 5, size: 128, align: 8, elements: !261)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !427, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!430, !64}
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !6, line: 5, size: 128, align: 8, elements: !431)
!431 = !{!432, !386}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !24, size: 128, align: 8, elements: !435)
!435 = !{!42, !436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !24, line: 5, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !64}
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !6, line: 5, size: 128, align: 8, elements: !441)
!441 = !{!442, !386}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !24, size: 1088, align: 8, elements: !445)
!445 = !{!42, !446, !808, !809, !813, !820, !824, !825, !826, !827, !828, !829, !1006, !1017, !1021, !1025, !1038}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !24, line: 5, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!65, !64, !450}
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !451)
!451 = !{!452, !386}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !24, size: 2112, align: 8, elements: !455)
!455 = !{!42, !456, !461, !465, !738, !747, !768, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !790, !794, !795, !796, !797, !801, !802, !803, !804, !805, !806, !807}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !24, line: 5, baseType: !457, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !64}
!460 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!388, !64}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !24, line: 5, baseType: !466, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !64}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !470)
!470 = !{!471, !386}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !24, size: 832, align: 8, elements: !474)
!474 = !{!42, !475, !515, !516, !517, !518, !519, !520, !521, !731, !732, !733, !737}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !24, line: 5, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !64}
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !480)
!480 = !{!481, !386}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 512, align: 8, elements: !484)
!484 = !{!42, !485, !489, !493, !498, !499, !503, !504}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !24, line: 5, baseType: !486, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!450, !64, !14}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !490, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!450, !64, !425}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !24, line: 5, baseType: !494, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!450, !64, !497}
!497 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !24, line: 5, baseType: !486, size: 64, align: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !500, size: 64, align: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!450, !64, !21}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!65, !64, !508}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !6, line: 5, size: 128, align: 8, elements: !509)
!509 = !{!510, !386}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !24, size: 128, align: 8, elements: !513)
!513 = !{!42, !514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !522, size: 64, align: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !64}
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !6, line: 5, size: 128, align: 8, elements: !526)
!526 = !{!527, !386}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !24, size: 640, align: 8, elements: !530)
!530 = !{!42, !414, !419, !420, !421, !531, !532, !533, !729, !730}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !534, size: 64, align: 64, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !64}
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !538)
!538 = !{!539, !386}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !24, size: 1216, align: 8, elements: !542)
!542 = !{!42, !543, !544, !558, !559, !580, !581, !582, !600, !601, !602, !603, !604, !605, !606, !607, !611, !687, !728}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !24, line: 5, baseType: !545, size: 64, align: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !64}
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !549)
!549 = !{!550, !386}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 320, align: 8, elements: !553)
!553 = !{!42, !554, !555, !556, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !490, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !500, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !24, line: 5, baseType: !560, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !64}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !6, line: 5, size: 128, align: 8, elements: !564)
!564 = !{!565, !386}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 256, align: 8, elements: !568)
!568 = !{!42, !569, !578, !579}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !570, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !64, !21}
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !6, line: 5, size: 192, align: 8, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !6, line: 5, baseType: !537, size: 128, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !6, line: 5, baseType: !63, size: 8, align: 8, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !6, line: 5, baseType: !63, size: 8, align: 8, offset: 136)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !24, line: 5, baseType: !583, size: 64, align: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!586, !64}
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !587)
!587 = !{!588, !386}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 320, align: 8, elements: !591)
!591 = !{!42, !592, !596, !556, !557}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !593, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!388, !64, !425}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !597, size: 64, align: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!388, !64, !21}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !608, size: 64, align: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!65, !64, !537}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !24, line: 5, baseType: !612, size: 64, align: 64, offset: 1024)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !64}
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !616)
!616 = !{!617, !386}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 320, align: 8, elements: !620)
!620 = !{!42, !621, !683, !556, !557}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !622, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !64, !425}
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !626)
!626 = !{!627, !386}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !24, size: 768, align: 8, elements: !630)
!630 = !{!42, !414, !419, !420, !631, !673, !674, !675, !676, !677, !678, !682}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !24, line: 5, baseType: !632, size: 64, align: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!635, !64}
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !6, line: 5, size: 128, align: 8, elements: !636)
!636 = !{!637, !386}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 320, align: 8, elements: !640)
!640 = !{!42, !641, !669, !556, !557}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !24, line: 5, baseType: !642, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !64, !425}
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !646)
!646 = !{!647, !386}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !24, size: 960, align: 8, elements: !650)
!650 = !{!42, !414, !419, !651, !517, !652, !653, !654, !655, !656, !657, !658, !659, !660, !664}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !661, size: 64, align: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!65, !64, !645}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !64}
!668 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !670, size: 64, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!645, !64, !21}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !679, size: 64, align: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!65, !64, !625}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !684, size: 64, align: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!625, !64, !21}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !24, line: 5, baseType: !688, size: 64, align: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !64}
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !6, line: 5, size: 128, align: 8, elements: !692)
!692 = !{!693, !386}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !24, size: 384, align: 8, elements: !696)
!696 = !{!42, !697, !718, !722, !726, !727}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !24, line: 5, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!701, !64, !525}
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !6, line: 5, size: 960, align: 8, elements: !702)
!702 = !{!703, !710, !711, !712, !713, !714, !715, !716, !717}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !6, line: 5, baseType: !704, size: 192, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !6, line: 5, size: 192, align: 8, elements: !705)
!705 = !{!706, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !6, line: 1, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !6, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !6, line: 1, baseType: !21, size: 64, align: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !6, line: 5, baseType: !106, size: 192, align: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !6, line: 5, baseType: !14, size: 128, align: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !6, line: 5, baseType: !14, size: 128, align: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !6, line: 5, baseType: !21, size: 64, align: 64, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !24, line: 5, baseType: !719, size: 64, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!701, !64, !704}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !723, size: 64, align: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!701, !64, !21}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !534, size: 64, align: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !734, size: 64, align: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!65, !64, !469}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !24, line: 5, baseType: !739, size: 64, align: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !64}
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !6, line: 5, size: 192, align: 8, elements: !743)
!743 = !{!202, !744, !353, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !6, line: 5, baseType: !64, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !6, line: 5, baseType: !746, size: 64, align: 64, offset: 128)
!746 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !24, line: 5, baseType: !748, size: 64, align: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !64}
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !752)
!752 = !{!753, !386}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !24, size: 768, align: 8, elements: !756)
!756 = !{!42, !414, !419, !420, !421, !757, !674, !762, !763, !677, !764, !682}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !24, line: 5, baseType: !758, size: 64, align: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !64}
!761 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !522, size: 64, align: 64, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !534, size: 64, align: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !765, size: 64, align: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!65, !64, !751}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !24, line: 5, baseType: !769, size: 64, align: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!408, !64}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !24, line: 5, baseType: !786, size: 64, align: 64, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !64}
!789 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !24, line: 5, baseType: !791, size: 64, align: 64, offset: 1344)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!450, !64}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !24, line: 5, baseType: !791, size: 64, align: 64, offset: 1408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 1472)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 1536)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !24, line: 5, baseType: !798, size: 64, align: 64, offset: 1600)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!497, !64}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 1664)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !522, size: 64, align: 64, offset: 1728)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !534, size: 64, align: 64, offset: 1792)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 1856)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 1920)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 1984)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 2048)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 5, baseType: !810, size: 64, align: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!742, !64, !450}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !24, line: 5, baseType: !814, size: 64, align: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !64}
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !6, line: 5, size: 192, align: 8, elements: !818)
!818 = !{!819, !708, !709}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !6, line: 1, baseType: !18, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !24, line: 5, baseType: !821, size: 64, align: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!63, !64, !450}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !24, line: 5, baseType: !810, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !24, line: 5, baseType: !810, size: 64, align: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !24, line: 5, baseType: !830, size: 64, align: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !64}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !24, size: 384, align: 8, elements: !835)
!835 = !{!836, !837, !838, !853, !872, !978, !990}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !24, line: 5, baseType: !201, align: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !24, line: 5, baseType: !746, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !24, line: 5, baseType: !839, size: 64, align: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !849}
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !24, size: 64, align: 8, elements: !847)
!847 = !{!836, !848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !24, line: 5, baseType: !21, size: 64, align: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !24, size: 192, align: 8, elements: !850)
!850 = !{!836, !851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !24, line: 5, baseType: !440, size: 128, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !24, line: 5, baseType: !19, size: 8, align: 8, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !24, line: 5, baseType: !854, size: 64, align: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !856)
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!861, !868}
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !24, size: 320, align: 8, elements: !862)
!862 = !{!863, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !864, size: 192, align: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !24, size: 192, align: 8, elements: !865)
!865 = !{!836, !866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !24, line: 5, baseType: !23, size: 192, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !94, size: 128, align: 64, offset: 192)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !24, size: 384, align: 8, elements: !869)
!869 = !{!836, !851, !870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !24, line: 5, baseType: !23, size: 192, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !24, line: 5, baseType: !19, size: 8, align: 8, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !24, line: 5, baseType: !873, size: 64, align: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !877, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !887}
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !24, size: 192, align: 8, elements: !881)
!881 = !{!882, !886}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !883, size: 8, align: 8)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !24, size: 8, align: 1, elements: !884)
!884 = !{!836, !885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !24, line: 5, baseType: !19, size: 8, align: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !94, size: 128, align: 64, offset: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !24, size: 576, align: 8, elements: !888)
!888 = !{!836, !851, !870, !871, !889, !977}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !24, line: 5, baseType: !890, size: 128, align: 64, offset: 384)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !24, size: 128, align: 8, elements: !891)
!891 = !{!892, !976}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !24, size: 192, align: 8, elements: !895)
!895 = !{!42, !896, !972}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !24, line: 5, baseType: !897, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !64, !418}
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !24, size: 256, align: 8, elements: !901)
!901 = !{!902, !93}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 5, baseType: !903, size: 128, align: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !6, line: 5, size: 128, align: 8, elements: !904)
!904 = !{!905, !386}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !24, size: 512, align: 8, elements: !908)
!908 = !{!42, !909, !916, !920, !924, !925, !967, !971}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !24, line: 5, baseType: !910, size: 64, align: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !64, !742}
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !6, line: 6, size: 128, align: 8, elements: !914)
!914 = !{!915, !386}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !6, line: 1, baseType: !43, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !24, line: 5, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!63, !64, !913}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !24, line: 5, baseType: !921, size: 64, align: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!63, !64, !742}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !24, line: 5, baseType: !739, size: 64, align: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !24, line: 5, baseType: !926, size: 64, align: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !64}
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !6, line: 5, size: 128, align: 8, elements: !930)
!930 = !{!931, !386}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !6, line: 5, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !24, size: 2240, align: 8, elements: !934)
!934 = !{!42, !456, !461, !465, !738, !747, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !24, line: 5, baseType: !791, size: 64, align: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !24, line: 5, baseType: !769, size: 64, align: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !24, line: 5, baseType: !415, size: 64, align: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 5, baseType: !231, size: 64, align: 64, offset: 832)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 896)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 960)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1088)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !24, line: 5, baseType: !178, size: 64, align: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 1280)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !24, line: 5, baseType: !786, size: 64, align: 64, offset: 1344)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !24, line: 5, baseType: !791, size: 64, align: 64, offset: 1408)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !24, line: 5, baseType: !791, size: 64, align: 64, offset: 1472)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !24, line: 5, baseType: !462, size: 64, align: 64, offset: 1536)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 5, baseType: !422, size: 64, align: 64, offset: 1600)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !24, line: 5, baseType: !798, size: 64, align: 64, offset: 1664)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !24, line: 5, baseType: !64, size: 64, align: 64, offset: 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 5, baseType: !522, size: 64, align: 64, offset: 1792)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !24, line: 5, baseType: !534, size: 64, align: 64, offset: 1856)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !24, line: 5, baseType: !505, size: 64, align: 64, offset: 1920)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !24, line: 5, baseType: !447, size: 64, align: 64, offset: 1984)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !24, line: 5, baseType: !665, size: 64, align: 64, offset: 2048)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !24, line: 5, baseType: !102, size: 64, align: 64, offset: 2112)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !24, line: 5, baseType: !964, size: 64, align: 64, offset: 2176)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!903, !64}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ValueOf", file: !24, line: 5, baseType: !968, size: 64, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!742, !64, !913}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Zero", file: !24, line: 5, baseType: !739, size: 64, align: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByNumber", file: !24, line: 5, baseType: !973, size: 64, align: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!900, !64, !418, !497}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", file: !24, line: 5, baseType: !21, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Merge", file: !24, line: 5, baseType: !979, size: 64, align: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !981)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !6, line: 5, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!883, !986}
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,Message}", file: !24, size: 256, align: 8, elements: !987)
!987 = !{!836, !988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !24, line: 5, baseType: !440, size: 128, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Destination", file: !24, line: 5, baseType: !440, size: 128, align: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "CheckInitialized", file: !24, line: 5, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !6, line: 5, size: 64, align: 8, elements: !993)
!993 = !{!994}
