; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22extstub\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22timestamp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes/timestamp\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes/timestamp\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./69.go", directory: "/home/ming/go/src/chaincode_repo/github/69")
!5 = !{!6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = distinct !DISubprogram(name: "command_x2dline_x2darguments.privateHistoryArrayAppendStrategy..eq", scope: null, file: !8, line: 1, type: !24, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!24 = !DISubroutineType(types: !25)
!25 = !{!13, !26, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "void")
!28 = !{}
!29 = !DILocalVariable(name: "key1", arg: 1, scope: !23, file: !8, line: 1, type: !26)
!30 = !DILocation(line: 0, scope: !23)
!31 = !DILocalVariable(name: "key2", arg: 2, scope: !23, file: !8, line: 1, type: !26)
!32 = !DILocalVariable(name: "$ret75", scope: !23, file: !8, line: 1, type: !13)
!33 = !DILocation(line: 1, column: 1, scope: !23)
!34 = distinct !DISubprogram(name: "command-line-arguments.privateHistoryArrayAppendStrategy.Append", linkageName: "command_x2dline_x2darguments.privateHistoryArrayAppendStrategy.Append", scope: null, file: !35, line: 67, type: !36, scopeLine: 67, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!35 = !DIFile(filename: "69.go", directory: ".")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !96, !96, !101, !67, !67, !135, !13}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !39)
!39 = !{!40, !95}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !43)
!43 = !{!44, !91}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !47)
!47 = !{!48, !50, !51, !53, !54, !55, !56, !57, !63, !65, !72, !90}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !52, size: 32, align: 32, offset: 128)
!52 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !64, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !66, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !79, size: 192, align: 64, offset: 128)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !80)
!80 = !{!81, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !84)
!84 = !{!76, !77, !85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !71, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!67, !26}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.privateHistoryArrayAppendStrategy", file: !35, line: 34, size: 256, align: 8, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "keysPrefix", file: !35, line: 35, baseType: !67, size: 128, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "keysSuffix", file: !35, line: 36, baseType: !67, size: 128, align: 64, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !35, line: 21, size: 128, align: 8, elements: !102)
!102 = !{!103, !401}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 21, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void).google.golang.org/protobuf/internal/impl.extensionMap,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{.google.golang.org/protobuf/internal/impl.extensionMap,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !106)
!106 = !{!107, !108, !119, !123, !127, !138, !146, !147, !148, !149, !166, !173, !1421, !1425, !1452, !1456, !1457, !1461, !1462, !1466, !1482, !1497, !1501, !1505, !1509, !1510, !1514, !1515, !1519, !1526, !1527, !1534, !1543, !1544, !1548, !1552, !1553, !1554, !1555}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 21, baseType: !45, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 21, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !26, !67, !116}
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 21, baseType: !67, size: 128, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 21, baseType: !38, size: 128, align: 64, offset: 128)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !117)
!117 = !{!118, !88, !89}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !66, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 21, baseType: !120, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!38, !26, !67, !67}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 21, baseType: !124, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!38, !26, !67}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 21, baseType: !128, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !26}
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !132)
!132 = !{!133, !88, !89}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !136)
!136 = !{!137, !88, !89}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !64, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 21, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !26}
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !135, size: 192, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !38, size: 128, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 21, baseType: !139, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 21, baseType: !92, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 21, baseType: !139, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 21, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !26}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !155)
!155 = !{!156, !157, !158, !159, !161, !162, !163, !164, !165}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !71, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !160, size: 16, align: 16, offset: 80)
!160 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !52, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 21, baseType: !167, size: 64, align: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !26}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !171)
!171 = !{!114, !172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 21, baseType: !116, size: 192, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 21, baseType: !174, size: 64, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !26, !67}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !178)
!178 = !{!179, !115}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 21, baseType: !180, size: 128, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !35, line: 21, size: 128, align: 8, elements: !181)
!181 = !{!182, !401}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 21, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !185)
!185 = !{!107, !186, !190, !194}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 21, baseType: !187, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!38, !26}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 21, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!13, !26}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 21, baseType: !195, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !26}
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !199)
!199 = !{!200, !1420}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 21, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !35, line: 21, size: 704, align: 8, elements: !203)
!203 = !{!204, !205, !206, !1415, !1416, !1418, !1419}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !35, line: 21, baseType: !67, size: 128, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !35, line: 21, baseType: !135, size: 192, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !35, line: 21, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !35, line: 20, size: 448, align: 8, elements: !209)
!209 = !{!210, !1410, !1411, !1412, !1414}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !35, line: 20, baseType: !211, size: 64, align: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !35, line: 20, size: 64, align: 8, elements: !212)
!212 = !{!213, !215, !226, !233}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !35, line: 20, baseType: !214, align: 8)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !35, line: 20, align: 1, elements: !28)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !35, line: 20, baseType: !216, align: 64)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, align: 8, elements: !224)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 20, size: 64, align: 8, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 20, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!27}
!224 = !{!225}
!225 = !DISubrange(count: 0, lowerBound: 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !35, line: 20, baseType: !227, align: 32)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, align: 4, elements: !224)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !35, line: 20, size: 64, align: 4, elements: !229)
!229 = !{!230, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !35, line: 20, baseType: !231, size: 32, align: 32)
!231 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !35, line: 20, baseType: !52, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !35, line: 20, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !35, line: 20, size: 2624, align: 8, elements: !236)
!236 = !{!237, !402, !1202, !1210, !1215, !1216, !1217, !1312}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !35, line: 20, baseType: !238, size: 128, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !35, line: 18, size: 128, align: 8, elements: !239)
!239 = !{!240, !401}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 18, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !243)
!243 = !{!244, !245, !249, !253, !254, !259, !260, !261, !265, !286, !287, !291, !299, !310, !311, !315, !316, !317, !322, !323, !372, !380, !381, !382, !383, !384, !385, !386, !387, !391, !392, !396, !397}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 18, baseType: !45, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!71, !26}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 18, baseType: !250, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!13, !26, !238}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 18, baseType: !255, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !26}
!258 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 18, baseType: !191, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 18, baseType: !250, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 18, baseType: !262, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!238, !26}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 18, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !26, !71}
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !35, line: 18, size: 832, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274, !279, !280, !285}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !35, line: 18, baseType: !67, size: 128, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !35, line: 18, baseType: !67, size: 128, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !35, line: 18, baseType: !238, size: 128, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !35, line: 18, baseType: !275, size: 128, align: 64, offset: 384)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !35, line: 18, size: 128, align: 8, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !35, line: 1, baseType: !64, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !35, line: 18, baseType: !49, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !35, line: 18, baseType: !281, size: 192, align: 64, offset: 576)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !282)
!282 = !{!283, !88, !89}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !35, line: 18, baseType: !13, size: 8, align: 8, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 18, baseType: !288, size: 64, align: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!269, !26, !281}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 18, baseType: !292, size: 64, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !26, !67}
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !269, size: 832, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !13, size: 8, align: 8, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 18, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!295, !26, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 18, size: 64, align: 8, elements: !305)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 18, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!13, !67}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 18, baseType: !250, size: 64, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 18, baseType: !312, size: 64, align: 64, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!238, !26, !71}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 18, baseType: !191, size: 64, align: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 18, baseType: !262, size: 64, align: 64, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 18, baseType: !318, size: 64, align: 64, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !26}
!321 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 1152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 18, baseType: !324, size: 64, align: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !26, !71}
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !35, line: 18, size: 640, align: 8, elements: !328)
!328 = !{!271, !272, !273, !329, !371}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !35, line: 18, baseType: !330, size: 192, align: 64, offset: 384)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !35, line: 18, size: 192, align: 8, elements: !331)
!331 = !{!332, !368, !369}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !35, line: 18, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !35, line: 18, size: 512, align: 8, elements: !335)
!335 = !{!336, !337, !338, !339, !341, !342, !343, !344, !349, !350, !351, !367}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !35, line: 18, baseType: !49, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !35, line: 18, baseType: !49, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !35, line: 18, baseType: !52, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !35, line: 18, baseType: !340, size: 8, align: 8, offset: 160)
!340 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !35, line: 18, baseType: !16, size: 8, align: 8, offset: 168)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !35, line: 18, baseType: !16, size: 8, align: 8, offset: 176)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !35, line: 18, baseType: !16, size: 8, align: 8, offset: 184)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !35, line: 18, baseType: !345, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 18, size: 64, align: 8, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 18, baseType: !62, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !35, line: 18, baseType: !64, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !35, line: 18, baseType: !66, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !35, line: 18, baseType: !352, size: 64, align: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !35, line: 18, size: 320, align: 8, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !35, line: 18, baseType: !66, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !35, line: 18, baseType: !66, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !35, line: 18, baseType: !358, size: 192, align: 64, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !359)
!359 = !{!360, !88, !89}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !35, line: 18, size: 320, align: 8, elements: !363)
!363 = !{!355, !356, !364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !35, line: 18, baseType: !26, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !35, line: 18, baseType: !26, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !35, line: 18, baseType: !26, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !35, line: 18, baseType: !26, size: 64, align: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !35, line: 18, baseType: !26, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !35, line: 18, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !35, line: 18, baseType: !71, size: 64, align: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 18, baseType: !373, size: 64, align: 64, offset: 1280)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !26, !67}
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !327, size: 640, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !13, size: 8, align: 8, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 18, baseType: !92, size: 64, align: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 18, baseType: !246, size: 64, align: 64, offset: 1600)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 18, baseType: !312, size: 64, align: 64, offset: 1664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 18, baseType: !92, size: 64, align: 64, offset: 1728)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 18, baseType: !388, size: 64, align: 64, offset: 1792)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!49, !26}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 18, baseType: !92, size: 64, align: 64, offset: 1856)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 18, baseType: !393, size: 64, align: 64, offset: 1920)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!333, !26}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 18, baseType: !92, size: 64, align: 64, offset: 1984)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 18, baseType: !398, size: 64, align: 64, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!352, !26}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !35, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !35, line: 20, baseType: !403, size: 128, align: 64, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !404)
!404 = !{!405, !401}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !408)
!408 = !{!409, !410, !1128, !1132, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1177, !1178, !1179, !1180, !1181, !1185, !1199, !1200, !1201}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 20, baseType: !45, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 20, baseType: !411, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !26}
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !415)
!415 = !{!416, !401}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !419)
!419 = !{!409, !420, !1124, !572, !573}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !421, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !26, !441}
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !425)
!425 = !{!426, !401}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !429)
!429 = !{!409, !430, !435, !436, !437, !442, !1058, !549, !745, !1059, !1063, !1081, !753, !1102}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !26}
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !35, line: 20, size: 128, align: 8, elements: !276)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !26}
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !35, line: 20, size: 128, align: 8, elements: !276)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !443, size: 64, align: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !26}
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !35, line: 20, size: 128, align: 8, elements: !447)
!447 = !{!448, !401}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !451)
!451 = !{!409, !452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 20, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !26}
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !35, line: 20, size: 128, align: 8, elements: !457)
!457 = !{!458, !401}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !461)
!461 = !{!409, !462, !824, !825, !829, !836, !840, !841, !842, !843, !844, !845, !1022, !1033, !1037, !1041, !1054}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 20, baseType: !463, size: 64, align: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!27, !26, !466}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !467)
!467 = !{!468, !401}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !471)
!471 = !{!409, !472, !477, !481, !754, !763, !784, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !806, !810, !811, !812, !813, !817, !818, !819, !820, !821, !822, !823}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 20, baseType: !473, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !26}
!476 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!403, !26}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 20, baseType: !482, size: 64, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !26}
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !486)
!486 = !{!487, !401}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !490)
!490 = !{!409, !491, !531, !532, !533, !534, !535, !536, !537, !747, !748, !749, !753}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 20, baseType: !492, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !26}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !496)
!496 = !{!497, !401}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !500)
!500 = !{!409, !501, !505, !509, !514, !515, !519, !520}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 20, baseType: !502, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!466, !26, !67}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !506, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!466, !26, !441}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 20, baseType: !510, size: 64, align: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!466, !26, !513}
!513 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 20, baseType: !502, size: 64, align: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !516, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!466, !26, !71}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!27, !26, !524}
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !35, line: 20, size: 128, align: 8, elements: !525)
!525 = !{!526, !401}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !529)
!529 = !{!409, !530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !538, size: 64, align: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !26}
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !35, line: 20, size: 128, align: 8, elements: !542)
!542 = !{!543, !401}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !546)
!546 = !{!409, !430, !435, !436, !437, !547, !548, !549, !745, !746}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !550, size: 64, align: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !26}
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !554)
!554 = !{!555, !401}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !558)
!558 = !{!409, !559, !560, !574, !575, !596, !597, !598, !616, !617, !618, !619, !620, !621, !622, !623, !627, !703, !744}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 20, baseType: !561, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !26}
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !565)
!565 = !{!566, !401}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !569)
!569 = !{!409, !570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !506, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !516, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 20, baseType: !576, size: 64, align: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !26}
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !35, line: 20, size: 128, align: 8, elements: !580)
!580 = !{!581, !401}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !584)
!584 = !{!409, !585, !594, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !586, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!589, !26, !71}
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !35, line: 20, size: 192, align: 8, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !35, line: 20, baseType: !553, size: 128, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !35, line: 20, baseType: !13, size: 8, align: 8, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !35, line: 20, baseType: !13, size: 8, align: 8, offset: 136)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 20, baseType: !599, size: 64, align: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !26}
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !603)
!603 = !{!604, !401}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !607)
!607 = !{!409, !608, !612, !572, !573}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !609, size: 64, align: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!403, !26, !441}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !613, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!403, !26, !71}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 20, baseType: !92, size: 64, align: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !624, size: 64, align: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!27, !26, !553}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 20, baseType: !628, size: 64, align: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!631, !26}
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !632)
!632 = !{!633, !401}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !636)
!636 = !{!409, !637, !699, !572, !573}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !638, size: 64, align: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !26, !441}
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !642)
!642 = !{!643, !401}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !646)
!646 = !{!409, !430, !435, !436, !647, !689, !690, !691, !692, !693, !694, !698}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 20, baseType: !648, size: 64, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !26}
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !35, line: 20, size: 128, align: 8, elements: !652)
!652 = !{!653, !401}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !656)
!656 = !{!409, !657, !685, !572, !573}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 20, baseType: !658, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!661, !26, !441}
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !662)
!662 = !{!663, !401}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !666)
!666 = !{!409, !430, !435, !667, !533, !668, !669, !670, !671, !672, !673, !674, !675, !676, !680}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !677, size: 64, align: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!27, !26, !661}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !26}
!684 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !686, size: 64, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!661, !26, !71}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !695, size: 64, align: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!27, !26, !641}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !700, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!641, !26, !71}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 20, baseType: !704, size: 64, align: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !26}
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !35, line: 20, size: 128, align: 8, elements: !708)
!708 = !{!709, !401}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 384, align: 8, elements: !712)
!712 = !{!409, !713, !734, !738, !742, !743}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !10, line: 20, baseType: !714, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !26, !541}
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !35, line: 20, size: 960, align: 8, elements: !718)
!718 = !{!719, !726, !727, !728, !729, !730, !731, !732, !733}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !35, line: 20, baseType: !720, size: 192, align: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !35, line: 20, size: 192, align: 8, elements: !721)
!721 = !{!722, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !35, line: 20, baseType: !71, size: 64, align: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !35, line: 20, baseType: !71, size: 64, align: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !35, line: 20, baseType: !71, size: 64, align: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !35, line: 20, baseType: !71, size: 64, align: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !35, line: 20, baseType: !116, size: 192, align: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !35, line: 20, baseType: !67, size: 128, align: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !35, line: 20, baseType: !67, size: 128, align: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !35, line: 20, baseType: !71, size: 64, align: 64, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !10, line: 20, baseType: !735, size: 64, align: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!717, !26, !720}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !739, size: 64, align: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!717, !26, !71}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !550, size: 64, align: 64, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !750, size: 64, align: 64, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!27, !26, !485}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !10, line: 20, baseType: !755, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !26}
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !35, line: 20, size: 192, align: 8, elements: !759)
!759 = !{!215, !760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !35, line: 20, baseType: !26, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !35, line: 20, baseType: !26, size: 64, align: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !35, line: 20, baseType: !22, size: 64, align: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !10, line: 20, baseType: !764, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !26}
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !768)
!768 = !{!769, !401}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !772)
!772 = !{!409, !430, !435, !436, !437, !773, !690, !778, !779, !693, !780, !698}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 20, baseType: !774, size: 64, align: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !26}
!777 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !538, size: 64, align: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !550, size: 64, align: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !781, size: 64, align: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!27, !26, !767}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 20, baseType: !785, size: 64, align: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!424, !26}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 20, baseType: !92, size: 64, align: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 20, baseType: !802, size: 64, align: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!805, !26}
!805 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 20, baseType: !807, size: 64, align: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!466, !26}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 20, baseType: !807, size: 64, align: 64, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 1472)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 1536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 20, baseType: !814, size: 64, align: 64, offset: 1600)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!513, !26}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 1664)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !538, size: 64, align: 64, offset: 1728)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !550, size: 64, align: 64, offset: 1792)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 1856)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 1920)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 1984)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !10, line: 20, baseType: !92, size: 64, align: 64, offset: 2048)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 20, baseType: !826, size: 64, align: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!758, !26, !466}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !10, line: 20, baseType: !830, size: 64, align: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !26}
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !35, line: 20, size: 192, align: 8, elements: !834)
!834 = !{!835, !724, !725}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !64, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !10, line: 20, baseType: !837, size: 64, align: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!13, !26, !466}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !10, line: 20, baseType: !826, size: 64, align: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !10, line: 20, baseType: !826, size: 64, align: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !10, line: 20, baseType: !846, size: 64, align: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !26}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !10, size: 384, align: 8, elements: !851)
!851 = !{!852, !853, !854, !869, !887, !994, !1006}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !10, line: 20, baseType: !214, align: 8)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 20, baseType: !22, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 20, baseType: !855, size: 64, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 20, size: 64, align: 8, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 20, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !865}
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !10, size: 64, align: 8, elements: !863)
!863 = !{!852, !864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 20, baseType: !71, size: 64, align: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !10, size: 192, align: 8, elements: !866)
!866 = !{!852, !867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 20, baseType: !456, size: 128, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 20, baseType: !16, size: 8, align: 8, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !10, line: 20, baseType: !870, size: 64, align: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 20, size: 64, align: 8, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 20, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !883}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !10, size: 320, align: 8, elements: !878)
!878 = !{!879, !145}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !880, size: 192, align: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !10, size: 192, align: 8, elements: !881)
!881 = !{!852, !882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 20, baseType: !135, size: 192, align: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !10, size: 384, align: 8, elements: !884)
!884 = !{!852, !867, !885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 20, baseType: !135, size: 192, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 20, baseType: !16, size: 8, align: 8, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !10, line: 20, baseType: !888, size: 64, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 20, size: 64, align: 8, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 20, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !902}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !10, size: 192, align: 8, elements: !896)
!896 = !{!897, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !898, size: 8, align: 8)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !10, size: 8, align: 1, elements: !899)
!899 = !{!852, !900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 20, baseType: !16, size: 8, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !38, size: 128, align: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !10, size: 576, align: 8, elements: !903)
!903 = !{!852, !867, !885, !886, !904, !993}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !10, line: 20, baseType: !905, size: 128, align: 64, offset: 384)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !10, size: 128, align: 8, elements: !906)
!906 = !{!907, !992}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 20, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !10, size: 192, align: 8, elements: !910)
!910 = !{!409, !911, !988}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !10, line: 20, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!915, !26, !434}
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !10, size: 256, align: 8, elements: !916)
!916 = !{!917, !987}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 20, baseType: !918, size: 128, align: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !35, line: 20, size: 128, align: 8, elements: !919)
!919 = !{!920, !401}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !10, size: 512, align: 8, elements: !923)
!923 = !{!409, !924, !931, !935, !939, !940, !982, !986}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !10, line: 20, baseType: !925, size: 64, align: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !26, !758}
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !35, line: 18, size: 128, align: 8, elements: !929)
!929 = !{!930, !401}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 1, baseType: !45, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !10, line: 20, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!13, !26, !928}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !10, line: 20, baseType: !936, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!13, !26, !758}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 20, baseType: !755, size: 64, align: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !10, line: 20, baseType: !941, size: 64, align: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !26}
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !35, line: 20, size: 128, align: 8, elements: !945)
!945 = !{!946, !401}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 20, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !10, size: 2240, align: 8, elements: !949)
!949 = !{!409, !472, !477, !481, !754, !763, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 20, baseType: !807, size: 64, align: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 20, baseType: !785, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 20, baseType: !431, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 20, baseType: !246, size: 64, align: 64, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 20, baseType: !191, size: 64, align: 64, offset: 1216)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 20, baseType: !92, size: 64, align: 64, offset: 1280)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 20, baseType: !802, size: 64, align: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 20, baseType: !807, size: 64, align: 64, offset: 1408)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 20, baseType: !807, size: 64, align: 64, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 20, baseType: !478, size: 64, align: 64, offset: 1536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 20, baseType: !438, size: 64, align: 64, offset: 1600)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 20, baseType: !814, size: 64, align: 64, offset: 1664)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 20, baseType: !26, size: 64, align: 64, offset: 1728)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 20, baseType: !538, size: 64, align: 64, offset: 1792)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 20, baseType: !550, size: 64, align: 64, offset: 1856)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 20, baseType: !521, size: 64, align: 64, offset: 1920)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 20, baseType: !463, size: 64, align: 64, offset: 1984)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 20, baseType: !681, size: 64, align: 64, offset: 2048)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !10, line: 20, baseType: !92, size: 64, align: 64, offset: 2112)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 20, baseType: !979, size: 64, align: 64, offset: 2176)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!918, !26}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ValueOf", file: !10, line: 20, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!758, !26, !928}
