; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22chaincode\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22ptypes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./1.go", directory: "/home/ming/go/src/chainCode/github")
!5 = !{!6, !23}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !25, line: 7, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "1.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !25, line: 7, size: 2624, align: 4, elements: !28)
!28 = !{!29, !33, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !25, line: 7, baseType: !30, size: 512, align: 8)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 1, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !25, line: 7, baseType: !34, size: 2048, align: 8, offset: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 1, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 256, lowerBound: 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !25, line: 7, baseType: !38, size: 32, align: 32, offset: 2560)
!38 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 2592)
!40 = distinct !DISubprogram(name: "command_x2dline_x2darguments.DesignData..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !43, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !{}
!46 = !DILocalVariable(name: "key1", arg: 1, scope: !40, file: !8, line: 1, type: !43)
!47 = !DILocation(line: 0, scope: !40)
!48 = !DILocalVariable(name: "key2", arg: 2, scope: !40, file: !8, line: 1, type: !43)
!49 = !DILocalVariable(name: "$ret68", scope: !40, file: !8, line: 1, type: !13)
!50 = !DILocation(line: 1, column: 1, scope: !40)
!51 = distinct !DISubprogram(name: "command_x2dline_x2darguments.Order..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!52 = !DILocalVariable(name: "key1", arg: 1, scope: !51, file: !8, line: 1, type: !43)
!53 = !DILocation(line: 0, scope: !51)
!54 = !DILocalVariable(name: "key2", arg: 2, scope: !51, file: !8, line: 1, type: !43)
!55 = !DILocalVariable(name: "$ret69", scope: !51, file: !8, line: 1, type: !13)
!56 = !DILocation(line: 1, column: 1, scope: !51)
!57 = distinct !DISubprogram(name: "command_x2dline_x2darguments.HistoryQueryResult..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!58 = !DILocalVariable(name: "key1", arg: 1, scope: !57, file: !8, line: 1, type: !43)
!59 = !DILocation(line: 0, scope: !57)
!60 = !DILocalVariable(name: "key2", arg: 2, scope: !57, file: !8, line: 1, type: !43)
!61 = !DILocalVariable(name: "$ret70", scope: !57, file: !8, line: 1, type: !13)
!62 = !DILocation(line: 1, column: 1, scope: !57)
!63 = distinct !DISubprogram(name: "command_x2dline_x2darguments.SmartContract..eq", scope: null, file: !8, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!64 = !DILocalVariable(name: "key1", arg: 1, scope: !63, file: !8, line: 1, type: !43)
!65 = !DILocation(line: 0, scope: !63)
!66 = !DILocalVariable(name: "key2", arg: 2, scope: !63, file: !8, line: 1, type: !43)
!67 = !DILocalVariable(name: "$ret71", scope: !63, file: !8, line: 1, type: !13)
!68 = !DILocation(line: 1, column: 1, scope: !63)
!69 = distinct !DISubprogram(name: "command-line-arguments.SmartContract.AcceptRejectOrder", linkageName: "command_x2dline_x2darguments.SmartContract.AcceptRejectOrder", scope: null, file: !25, line: 573, type: !70, scopeLine: 573, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !45)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !130, !130, !1834}
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !73)
!73 = !{!74, !129}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !77)
!77 = !{!78, !125}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !81)
!81 = !{!82, !84, !85, !87, !88, !89, !90, !91, !97, !99, !106, !124}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !83, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !86, size: 32, align: 32, offset: 128)
!86 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !100, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !98, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !100, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !113, size: 192, align: 64, offset: 128)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !114)
!114 = !{!115, !122, !123}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !118)
!118 = !{!110, !111, !119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !105, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!101, !43}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !25, line: 137, size: 1152, align: 8, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !25, line: 138, baseType: !134, size: 1152, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !25, line: 18, size: 1152, align: 8, elements: !135)
!135 = !{!136, !137, !153, !158, !159, !160}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 18, baseType: !101, size: 128, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !25, line: 18, baseType: !138, size: 512, align: 64, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !25, line: 18, size: 512, align: 8, elements: !139)
!139 = !{!140, !141, !142, !148, !152}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !25, line: 18, baseType: !101, size: 128, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !25, line: 18, baseType: !143, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !25, line: 18, size: 384, align: 8, elements: !145)
!145 = !{!136, !146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !25, line: 18, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !25, line: 18, size: 256, align: 8, elements: !151)
!151 = !{!136, !146}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !25, line: 18, baseType: !154, size: 128, align: 64, offset: 640)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !25, line: 14, size: 128, align: 8, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !25, line: 1, baseType: !79, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !25, line: 18, baseType: !154, size: 128, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !25, line: 18, baseType: !154, size: 128, align: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !25, line: 18, baseType: !161, size: 128, align: 64, offset: 1024)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !25, line: 18, size: 128, align: 8, elements: !162)
!162 = !{!163, !157}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 18, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !10, size: 192, align: 8, elements: !166)
!166 = !{!167, !168, !393}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 18, baseType: !79, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !10, line: 18, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!44, !43, !172}
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !25, line: 18, size: 128, align: 8, elements: !173)
!173 = !{!174, !157}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 18, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !10, size: 384, align: 8, elements: !177)
!177 = !{!167, !178, !182, !191, !199, !200}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !10, line: 18, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!72, !43, !101, !101}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !10, line: 18, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !43, !101}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !10, size: 320, align: 8, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !10, line: 18, baseType: !101, size: 128, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !10, line: 18, baseType: !13, size: 8, align: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 18, baseType: !72, size: 128, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !10, line: 18, baseType: !192, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !43}
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !101, size: 128, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !72, size: 128, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !10, line: 18, baseType: !192, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !10, line: 18, baseType: !201, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !43}
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !10, size: 192, align: 8, elements: !205)
!205 = !{!206, !392}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !25, line: 18, size: 10624, align: 8, elements: !209)
!209 = !{!210, !214, !215, !216, !217, !218, !219, !221, !223, !224, !225, !238, !267, !268, !303, !304, !306, !316, !317, !322, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !347, !371, !372, !373, !374, !385, !386, !387, !388, !389, !390, !391}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !25, line: 18, baseType: !211, size: 192, align: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !212)
!212 = !{!213, !122, !123}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !98, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !25, line: 18, baseType: !220, size: 64, align: 64, offset: 1152)
!220 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !25, line: 18, baseType: !222, size: 64, align: 64, offset: 1216)
!222 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !25, line: 18, baseType: !154, size: 128, align: 64, offset: 1280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !25, line: 18, baseType: !105, size: 64, align: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 18, baseType: !226, size: 64, align: 64, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !25, line: 18, size: 256, align: 8, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !25, line: 18, baseType: !13, size: 8, align: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !25, line: 18, baseType: !231, size: 192, align: 64, offset: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !25, line: 18, size: 192, align: 8, elements: !232)
!232 = !{!233, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !25, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !25, line: 1, baseType: !105, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !25, line: 18, baseType: !239, size: 1984, align: 64, offset: 1536)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 18, size: 1984, align: 8, elements: !240)
!240 = !{!241, !245, !246, !247, !248, !249, !250, !251, !252, !253, !266}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !25, line: 18, baseType: !242, size: 192, align: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !243)
!243 = !{!244, !122, !123}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !100, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 1344)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !25, line: 18, baseType: !254, size: 192, align: 64, offset: 1600)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !10, size: 192, align: 8, elements: !255)
!255 = !{!256, !122, !123}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !25, line: 18, size: 320, align: 8, elements: !259)
!259 = !{!260, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 18, baseType: !261, size: 192, align: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !25, line: 18, size: 192, align: 8, elements: !262)
!262 = !{!263, !236, !237}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 18, baseType: !154, size: 128, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !25, line: 18, baseType: !254, size: 192, align: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !25, line: 18, baseType: !239, size: 1984, align: 64, offset: 3520)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !25, line: 18, baseType: !269, size: 192, align: 64, offset: 5504)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !25, line: 10, size: 192, align: 8, elements: !270)
!270 = !{!271, !272, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !25, line: 10, baseType: !22, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !25, line: 10, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !25, line: 10, baseType: !275, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !25, line: 10, size: 832, align: 8, elements: !277)
!277 = !{!278, !279, !288, !299, !300, !301, !302}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 10, baseType: !101, size: 128, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !25, line: 10, baseType: !280, size: 192, align: 64, offset: 128)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !10, size: 192, align: 8, elements: !281)
!281 = !{!282, !122, !123}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !25, line: 10, size: 256, align: 8, elements: !285)
!285 = !{!278, !286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !25, line: 10, baseType: !105, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !25, line: 10, baseType: !289, size: 192, align: 64, offset: 320)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !10, size: 192, align: 8, elements: !290)
!290 = !{!291, !122, !123}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !25, line: 10, size: 128, align: 8, elements: !294)
!294 = !{!295, !296, !297, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !25, line: 10, baseType: !273, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !25, line: 10, baseType: !16, size: 8, align: 8, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 72)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !25, line: 10, baseType: !13, size: 8, align: 8, offset: 80)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !25, line: 10, baseType: !101, size: 128, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !25, line: 10, baseType: !273, size: 64, align: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !25, line: 10, baseType: !273, size: 64, align: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !25, line: 10, baseType: !283, size: 64, align: 64, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !25, line: 18, baseType: !269, size: 192, align: 64, offset: 5696)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !25, line: 18, baseType: !305, size: 64, align: 64, offset: 5888)
!305 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !25, line: 18, baseType: !307, size: 192, align: 64, offset: 5952)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !10, size: 192, align: 8, elements: !308)
!308 = !{!309, !122, !123}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !25, line: 18, size: 448, align: 8, elements: !312)
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !25, line: 18, baseType: !261, size: 192, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !25, line: 18, baseType: !307, size: 192, align: 64, offset: 6144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !25, line: 18, baseType: !318, size: 192, align: 64, offset: 6336)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !10, size: 192, align: 8, elements: !319)
!319 = !{!320, !122, !123}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !25, line: 18, baseType: !323, size: 192, align: 64, offset: 6528)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !10, size: 192, align: 8, elements: !324)
!324 = !{!325, !122, !123}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !25, line: 18, baseType: !318, size: 192, align: 64, offset: 6720)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 6912)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 6920)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !25, line: 18, baseType: !105, size: 64, align: 64, offset: 6976)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 7040)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 7104)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !25, line: 18, baseType: !211, size: 192, align: 64, offset: 7296)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 7488)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 7680)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 7872)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 8064)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !25, line: 18, baseType: !340, size: 192, align: 64, offset: 8256)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !10, size: 192, align: 8, elements: !341)
!341 = !{!342, !122, !123}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !25, line: 18, size: 192, align: 8, elements: !345)
!345 = !{!346, !236, !237}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !25, line: 1, baseType: !98, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !25, line: 18, baseType: !348, size: 192, align: 64, offset: 8448)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !10, size: 192, align: 8, elements: !349)
!349 = !{!350, !122, !123}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !25, line: 18, size: 1152, align: 8, elements: !354)
!354 = !{!355, !356, !357, !364, !365, !366, !367, !368, !369, !370}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !25, line: 18, baseType: !101, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !25, line: 18, baseType: !358, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !25, line: 18, size: 320, align: 8, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !25, line: 18, baseType: !101, size: 128, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !25, line: 18, baseType: !101, size: 128, align: 64, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !25, line: 18, baseType: !13, size: 8, align: 8, offset: 8640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 8704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 8896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !25, line: 18, baseType: !375, size: 192, align: 64, offset: 9088)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !10, size: 192, align: 8, elements: !376)
!376 = !{!377, !122, !123}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !25, line: 18, size: 384, align: 8, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !25, line: 18, baseType: !344, size: 192, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !25, line: 18, baseType: !384, size: 192, align: 64, offset: 192)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !25, line: 18, size: 192, align: 8, elements: !345)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !25, line: 18, baseType: !375, size: 192, align: 64, offset: 9280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 9472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 9664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 9856)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 10048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !25, line: 18, baseType: !242, size: 192, align: 64, offset: 10240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !25, line: 18, baseType: !318, size: 192, align: 64, offset: 10432)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !72, size: 128, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !10, line: 18, baseType: !394, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!44, !43, !397}
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 17, size: 128, align: 8, elements: !398)
!398 = !{!399, !157}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 17, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !402)
!402 = !{!403, !404, !408, !409, !413, !421, !429, !430, !431, !432, !449, !456, !1693, !1697, !1724, !1728, !1729, !1733, !1734, !1738, !1754, !1769, !1773, !1777, !1781, !1782, !1786, !1787, !1791, !1798, !1799, !1806, !1815, !1816, !1820, !1824, !1825, !1826, !1827}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 17, baseType: !79, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 17, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!195, !43, !101, !242}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 17, baseType: !179, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 17, baseType: !410, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!72, !43, !101}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 17, baseType: !414, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !43}
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !418)
!418 = !{!419, !122, !123}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 17, baseType: !422, size: 64, align: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !43}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !211, size: 192, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 16, baseType: !72, size: 128, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 17, baseType: !422, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 17, baseType: !126, size: 64, align: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 17, baseType: !422, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 17, baseType: !433, size: 64, align: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !43}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !438)
!438 = !{!439, !440, !441, !442, !444, !445, !446, !447, !448}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !105, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !443, size: 16, align: 16, offset: 80)
!443 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !86, size: 32, align: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !83, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 17, baseType: !450, size: 64, align: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!453, !43}
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !454)
!454 = !{!197, !455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !242, size: 192, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 17, baseType: !457, size: 64, align: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !43, !101}
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !461)
!461 = !{!462, !198}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !463, size: 128, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 17, size: 128, align: 8, elements: !464)
!464 = !{!465, !157}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 17, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !468)
!468 = !{!403, !469, !473, !477}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 17, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!72, !43}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 17, baseType: !474, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!13, !43}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 17, baseType: !478, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !43}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !482)
!482 = !{!483, !1692}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 17, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 17, size: 704, align: 8, elements: !486)
!486 = !{!487, !488, !489, !1687, !1688, !1690, !1691}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 17, baseType: !101, size: 128, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 17, baseType: !211, size: 192, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 17, baseType: !490, size: 64, align: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 16, size: 448, align: 8, elements: !492)
!492 = !{!493, !1683, !1684, !1685, !1686}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 16, baseType: !494, size: 64, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 16, size: 64, align: 8, elements: !495)
!495 = !{!496, !498, !509, !515}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 16, baseType: !497, align: 8)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 16, align: 1, elements: !45)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 16, baseType: !499, align: 64)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, align: 8, elements: !507)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 16, size: 64, align: 8, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 16, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!44}
!507 = !{!508}
!508 = !DISubrange(count: 0, lowerBound: 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 16, baseType: !510, align: 32)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, align: 4, elements: !507)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 10, size: 64, align: 4, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 10, baseType: !38, size: 32, align: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 10, baseType: !86, size: 32, align: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 16, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 16, size: 2624, align: 8, elements: !518)
!518 = !{!519, !682, !1475, !1483, !1488, !1489, !1490, !1585}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 16, baseType: !520, size: 128, align: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 8, size: 128, align: 8, elements: !521)
!521 = !{!522, !157}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 8, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !525)
!525 = !{!526, !527, !531, !535, !536, !541, !542, !543, !547, !567, !568, !572, !580, !591, !592, !596, !597, !598, !603, !604, !653, !661, !662, !663, !664, !665, !666, !667, !668, !672, !673, !677, !678}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 8, baseType: !79, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!105, !43}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 8, baseType: !532, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!13, !43, !520}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 8, baseType: !537, size: 64, align: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !43}
!540 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 8, baseType: !474, size: 64, align: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 8, baseType: !532, size: 64, align: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 8, baseType: !544, size: 64, align: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!520, !43}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 8, baseType: !548, size: 64, align: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !43, !105}
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 8, size: 832, align: 8, elements: !552)
!552 = !{!553, !554, !555, !556, !561, !562, !566}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 8, baseType: !101, size: 128, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 8, baseType: !101, size: 128, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 8, baseType: !520, size: 128, align: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 8, baseType: !557, size: 128, align: 64, offset: 384)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 8, size: 128, align: 8, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !98, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 8, baseType: !83, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 8, baseType: !563, size: 192, align: 64, offset: 576)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !564)
!564 = !{!565, !122, !123}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !264, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 8, baseType: !13, size: 8, align: 8, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 8, baseType: !569, size: 64, align: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!551, !43, !563}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 8, baseType: !573, size: 64, align: 64, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !43, !101}
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 8, baseType: !551, size: 832, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 8, baseType: !13, size: 8, align: 8, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 8, baseType: !581, size: 64, align: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!576, !43, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 8, size: 64, align: 8, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 8, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!13, !101}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 8, baseType: !532, size: 64, align: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 8, baseType: !593, size: 64, align: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!520, !43, !105}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 8, baseType: !474, size: 64, align: 64, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 8, baseType: !544, size: 64, align: 64, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 8, baseType: !599, size: 64, align: 64, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !43}
!602 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 8, baseType: !605, size: 64, align: 64, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !43, !105}
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !25, line: 8, size: 640, align: 8, elements: !609)
!609 = !{!553, !554, !555, !610, !652}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !25, line: 8, baseType: !611, size: 192, align: 64, offset: 384)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !25, line: 8, size: 192, align: 8, elements: !612)
!612 = !{!613, !649, !650}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 8, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !25, line: 8, size: 512, align: 8, elements: !616)
!616 = !{!617, !618, !619, !620, !622, !623, !624, !625, !630, !631, !632, !648}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 8, baseType: !83, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 8, baseType: !83, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 8, baseType: !86, size: 32, align: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !25, line: 8, baseType: !621, size: 8, align: 8, offset: 160)
!621 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 8, baseType: !16, size: 8, align: 8, offset: 168)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 8, baseType: !16, size: 8, align: 8, offset: 176)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 8, baseType: !16, size: 8, align: 8, offset: 184)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !25, line: 8, baseType: !626, size: 64, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 8, size: 64, align: 8, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 8, baseType: !96, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 8, baseType: !98, size: 64, align: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 8, baseType: !100, size: 64, align: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 8, baseType: !633, size: 64, align: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !25, line: 8, size: 320, align: 8, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 8, baseType: !100, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 8, baseType: !100, size: 64, align: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 8, baseType: !639, size: 192, align: 64, offset: 128)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !640)
!640 = !{!641, !122, !123}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !25, line: 8, size: 320, align: 8, elements: !644)
!644 = !{!636, !637, !645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 8, baseType: !43, size: 64, align: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 8, baseType: !43, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 8, baseType: !43, size: 64, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 8, baseType: !43, size: 64, align: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !25, line: 8, baseType: !43, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !25, line: 8, baseType: !651, size: 64, align: 64, offset: 128)
!651 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 8, baseType: !105, size: 64, align: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 8, baseType: !654, size: 64, align: 64, offset: 1280)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !43, !101}
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 8, baseType: !608, size: 640, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 8, baseType: !13, size: 8, align: 8, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 1472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 1536)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 8, baseType: !528, size: 64, align: 64, offset: 1600)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 8, baseType: !593, size: 64, align: 64, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 8, baseType: !669, size: 64, align: 64, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!83, !43}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 1856)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 8, baseType: !674, size: 64, align: 64, offset: 1920)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!614, !43}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 1984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 8, baseType: !679, size: 64, align: 64, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!633, !43}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !25, line: 16, baseType: !683, size: 128, align: 64, offset: 128)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !684)
!684 = !{!685, !157}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !688)
!688 = !{!689, !690, !1401, !1405, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1450, !1451, !1452, !1453, !1454, !1458, !1472, !1473, !1474}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 16, baseType: !79, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 16, baseType: !691, size: 64, align: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!694, !43}
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !695)
!695 = !{!696, !157}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !699)
!699 = !{!689, !700, !1397, !852, !853}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !701, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !43, !721}
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !705)
!705 = !{!706, !157}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !709)
!709 = !{!689, !710, !715, !716, !717, !722, !1331, !829, !1023, !1332, !1336, !1354, !1031, !1375}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 16, baseType: !711, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !43}
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !25, line: 16, size: 128, align: 8, elements: !558)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 16, baseType: !718, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !43}
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !25, line: 16, size: 128, align: 8, elements: !558)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !723, size: 64, align: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !43}
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !25, line: 16, size: 128, align: 8, elements: !727)
!727 = !{!728, !157}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !731)
!731 = !{!689, !732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 16, baseType: !733, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !43}
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !25, line: 16, size: 128, align: 8, elements: !737)
!737 = !{!738, !157}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !741)
!741 = !{!689, !742, !1102, !1103, !1107, !1112, !1116, !1117, !1118, !1119, !1120, !1121, !1295, !1306, !1310, !1314, !1327}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 16, baseType: !743, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!44, !43, !746}
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !747)
!747 = !{!748, !157}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !751)
!751 = !{!689, !752, !757, !761, !1032, !1041, !1062, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1084, !1088, !1089, !1090, !1091, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 16, baseType: !753, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!756, !43}
!756 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 16, baseType: !758, size: 64, align: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!683, !43}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 16, baseType: !762, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!765, !43}
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !766)
!766 = !{!767, !157}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !770)
!770 = !{!689, !771, !811, !812, !813, !814, !815, !816, !817, !1025, !1026, !1027, !1031}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 16, baseType: !772, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !43}
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !776)
!776 = !{!777, !157}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !780)
!780 = !{!689, !781, !785, !789, !794, !795, !799, !800}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 16, baseType: !782, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!746, !43, !101}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !786, size: 64, align: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!746, !43, !721}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 16, baseType: !790, size: 64, align: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!746, !43, !793}
!793 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 16, baseType: !782, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 16, baseType: !796, size: 64, align: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!746, !43, !105}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !801, size: 64, align: 64, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!44, !43, !804}
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !25, line: 16, size: 128, align: 8, elements: !805)
!805 = !{!806, !157}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !809)
!809 = !{!689, !810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 16, baseType: !711, size: 64, align: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 16, baseType: !718, size: 64, align: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 16, baseType: !818, size: 64, align: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !43}
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !25, line: 16, size: 128, align: 8, elements: !822)
!822 = !{!823, !157}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !826)
!826 = !{!689, !710, !715, !716, !717, !827, !828, !829, !1023, !1024}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 16, baseType: !830, size: 64, align: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !43}
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !834)
!834 = !{!835, !157}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !838)
!838 = !{!689, !839, !840, !854, !855, !876, !877, !878, !896, !897, !898, !899, !900, !901, !902, !903, !907, !983, !1022}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 16, baseType: !841, size: 64, align: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !43}
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !845)
!845 = !{!846, !157}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !849)
!849 = !{!689, !850, !851, !852, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !786, size: 64, align: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 16, baseType: !796, size: 64, align: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !801, size: 64, align: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 16, baseType: !711, size: 64, align: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 16, baseType: !856, size: 64, align: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !43}
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !25, line: 16, size: 128, align: 8, elements: !860)
!860 = !{!861, !157}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !864)
!864 = !{!689, !865, !874, !875}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 16, baseType: !866, size: 64, align: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !43, !105}
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !25, line: 16, size: 192, align: 8, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !25, line: 16, baseType: !833, size: 128, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !25, line: 16, baseType: !13, size: 8, align: 8, offset: 136)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !801, size: 64, align: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 16, baseType: !528, size: 64, align: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 16, baseType: !879, size: 64, align: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !43}
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !883)
!883 = !{!884, !157}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !887)
!887 = !{!689, !888, !892, !852, !853}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !889, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!683, !43, !721}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 16, baseType: !893, size: 64, align: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!683, !43, !105}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 16, baseType: !718, size: 64, align: 64, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 16, baseType: !711, size: 64, align: 64, offset: 640)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 16, baseType: !126, size: 64, align: 64, offset: 832)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !801, size: 64, align: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 16, baseType: !904, size: 64, align: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!44, !43, !833}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 16, baseType: !908, size: 64, align: 64, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!911, !43}
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !912)
!912 = !{!913, !157}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !916)
!916 = !{!689, !917, !979, !852, !853}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !918, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!921, !43, !721}
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !922)
!922 = !{!923, !157}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !926)
!926 = !{!689, !710, !715, !716, !927, !969, !970, !971, !972, !973, !974, !978}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 16, baseType: !928, size: 64, align: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !43}
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !25, line: 16, size: 128, align: 8, elements: !932)
!932 = !{!933, !157}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !936)
!936 = !{!689, !937, !965, !852, !853}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 16, baseType: !938, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !43, !721}
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !25, line: 16, size: 128, align: 8, elements: !942)
!942 = !{!943, !157}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 16, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !946)
!946 = !{!689, !710, !715, !947, !813, !948, !949, !950, !951, !952, !953, !954, !955, !956, !960}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 16, baseType: !758, size: 64, align: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 16, baseType: !474, size: 64, align: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 16, baseType: !718, size: 64, align: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 16, baseType: !758, size: 64, align: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 704)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 16, baseType: !801, size: 64, align: 64, offset: 768)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 16, baseType: !957, size: 64, align: 64, offset: 832)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!44, !43, !941}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 16, baseType: !961, size: 64, align: 64, offset: 896)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!964, !43}
!964 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 16, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!941, !43, !105}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 16, baseType: !718, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 16, baseType: !43, size: 64, align: 64, offset: 512)
