; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./43.go", directory: "/home/ming/go/src/chaincode_repo/github/43")
!5 = !{!6, !23, !85, !96, !98, !100, !102, !104, !106, !108, !110, !112, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !3, file: !25, line: 7, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "43.go", directory: ".")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !25, line: 7, size: 64, align: 8, elements: !28)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !25, line: 7, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !25, line: 7, size: 704, align: 8, elements: !32)
!32 = !{!33, !69, !74, !82, !83, !84}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !25, line: 7, baseType: !34, size: 448, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !25, line: 7, size: 448, align: 8, elements: !35)
!35 = !{!36, !43, !45, !50, !64, !65, !66, !67, !68}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !25, line: 7, baseType: !37, size: 128, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !25, line: 7, size: 128, align: 8, elements: !38)
!38 = !{!39, !40, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 7, baseType: !22, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !25, line: 7, baseType: !41, size: 32, align: 32, offset: 64)
!41 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !25, line: 7, baseType: !41, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !25, line: 7, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !25, line: 7, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !25, line: 7, size: 64, align: 8, elements: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !25, line: 7, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !25, line: 7, baseType: !51, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !10, size: 192, align: 8, elements: !53)
!53 = !{!54, !62, !63}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !25, line: 7, size: 128, align: 8, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !25, line: 7, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !25, line: 7, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !25, line: 7, baseType: !41, size: 32, align: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !25, line: 7, baseType: !41, size: 32, align: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 392)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 400)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 7, baseType: !70, size: 128, align: 64, offset: 448)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !59, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !25, line: 7, baseType: !75, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !25, line: 7, size: 64, align: 8, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !25, line: 7, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !25, line: 7, align: 1, elements: !81)
!81 = !{}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 648)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "appendMode", file: !25, line: 7, baseType: !13, size: 8, align: 8, offset: 656)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "bufio..types", linkageName: "bufio..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !10, size: 128, align: 8, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !44, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !10, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, align: 8, elements: !94)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIBasicType(name: "void")
!94 = !{!95}
!95 = !DISubrange(count: 1, lowerBound: 0)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "bytes..types", linkageName: "bytes..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "compress_1flate..types", linkageName: "compress_1flate..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "compress_1gzip..types", linkageName: "compress_1gzip..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "context..types", linkageName: "context..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "crypto..types", linkageName: "crypto..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "crypto_1cipher..types", linkageName: "crypto_1cipher..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "crypto_1dsa..types", linkageName: "crypto_1dsa..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "crypto_1ecdsa..types", linkageName: "crypto_1ecdsa..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519..types", linkageName: "crypto_1ed25519_1internal_1edwards25519..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519_1field..types", linkageName: "crypto_1ed25519_1internal_1edwards25519_1field..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "crypto_1elliptic..types", linkageName: "crypto_1elliptic..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1fiat..types", linkageName: "crypto_1elliptic_1internal_1fiat..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1nistec..types", linkageName: "crypto_1elliptic_1internal_1nistec..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "crypto_1internal_1randutil..types", linkageName: "crypto_1internal_1randutil..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "crypto_1md5..types", linkageName: "crypto_1md5..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "crypto_1rand..types", linkageName: "crypto_1rand..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "crypto_1rsa..types", linkageName: "crypto_1rsa..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "crypto_1sha1..types", linkageName: "crypto_1sha1..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "crypto_1sha256..types", linkageName: "crypto_1sha256..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "crypto_1sha512..types", linkageName: "crypto_1sha512..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "crypto_1tls..types", linkageName: "crypto_1tls..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "crypto_1x509..types", linkageName: "crypto_1x509..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "crypto_1x509_1pkix..types", linkageName: "crypto_1x509_1pkix..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "encoding_1asn1..types", linkageName: "encoding_1asn1..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "encoding_1base64..types", linkageName: "encoding_1base64..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "encoding_1binary..types", linkageName: "encoding_1binary..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "encoding_1hex..types", linkageName: "encoding_1hex..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "encoding_1json..types", linkageName: "encoding_1json..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "encoding_1pem..types", linkageName: "encoding_1pem..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "errors..types", linkageName: "errors..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "flag..types", linkageName: "flag..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "fmt..types", linkageName: "fmt..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1jsonpb..types", linkageName: "github_0com_1golang_1protobuf_1jsonpb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1proto..types", linkageName: "github_0com_1golang_1protobuf_1proto..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1any..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1any..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1duration..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1duration..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", linkageName: "github_0com_1golang_1protobuf_1ptypes_1timestamp..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1common..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1queryresult..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1ledger_1rwset..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1msp..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", linkageName: "github_0com_1hyperledger_1fabric_x2dprotos_x2dgo_1peer..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "go_1token..types", linkageName: "go_1token..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20..types", linkageName: "golang_0org_1x_1crypto_1chacha20..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20poly1305..types", linkageName: "golang_0org_1x_1crypto_1chacha20poly1305..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519..types", linkageName: "golang_0org_1x_1crypto_1curve25519..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", linkageName: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1dns_1dnsmessage..types", linkageName: "golang_0org_1x_1net_1dns_1dnsmessage..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2..types", linkageName: "golang_0org_1x_1net_1http2..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2_1hpack..types", linkageName: "golang_0org_1x_1net_1http2_1hpack..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpguts..types", linkageName: "golang_0org_1x_1net_1http_1httpguts..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpproxy..types", linkageName: "golang_0org_1x_1net_1http_1httpproxy..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1idna..types", linkageName: "golang_0org_1x_1net_1idna..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1internal_1timeseries..types", linkageName: "golang_0org_1x_1net_1internal_1timeseries..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1trace..types", linkageName: "golang_0org_1x_1net_1trace..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "golang_0org_1x_1sys_1unix..types", linkageName: "golang_0org_1x_1sys_1unix..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1secure_1bidirule..types", linkageName: "golang_0org_1x_1text_1secure_1bidirule..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1transform..types", linkageName: "golang_0org_1x_1text_1transform..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1bidi..types", linkageName: "golang_0org_1x_1text_1unicode_1bidi..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1norm..types", linkageName: "golang_0org_1x_1text_1unicode_1norm..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", linkageName: "google_0golang_0org_1genproto_1googleapis_1rpc_1status..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc..types", linkageName: "google_0golang_0org_1grpc..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer..types", linkageName: "google_0golang_0org_1grpc_1balancer..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1base..types", linkageName: "google_0golang_0org_1grpc_1balancer_1base..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", linkageName: "google_0golang_0org_1grpc_1balancer_1roundrobin..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", linkageName: "google_0golang_0org_1grpc_1binarylog_1grpc__binarylog__v1..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1codes..types", linkageName: "google_0golang_0org_1grpc_1codes..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1connectivity..types", linkageName: "google_0golang_0org_1grpc_1connectivity..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials..types", linkageName: "google_0golang_0org_1grpc_1credentials..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding..types", linkageName: "google_0golang_0org_1grpc_1encoding..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1encoding_1proto..types", linkageName: "google_0golang_0org_1grpc_1encoding_1proto..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1grpclog..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal..types", linkageName: "google_0golang_0org_1grpc_1internal..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1backoff..types", linkageName: "google_0golang_0org_1grpc_1internal_1backoff..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancer_1gracefulswitch..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1balancerload..types", linkageName: "google_0golang_0org_1grpc_1internal_1balancerload..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1binarylog..types", linkageName: "google_0golang_0org_1grpc_1internal_1binarylog..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1channelz..types", linkageName: "google_0golang_0org_1grpc_1internal_1channelz..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1credentials..types", linkageName: "google_0golang_0org_1grpc_1internal_1credentials..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1envconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1envconfig..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpclog..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpclog..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcrand..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcrand..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1dns..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1passthrough..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver_1unix..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1internal_1serviceconfig..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1syscall..types", linkageName: "google_0golang_0org_1grpc_1internal_1syscall..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1resolver..types", linkageName: "google_0golang_0org_1grpc_1resolver..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protojson..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protojson..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1protowire..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1protowire..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descfmt..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descfmt..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1descopts..types", linkageName: "google_0golang_0org_1protobuf_1internal_1descopts..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1detrand..types", linkageName: "google_0golang_0org_1protobuf_1internal_1detrand..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1json..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1tag..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1text..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1errors..types", linkageName: "google_0golang_0org_1protobuf_1internal_1errors..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filedesc..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filedesc..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1filetype..types", linkageName: "google_0golang_0org_1protobuf_1internal_1filetype..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1impl..types", linkageName: "google_0golang_0org_1protobuf_1internal_1impl..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1order..types", linkageName: "google_0golang_0org_1protobuf_1internal_1order..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1proto..types", linkageName: "google_0golang_0org_1protobuf_1proto..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoreflect..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protoregistry..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1descriptorpb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1anypb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1durationpb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1emptypb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", linkageName: "google_0golang_0org_1protobuf_1types_1known_1timestamppb..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "hash_1crc32..types", linkageName: "hash_1crc32..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "html..types", linkageName: "html..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "html_1template..types", linkageName: "html_1template..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "internal_1intern..types", linkageName: "internal_1intern..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "internal_1oserror..types", linkageName: "internal_1oserror..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "internal_1poll..types", linkageName: "internal_1poll..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "internal_1reflectlite..types", linkageName: "internal_1reflectlite..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "internal_1testlog..types", linkageName: "internal_1testlog..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "io..types", linkageName: "io..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "io_1fs..types", linkageName: "io_1fs..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "io_1ioutil..types", linkageName: "io_1ioutil..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "log..types", linkageName: "log..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "math..types", linkageName: "math..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "math_1big..types", linkageName: "math_1big..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "math_1rand..types", linkageName: "math_1rand..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "mime..types", linkageName: "mime..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "mime_1multipart..types", linkageName: "mime_1multipart..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "mime_1quotedprintable..types", linkageName: "mime_1quotedprintable..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "net..types", linkageName: "net..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "net_1http..types", linkageName: "net_1http..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "net_1http_1httputil..types", linkageName: "net_1http_1httputil..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "net_1http_1internal..types", linkageName: "net_1http_1internal..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "net_1netip..types", linkageName: "net_1netip..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "net_1textproto..types", linkageName: "net_1textproto..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "os..types", linkageName: "os..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "path..types", linkageName: "path..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "path_1filepath..types", linkageName: "path_1filepath..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "reflect..types", linkageName: "reflect..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "regexp..types", linkageName: "regexp..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "regexp_1syntax..types", linkageName: "regexp_1syntax..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "sort..types", linkageName: "sort..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "strconv..types", linkageName: "strconv..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "sync..types", linkageName: "sync..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "syscall..types", linkageName: "syscall..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "text_1tabwriter..types", linkageName: "text_1tabwriter..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "text_1template..types", linkageName: "text_1template..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "text_1template_1parse..types", linkageName: "text_1template_1parse..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "time..types", linkageName: "time..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "unicode..types", linkageName: "unicode..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "container_1list..types", linkageName: "container_1list..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "crypto_1aes..types", linkageName: "crypto_1aes..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "crypto_1des..types", linkageName: "crypto_1des..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "crypto_1ed25519..types", linkageName: "crypto_1ed25519..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "crypto_1hmac..types", linkageName: "crypto_1hmac..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "crypto_1internal_1subtle..types", linkageName: "crypto_1internal_1subtle..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "crypto_1rc4..types", linkageName: "crypto_1rc4..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "crypto_1subtle..types", linkageName: "crypto_1subtle..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "encoding..types", linkageName: "encoding..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "github_0com_1golang_1protobuf_1ptypes..types", linkageName: "github_0com_1golang_1protobuf_1ptypes..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", linkageName: "github_0com_1hyperledger_1fabric_x2dchaincode_x2dgo_1shim_1internal..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1hkdf..types", linkageName: "golang_0org_1x_1crypto_1hkdf..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1poly1305..types", linkageName: "golang_0org_1x_1crypto_1internal_1poly1305..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1subtle..types", linkageName: "golang_0org_1x_1crypto_1internal_1subtle..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1attributes..types", linkageName: "google_0golang_0org_1grpc_1attributes..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1backoff..types", linkageName: "google_0golang_0org_1grpc_1backoff..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", linkageName: "google_0golang_0org_1grpc_1balancer_1grpclb_1state..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1channelz..types", linkageName: "google_0golang_0org_1grpc_1channelz..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1credentials_1insecure..types", linkageName: "google_0golang_0org_1grpc_1credentials_1insecure..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1buffer..types", linkageName: "google_0golang_0org_1grpc_1internal_1buffer..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcsync..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcsync..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1grpcutil..types", linkageName: "google_0golang_0org_1grpc_1internal_1grpcutil..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1metadata..types", linkageName: "google_0golang_0org_1grpc_1internal_1metadata..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1pretty..types", linkageName: "google_0golang_0org_1grpc_1internal_1pretty..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1resolver..types", linkageName: "google_0golang_0org_1grpc_1internal_1resolver..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1status..types", linkageName: "google_0golang_0org_1grpc_1internal_1status..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", linkageName: "google_0golang_0org_1grpc_1internal_1transport_1networktype..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1keepalive..types", linkageName: "google_0golang_0org_1grpc_1keepalive..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1metadata..types", linkageName: "google_0golang_0org_1grpc_1metadata..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1peer..types", linkageName: "google_0golang_0org_1grpc_1peer..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1serviceconfig..types", linkageName: "google_0golang_0org_1grpc_1serviceconfig..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1stats..types", linkageName: "google_0golang_0org_1grpc_1stats..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1status..types", linkageName: "google_0golang_0org_1grpc_1status..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "google_0golang_0org_1grpc_1tap..types", linkageName: "google_0golang_0org_1grpc_1tap..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1encoding_1prototext..types", linkageName: "google_0golang_0org_1protobuf_1encoding_1prototext..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1defval..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", linkageName: "google_0golang_0org_1protobuf_1internal_1encoding_1messageset..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1flags..types", linkageName: "google_0golang_0org_1protobuf_1internal_1flags..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1genid..types", linkageName: "google_0golang_0org_1protobuf_1internal_1genid..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1pragma..types", linkageName: "google_0golang_0org_1protobuf_1internal_1pragma..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1set..types", linkageName: "google_0golang_0org_1protobuf_1internal_1set..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1strs..types", linkageName: "google_0golang_0org_1protobuf_1internal_1strs..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1internal_1version..types", linkageName: "google_0golang_0org_1protobuf_1internal_1version..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", linkageName: "google_0golang_0org_1protobuf_1reflect_1protodesc..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoiface..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", linkageName: "google_0golang_0org_1protobuf_1runtime_1protoimpl..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "hash..types", linkageName: "hash..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "hash_1fnv..types", linkageName: "hash_1fnv..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "internal_1abi..types", linkageName: "internal_1abi..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "internal_1fmtsort..types", linkageName: "internal_1fmtsort..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "internal_1goarch..types", linkageName: "internal_1goarch..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "internal_1godebug..types", linkageName: "internal_1godebug..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "internal_1goexperiment..types", linkageName: "internal_1goexperiment..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "internal_1goos..types", linkageName: "internal_1goos..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "internal_1itoa..types", linkageName: "internal_1itoa..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "internal_1nettrace..types", linkageName: "internal_1nettrace..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "internal_1race..types", linkageName: "internal_1race..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "internal_1singleflight..types", linkageName: "internal_1singleflight..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "internal_1syscall_1execenv..types", linkageName: "internal_1syscall_1execenv..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "internal_1syscall_1unix..types", linkageName: "internal_1syscall_1unix..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "internal_1unsafeheader..types", linkageName: "internal_1unsafeheader..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "math_1bits..types", linkageName: "math_1bits..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "net_1http_1httptrace..types", linkageName: "net_1http_1httptrace..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "net_1http_1internal_1ascii..types", linkageName: "net_1http_1internal_1ascii..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "net_1url..types", linkageName: "net_1url..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "strings..types", linkageName: "strings..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "sync_1atomic..types", linkageName: "sync_1atomic..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "unicode_1utf16..types", linkageName: "unicode_1utf16..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "unicode_1utf8..types", linkageName: "unicode_1utf8..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !3, file: !10, type: !87, isLocal: false, isDefinition: true)
!552 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !25, line: 1, type: !553, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !81)
!553 = !DISubroutineType(types: !554)
!554 = !{!93}
!555 = !DILocation(line: 1, column: 1, scope: !556)
!556 = !DILexicalBlockFile(scope: !552, file: !8, discriminator: 0)
!557 = !DILocation(line: 5, column: 1, scope: !558)
!558 = !DILexicalBlockFile(scope: !552, file: !559, discriminator: 0)
!559 = !DIFile(filename: "_gomod_.go", directory: "/tmp/go-build/b001")
!560 = distinct !DISubprogram(name: "main.AssetsPrivateChaincode.Init", scope: null, file: !25, line: 31, type: !561, scopeLine: 31, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !81)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !576, !576, !578}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !25, line: 9, size: 640, align: 8, elements: !564)
!564 = !{!565, !567, !568, !572, !574, !575}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !25, line: 9, baseType: !566, size: 32, align: 32)
!566 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !25, line: 9, baseType: !70, size: 128, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !25, line: 9, baseType: !569, size: 192, align: 64, offset: 192)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !570)
!570 = !{!571, !62, !63}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !59, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !25, line: 9, baseType: !573, align: 8, offset: 384)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !8, line: 1, align: 1, elements: !81)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !25, line: 9, baseType: !569, size: 192, align: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !25, line: 9, baseType: !566, size: 32, align: 32, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssetsPrivateChaincode", file: !25, line: 13, align: 1, elements: !81)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !25, line: 9, size: 128, align: 8, elements: !579)
!579 = !{!580, !922}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 9, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !583)
!583 = !{!584, !623, !646, !650, !654, !662, !670, !671, !672, !673, !690, !697, !1939, !1943, !1970, !1974, !1975, !1979, !1980, !1984, !1999, !2011, !2015, !2019, !2023, !2024, !2028, !2029, !2033, !2040, !2041, !2048, !2052, !2053, !2057, !2061, !2062, !2063, !2064}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 9, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !603, !604, !606, !622}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !49, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !41, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !596, size: 64, align: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!13, !92, !92}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !605, size: 64, align: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !607, size: 64, align: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !605, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !605, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !613, size: 192, align: 64, offset: 128)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !614)
!614 = !{!615, !62, !63}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !618)
!618 = !{!610, !611, !619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 9, baseType: !624, size: 64, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !92, !70, !643}
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 9, baseType: !70, size: 128, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 9, baseType: !631, size: 128, align: 64, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !632)
!632 = !{!633, !642}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !585, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !639, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!70, !92}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !644)
!644 = !{!645, !62, !63}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !605, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 9, baseType: !647, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!631, !92, !70, !70}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 9, baseType: !651, size: 64, align: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!631, !92, !70}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 9, baseType: !655, size: 64, align: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !92}
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !659)
!659 = !{!660, !62, !63}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 9, baseType: !663, size: 64, align: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !92}
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 10, baseType: !569, size: 192, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 10, baseType: !631, size: 128, align: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 9, baseType: !663, size: 64, align: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 9, baseType: !639, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 9, baseType: !663, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 9, baseType: !674, size: 64, align: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !92}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !679)
!679 = !{!680, !681, !682, !683, !685, !686, !687, !688, !689}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !44, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !684, size: 16, align: 16, offset: 80)
!684 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !41, size: 32, align: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !92, size: 64, align: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 9, baseType: !691, size: 64, align: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!694, !92}
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !695)
!695 = !{!629, !696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 9, baseType: !643, size: 192, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 9, baseType: !698, size: 64, align: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!701, !92, !70}
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !702)
!702 = !{!703, !630}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 9, baseType: !704, size: 128, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !25, line: 9, size: 128, align: 8, elements: !705)
!705 = !{!706, !922}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 9, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !709)
!709 = !{!584, !710, !714, !718}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 9, baseType: !711, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!631, !92}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 9, baseType: !715, size: 64, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!13, !92}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 9, baseType: !719, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !92}
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !723)
!723 = !{!724, !1422}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 9, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !25, line: 9, size: 704, align: 8, elements: !727)
!727 = !{!728, !729, !730, !1935, !1936, !1937, !1938}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !25, line: 9, baseType: !70, size: 128, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !25, line: 9, baseType: !569, size: 192, align: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !25, line: 9, baseType: !731, size: 64, align: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !25, line: 9, size: 448, align: 8, elements: !733)
!733 = !{!734, !1930, !1931, !1932, !1934}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 9, baseType: !735, size: 64, align: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !25, line: 9, size: 64, align: 8, elements: !736)
!736 = !{!737, !739, !748, !754}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !25, line: 9, baseType: !738, align: 8)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !25, line: 9, align: 1, elements: !81)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !25, line: 9, baseType: !740, align: 64)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, align: 8, elements: !746)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 9, size: 64, align: 8, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 9, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!746 = !{!747}
!747 = !DISubrange(count: 0, lowerBound: 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !25, line: 9, baseType: !749, align: 32)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, align: 4, elements: !746)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !25, line: 7, size: 64, align: 4, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !25, line: 7, baseType: !566, size: 32, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !25, line: 7, baseType: !41, size: 32, align: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !25, line: 9, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !25, line: 9, size: 2624, align: 8, elements: !757)
!757 = !{!758, !923, !1722, !1730, !1735, !1736, !1737, !1832}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !25, line: 9, baseType: !759, size: 128, align: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !25, line: 5, size: 128, align: 8, elements: !760)
!760 = !{!761, !922}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 5, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !764)
!764 = !{!765, !766, !770, !774, !775, !780, !781, !782, !786, !807, !808, !812, !820, !831, !832, !836, !837, !838, !843, !844, !893, !901, !902, !903, !904, !905, !906, !907, !908, !912, !913, !917, !918}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 5, baseType: !585, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 5, baseType: !767, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!44, !92}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 5, baseType: !771, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!13, !92, !759}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 5, baseType: !767, size: 64, align: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 5, baseType: !776, size: 64, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!779, !92}
!779 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 5, baseType: !715, size: 64, align: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 5, baseType: !771, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 5, baseType: !783, size: 64, align: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!759, !92}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 5, baseType: !787, size: 64, align: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !92, !44}
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !25, line: 5, size: 832, align: 8, elements: !791)
!791 = !{!792, !793, !794, !795, !800, !801, !806}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !25, line: 5, baseType: !70, size: 128, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !25, line: 5, baseType: !70, size: 128, align: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !25, line: 5, baseType: !759, size: 128, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !25, line: 5, baseType: !796, size: 128, align: 64, offset: 384)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !25, line: 5, size: 128, align: 8, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !59, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !25, line: 5, baseType: !49, size: 64, align: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !25, line: 5, baseType: !802, size: 192, align: 64, offset: 576)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !803)
!803 = !{!804, !62, !63}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !25, line: 5, baseType: !13, size: 8, align: 8, offset: 768)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 5, baseType: !767, size: 64, align: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 5, baseType: !809, size: 64, align: 64, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!790, !92, !802}
