; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22tests\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gomock\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/mock/gomock\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22github.com/golang/mock/gomock\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22timestamp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes/timestamp\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./68.go", directory: "/home/ming/go/src/chaincode_repo/github/68")
!5 = !{!6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterface.Close", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterface.Close", scope: null, file: !24, line: 274, type: !25, scopeLine: 274, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!24 = !DIFile(filename: "68.go", directory: ".")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !89, !89}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !28)
!28 = !{!29, !88}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !32)
!32 = !{!33, !84}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !36)
!36 = !{!37, !39, !40, !42, !43, !44, !45, !46, !56, !58, !65, !83}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !41, size: 32, align: 32, offset: 128)
!41 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !54, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "void")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !59, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !57, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !59, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !72, size: 192, align: 64, offset: 128)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !73)
!73 = !{!74, !81, !82}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !77)
!77 = !{!69, !70, !78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!60, !54}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockStateQueryIteratorInterface", file: !24, line: 31, size: 128, align: 8, elements: !91)
!91 = !{!92, !147}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", file: !24, line: 32, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Controller", file: !24, line: 24, size: 320, align: 8, elements: !95)
!95 = !{!96, !121, !127, !146}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "T", file: !24, line: 24, baseType: !97, size: 128, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestHelper", file: !24, line: 24, size: 128, align: 8, elements: !98)
!98 = !{!99, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 24, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*any,int,int})void,*func(*void,string,struct{*any,int,int})void,*func(*void)void}", file: !10, size: 256, align: 8, elements: !102)
!102 = !{!103, !104, !116, !117}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 24, baseType: !34, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Errorf", file: !10, line: 24, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!55, !54, !60, !108}
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*any,int,int}", file: !10, size: 192, align: 8, elements: !109)
!109 = !{!110, !81, !82}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !24, line: 22, size: 128, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !34, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Fatalf", file: !10, line: 24, baseType: !105, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Helper", file: !10, line: 24, baseType: !118, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!55, !54}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !24, line: 24, baseType: !122, size: 64, align: 32, offset: 128)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !24, line: 22, size: 64, align: 4, elements: !123)
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 22, baseType: !125, size: 32, align: 32)
!125 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !24, line: 22, baseType: !41, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "expectedCalls", file: !24, line: 24, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/golang/mock/gomock.callSet", file: !24, line: 24, size: 128, align: 8, elements: !130)
!130 = !{!131, !145}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "expected", file: !24, line: 24, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !134)
!134 = !{!135, !136, !137, !138, !140, !141, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !64, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !139, size: 16, align: 16, offset: 80)
!139 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !41, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !38, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !54, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", file: !24, line: 24, baseType: !132, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !24, line: 24, baseType: !13, size: 8, align: 8, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", file: !24, line: 33, baseType: !54, size: 64, align: 64, offset: 64)
!148 = !{}
!149 = !DILocalVariable(name: "m", arg: 1, scope: !23, file: !24, line: 274, type: !89)
!150 = !DILocation(line: 0, scope: !23)
!151 = !DILocalVariable(name: "$ret40", scope: !23, file: !24, line: 274, type: !27)
!152 = !DILocation(line: 275, column: 10, scope: !153)
!153 = distinct !DILexicalBlock(scope: !23, file: !24, line: 274, column: 1)
!154 = !DILocation(line: 275, column: 15, scope: !153)
!155 = !DILocalVariable(name: "ret", scope: !153, file: !24, line: 275, type: !108)
!156 = !DILocalVariable(name: "ret0", scope: !153, file: !24, line: 276, type: !27)
!157 = !DILocation(line: 276, column: 16, scope: !153)
!158 = !DILocation(line: 276, column: 2, scope: !153)
!159 = !DILocation(line: 277, column: 2, scope: !153)
!160 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterfaceMockRecorder.Close", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterfaceMockRecorder.Close", scope: null, file: !24, line: 252, type: !161, scopeLine: 252, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !372, !372}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Call", file: !24, line: 24, size: 1408, align: 8, elements: !165)
!165 = !{!166, !167, !168, !169, !336, !352, !353, !357, !358, !359, !360}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !24, line: 24, baseType: !97, size: 128, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "receiver", file: !24, line: 24, baseType: !112, size: 128, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "method", file: !24, line: 24, baseType: !60, size: 128, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "methodType", file: !24, line: 24, baseType: !170, size: 128, align: 64, offset: 384)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !24, line: 18, size: 128, align: 8, elements: !171)
!171 = !{!172, !115}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 18, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !175)
!175 = !{!176, !177, !181, !185, !186, !191, !195, !196, !200, !221, !222, !226, !234, !245, !246, !250, !251, !252, !257, !258, !307, !315, !316, !317, !318, !319, !320, !321, !322, !326, !327, !331, !332}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 18, baseType: !34, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!64, !54}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 18, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!13, !54, !170}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 18, baseType: !187, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !54}
!190 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 18, baseType: !192, size: 64, align: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!13, !54}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 18, baseType: !182, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 18, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!170, !54}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 18, baseType: !201, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !54, !64}
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !24, line: 18, size: 832, align: 8, elements: !205)
!205 = !{!206, !207, !208, !209, !214, !215, !220}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 18, baseType: !60, size: 128, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !24, line: 18, baseType: !60, size: 128, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !24, line: 18, baseType: !170, size: 128, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !24, line: 18, baseType: !210, size: 128, align: 64, offset: 384)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !24, line: 18, size: 128, align: 8, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !24, line: 1, baseType: !57, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !24, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !24, line: 18, baseType: !38, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 18, baseType: !216, size: 192, align: 64, offset: 576)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !217)
!217 = !{!218, !81, !82}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !24, line: 18, baseType: !13, size: 8, align: 8, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 18, baseType: !223, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !54, !216}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 18, baseType: !227, size: 64, align: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !54, !60}
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !204, size: 832, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !13, size: 8, align: 8, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 18, baseType: !235, size: 64, align: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!230, !54, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 18, size: 64, align: 8, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 18, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!13, !60}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 18, baseType: !182, size: 64, align: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 18, baseType: !247, size: 64, align: 64, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!170, !54, !64}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 18, baseType: !192, size: 64, align: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 18, baseType: !197, size: 64, align: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 18, baseType: !253, size: 64, align: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !54}
!256 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 18, baseType: !259, size: 64, align: 64, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !54, !64}
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !24, line: 18, size: 640, align: 8, elements: !263)
!263 = !{!206, !207, !208, !264, !306}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !24, line: 18, baseType: !265, size: 192, align: 64, offset: 384)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !24, line: 18, size: 192, align: 8, elements: !266)
!266 = !{!267, !303, !304}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 18, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !24, line: 18, size: 512, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274, !276, !277, !278, !279, !284, !285, !286, !302}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !24, line: 18, baseType: !38, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !24, line: 18, baseType: !38, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !24, line: 18, baseType: !41, size: 32, align: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !24, line: 18, baseType: !275, size: 8, align: 8, offset: 160)
!275 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !24, line: 18, baseType: !16, size: 8, align: 8, offset: 168)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !24, line: 18, baseType: !16, size: 8, align: 8, offset: 176)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !24, line: 18, baseType: !16, size: 8, align: 8, offset: 184)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !24, line: 18, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 18, size: 64, align: 8, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 18, baseType: !51, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !24, line: 18, baseType: !57, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !24, line: 18, baseType: !59, size: 64, align: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !24, line: 18, baseType: !287, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !24, line: 18, size: 320, align: 8, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 18, baseType: !59, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !24, line: 18, baseType: !59, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !24, line: 18, baseType: !293, size: 192, align: 64, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !294)
!294 = !{!295, !81, !82}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !24, line: 18, size: 320, align: 8, elements: !298)
!298 = !{!290, !291, !299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !24, line: 18, baseType: !54, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 18, baseType: !54, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !24, line: 18, baseType: !54, size: 64, align: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !24, line: 18, baseType: !54, size: 64, align: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !24, line: 18, baseType: !54, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !24, line: 18, baseType: !305, size: 64, align: 64, offset: 128)
!305 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 18, baseType: !64, size: 64, align: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 18, baseType: !308, size: 64, align: 64, offset: 1280)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !54, !60}
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !262, size: 640, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 18, baseType: !13, size: 8, align: 8, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 18, baseType: !85, size: 64, align: 64, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 1408)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 1472)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 18, baseType: !178, size: 64, align: 64, offset: 1600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 18, baseType: !247, size: 64, align: 64, offset: 1664)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 18, baseType: !85, size: 64, align: 64, offset: 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 18, baseType: !323, size: 64, align: 64, offset: 1792)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!38, !54}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 18, baseType: !85, size: 64, align: 64, offset: 1856)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 18, baseType: !328, size: 64, align: 64, offset: 1920)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!268, !54}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 18, baseType: !85, size: 64, align: 64, offset: 1984)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 18, baseType: !333, size: 64, align: 64, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!287, !54}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !24, line: 24, baseType: !337, size: 192, align: 64, offset: 512)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Matcher,int,int}", file: !10, size: 192, align: 8, elements: !338)
!338 = !{!339, !81, !82}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matcher", file: !24, line: 24, size: 128, align: 8, elements: !342)
!342 = !{!343, !115}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 24, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,any)bool,*func(*void)string}", file: !10, size: 192, align: 8, elements: !346)
!346 = !{!103, !347, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Matches", file: !10, line: 24, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!13, !54, !112}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 24, baseType: !85, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "origin", file: !24, line: 24, baseType: !60, size: 128, align: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "preReqs", file: !24, line: 24, baseType: !354, size: 192, align: 64, offset: 832)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Call,int,int}", file: !10, size: 192, align: 8, elements: !355)
!355 = !{!356, !81, !82}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !54, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "minCalls", file: !24, line: 24, baseType: !64, size: 64, align: 64, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "maxCalls", file: !24, line: 24, baseType: !64, size: 64, align: 64, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "numCalls", file: !24, line: 24, baseType: !64, size: 64, align: 64, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "actions", file: !24, line: 24, baseType: !361, size: 192, align: 64, offset: 1216)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !10, size: 192, align: 8, elements: !362)
!362 = !{!363, !81, !82}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 24, size: 64, align: 8, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 24, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!108, !108}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockStateQueryIteratorInterfaceMockRecorder", file: !24, line: 48, size: 64, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mock", file: !24, line: 49, baseType: !89, size: 64, align: 64)
!376 = !DILocalVariable(name: "mr", arg: 1, scope: !160, file: !24, line: 252, type: !372)
!377 = !DILocation(line: 0, scope: !160)
!378 = !DILocalVariable(name: "$ret36", scope: !160, file: !24, line: 252, type: !163)
!379 = !DILocation(line: 253, column: 119, scope: !160)
!380 = !DILocation(line: 253, column: 73, scope: !160)
!381 = !DILocation(line: 253, column: 11, scope: !160)
!382 = !DILocation(line: 253, column: 16, scope: !160)
!383 = !DILocation(line: 253, column: 21, scope: !160)
!384 = !DILocation(line: 253, column: 2, scope: !160)
!385 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterfaceMockRecorder.HasNext", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterfaceMockRecorder.HasNext", scope: null, file: !24, line: 257, type: !161, scopeLine: 257, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!386 = !DILocalVariable(name: "mr", arg: 1, scope: !385, file: !24, line: 257, type: !372)
!387 = !DILocation(line: 0, scope: !385)
!388 = !DILocalVariable(name: "$ret37", scope: !385, file: !24, line: 257, type: !163)
!389 = !DILocation(line: 258, column: 121, scope: !385)
!390 = !DILocation(line: 258, column: 75, scope: !385)
!391 = !DILocation(line: 258, column: 11, scope: !385)
!392 = !DILocation(line: 258, column: 16, scope: !385)
!393 = !DILocation(line: 258, column: 21, scope: !385)
!394 = !DILocation(line: 258, column: 2, scope: !385)
!395 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterfaceMockRecorder.Next", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterfaceMockRecorder.Next", scope: null, file: !24, line: 262, type: !161, scopeLine: 262, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!396 = !DILocalVariable(name: "mr", arg: 1, scope: !395, file: !24, line: 262, type: !372)
!397 = !DILocation(line: 0, scope: !395)
!398 = !DILocalVariable(name: "$ret38", scope: !395, file: !24, line: 262, type: !163)
!399 = !DILocation(line: 263, column: 118, scope: !395)
!400 = !DILocation(line: 263, column: 72, scope: !395)
!401 = !DILocation(line: 263, column: 11, scope: !395)
!402 = !DILocation(line: 263, column: 16, scope: !395)
!403 = !DILocation(line: 263, column: 21, scope: !395)
!404 = !DILocation(line: 263, column: 2, scope: !395)
!405 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterface.EXPECT", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterface.EXPECT", scope: null, file: !24, line: 64, type: !406, scopeLine: 64, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!406 = !DISubroutineType(types: !407)
!407 = !{!372, !89, !89}
!408 = !DILocalVariable(name: "m", arg: 1, scope: !405, file: !24, line: 64, type: !89)
!409 = !DILocation(line: 0, scope: !405)
!410 = !DILocalVariable(name: "$ret0", scope: !405, file: !24, line: 64, type: !372)
!411 = !DILocation(line: 65, column: 10, scope: !405)
!412 = !DILocation(line: 65, column: 2, scope: !405)
!413 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterface.HasNext", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterface.HasNext", scope: null, file: !24, line: 267, type: !414, scopeLine: 267, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!414 = !DISubroutineType(types: !415)
!415 = !{!13, !89, !89}
!416 = !DILocalVariable(name: "m", arg: 1, scope: !413, file: !24, line: 267, type: !89)
!417 = !DILocation(line: 0, scope: !413)
!418 = !DILocalVariable(name: "$ret39", scope: !413, file: !24, line: 267, type: !13)
!419 = !DILocation(line: 268, column: 10, scope: !420)
!420 = distinct !DILexicalBlock(scope: !413, file: !24, line: 267, column: 1)
!421 = !DILocation(line: 268, column: 15, scope: !420)
!422 = !DILocalVariable(name: "ret", scope: !420, file: !24, line: 268, type: !108)
!423 = !DILocalVariable(name: "ret0", scope: !420, file: !24, line: 269, type: !13)
!424 = !DILocation(line: 269, column: 16, scope: !420)
!425 = !DILocation(line: 269, column: 2, scope: !420)
!426 = !DILocation(line: 270, column: 2, scope: !420)
!427 = distinct !DISubprogram(name: "command-line-arguments.MockStateQueryIteratorInterface.Next", linkageName: "command_x2dline_x2darguments.MockStateQueryIteratorInterface.Next", scope: null, file: !24, line: 281, type: !428, scopeLine: 281, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!428 = !DISubroutineType(types: !429)
!429 = !{!430, !89, !89}
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KV,error}", file: !10, size: 192, align: 8, elements: !431)
!431 = !{!432, !446}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "KV", file: !24, line: 26, size: 704, align: 8, elements: !435)
!435 = !{!436, !437, !438, !442, !444, !445}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", file: !24, line: 26, baseType: !60, size: 128, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !24, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 26, baseType: !439, size: 192, align: 64, offset: 256)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !440)
!440 = !{!441, !81, !82}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !57, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !24, line: 26, baseType: !443, align: 8, offset: 448)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !8, line: 1, align: 1, elements: !148)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !24, line: 26, baseType: !439, size: 192, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !24, line: 26, baseType: !125, size: 32, align: 32, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !27, size: 128, align: 64, offset: 64)
!447 = !DILocalVariable(name: "m", arg: 1, scope: !427, file: !24, line: 281, type: !89)
!448 = !DILocation(line: 0, scope: !427)
!449 = !DILocalVariable(name: "$ret41", scope: !427, file: !24, line: 281, type: !433)
!450 = !DILocation(line: 282, column: 10, scope: !451)
!451 = distinct !DILexicalBlock(scope: !427, file: !24, line: 281, column: 1)
!452 = !DILocation(line: 282, column: 15, scope: !451)
!453 = !DILocalVariable(name: "ret", scope: !451, file: !24, line: 282, type: !108)
!454 = !DILocalVariable(name: "ret0", scope: !451, file: !24, line: 283, type: !433)
!455 = !DILocation(line: 283, column: 16, scope: !451)
!456 = !DILocation(line: 283, column: 2, scope: !451)
!457 = !DILocation(line: 284, column: 16, scope: !451)
!458 = !DILocation(line: 284, column: 2, scope: !451)
!459 = !DILocation(line: 285, column: 2, scope: !451)
!460 = distinct !DISubprogram(name: "command-line-arguments.MockCommonIteratorInterface.EXPECT", linkageName: "command_x2dline_x2darguments.MockCommonIteratorInterface.EXPECT", scope: null, file: !24, line: 69, type: !461, scopeLine: 69, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !467, !467}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockCommonIteratorInterfaceMockRecorder", file: !24, line: 59, size: 64, align: 8, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mock", file: !24, line: 60, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockCommonIteratorInterface", file: !24, line: 53, size: 128, align: 8, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", file: !24, line: 54, baseType: !93, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", file: !24, line: 55, baseType: !54, size: 64, align: 64, offset: 64)
!472 = !DILocalVariable(name: "m", arg: 1, scope: !460, file: !24, line: 69, type: !467)
!473 = !DILocation(line: 0, scope: !460)
!474 = !DILocalVariable(name: "$ret1", scope: !460, file: !24, line: 69, type: !463)
!475 = !DILocation(line: 70, column: 10, scope: !460)
!476 = !DILocation(line: 70, column: 2, scope: !460)
!477 = distinct !DISubprogram(name: "command-line-arguments.NewSMC", linkageName: "command_x2dline_x2darguments.NewSMC", scope: null, file: !24, line: 74, type: !478, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !148)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !1786, !60}
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*MockChaincodeStubInterface,*MockStub,*Controller}", file: !10, size: 192, align: 8, elements: !481)
!481 = !{!482, !492, !1785}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 74, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockChaincodeStubInterface", file: !24, line: 37, size: 128, align: 8, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", file: !24, line: 38, baseType: !93, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", file: !24, line: 39, baseType: !488, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockChaincodeStubInterfaceMockRecorder", file: !24, line: 43, size: 64, align: 8, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mock", file: !24, line: 44, baseType: !54, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 74, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "MockStub", file: !24, line: 26, size: 1536, align: 8, elements: !495)
!495 = !{!496, !501, !502, !1759, !1760, !1761, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1783, !1784}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !24, line: 26, baseType: !497, size: 192, align: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !498)
!498 = !{!499, !81, !82}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TransientMap", file: !24, line: 26, baseType: !132, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cc", file: !24, line: 26, baseType: !503, size: 128, align: 64, offset: 256)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chaincode", file: !24, line: 26, size: 128, align: 8, elements: !504)
!504 = !{!505, !115}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 26, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ChaincodeStubInterface)Response,*func(*void,ChaincodeStubInterface)Response}", file: !10, size: 192, align: 8, elements: !508)
!508 = !{!509, !510, !1758}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 26, baseType: !34, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Init", file: !10, line: 26, baseType: !511, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !54, !522}
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !24, line: 26, size: 640, align: 8, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !24, line: 26, baseType: !125, size: 32, align: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !24, line: 26, baseType: !60, size: 128, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !24, line: 26, baseType: !439, size: 192, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !24, line: 26, baseType: !443, align: 8, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !24, line: 26, baseType: !439, size: 192, align: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !24, line: 26, baseType: !125, size: 32, align: 32, offset: 576)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !24, line: 26, size: 128, align: 8, elements: !523)
!523 = !{!524, !115}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 26, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void).google.golang.org/protobuf/internal/impl.extensionMap,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{.google.golang.org/protobuf/internal/impl.extensionMap,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !527)
!527 = !{!509, !528, !539, !543, !547, !551, !559, !560, !561, !562, !566, !573, !1635, !1639, !1656, !1660, !1661, !1665, !1666, !1670, !1686, !1698, !1702, !1706, !1710, !1711, !1715, !1716, !1720, !1727, !1728, !1735, !1739, !1740, !1744, !1748, !1749, !1750, !1751}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 26, baseType: !529, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !54, !60, !536}
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !60, size: 128, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !27, size: 128, align: 64, offset: 128)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !537)
!537 = !{!538, !81, !82}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !59, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 26, baseType: !540, size: 64, align: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!27, !54, !60, !60}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 26, baseType: !544, size: 64, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!27, !54, !60}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 26, baseType: !548, size: 64, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!497, !54}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 26, baseType: !552, size: 64, align: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !54}
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 25, baseType: !439, size: 192, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 25, baseType: !27, size: 128, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 26, baseType: !552, size: 64, align: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 26, baseType: !85, size: 64, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 26, baseType: !552, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 26, baseType: !563, size: 64, align: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!132, !54}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 26, baseType: !567, size: 64, align: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!570, !54}
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !571)
!571 = !{!534, !572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !536, size: 192, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 26, baseType: !574, size: 64, align: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !54, !60}
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !578)
!578 = !{!579, !535}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !580, size: 128, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !24, line: 26, size: 128, align: 8, elements: !581)
!581 = !{!582, !115}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 26, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !585)
!585 = !{!509, !586, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 26, baseType: !587, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!27, !54}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 26, baseType: !192, size: 64, align: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 26, baseType: !592, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !54}
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !596)
!596 = !{!597, !446}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 26, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !24, line: 26, size: 704, align: 8, elements: !600)
!600 = !{!601, !602, !603, !1633, !1634, !444, !445}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !24, line: 26, baseType: !60, size: 128, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 26, baseType: !439, size: 192, align: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !24, line: 26, baseType: !604, size: 64, align: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !24, line: 25, size: 448, align: 8, elements: !606)
!606 = !{!607, !1628, !1629, !1630, !1632}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 25, baseType: !608, size: 64, align: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !24, line: 25, size: 64, align: 8, elements: !609)
!609 = !{!610, !612, !623, !625}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !24, line: 25, baseType: !611, align: 8)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !24, line: 25, align: 1, elements: !148)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !24, line: 25, baseType: !613, align: 64)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, align: 8, elements: !621)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 24, size: 64, align: 8, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 24, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!55}
!621 = !{!622}
!622 = !DISubrange(count: 0, lowerBound: 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !24, line: 25, baseType: !624, align: 32)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, align: 4, elements: !621)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !24, line: 25, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !24, line: 25, size: 2624, align: 8, elements: !628)
!628 = !{!629, !630, !1424, !1432, !1433, !1434, !1435, !1530}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !24, line: 25, baseType: !170, size: 128, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !24, line: 25, baseType: !631, size: 128, align: 64, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !632)
!632 = !{!633, !115}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !636)
!636 = !{!637, !638, !1350, !1354, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1399, !1400, !1401, !1402, !1403, !1407, !1421, !1422, !1423}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 25, baseType: !34, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 25, baseType: !639, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !54}
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !643)
!643 = !{!644, !115}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !647)
!647 = !{!637, !648, !1346, !800, !801}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !649, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !54, !669}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !653)
!653 = !{!654, !115}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !657)
!657 = !{!637, !658, !663, !664, !665, !670, !1280, !777, !973, !1281, !1285, !1303, !981, !1324}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 25, baseType: !659, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !54}
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !24, line: 25, size: 128, align: 8, elements: !211)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 25, baseType: !666, size: 64, align: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!669, !54}
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !24, line: 25, size: 128, align: 8, elements: !211)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !671, size: 64, align: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!674, !54}
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !24, line: 25, size: 128, align: 8, elements: !675)
!675 = !{!676, !115}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !679)
!679 = !{!637, !680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 25, baseType: !681, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !54}
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !24, line: 25, size: 128, align: 8, elements: !685)
!685 = !{!686, !115}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !689)
!689 = !{!637, !690, !1052, !1053, !1057, !1064, !1068, !1069, !1070, !1071, !1072, !1073, !1244, !1255, !1259, !1263, !1276}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 25, baseType: !691, size: 64, align: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!55, !54, !694}
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !695)
!695 = !{!696, !115}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !699)
!699 = !{!637, !700, !705, !709, !982, !991, !1012, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1034, !1038, !1039, !1040, !1041, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 25, baseType: !701, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !54}
!704 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 25, baseType: !706, size: 64, align: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!631, !54}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 25, baseType: !710, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !54}
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !714)
!714 = !{!715, !115}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !718)
!718 = !{!637, !719, !759, !760, !761, !762, !763, !764, !765, !975, !976, !977, !981}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 25, baseType: !720, size: 64, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !54}
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !724)
!724 = !{!725, !115}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !728)
!728 = !{!637, !729, !733, !737, !742, !743, !747, !748}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 25, baseType: !730, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!694, !54, !60}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !734, size: 64, align: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!694, !54, !669}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 25, baseType: !738, size: 64, align: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!694, !54, !741}
!741 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 25, baseType: !730, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !744, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!694, !54, !64}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!55, !54, !752}
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !24, line: 25, size: 128, align: 8, elements: !753)
!753 = !{!754, !115}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !757)
!757 = !{!637, !758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 25, baseType: !659, size: 64, align: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 25, baseType: !666, size: 64, align: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !766, size: 64, align: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !54}
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !24, line: 25, size: 128, align: 8, elements: !770)
!770 = !{!771, !115}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !774)
!774 = !{!637, !658, !663, !664, !665, !775, !776, !777, !973, !974}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !778, size: 64, align: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !54}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !782)
!782 = !{!783, !115}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !786)
!786 = !{!637, !787, !788, !802, !803, !824, !825, !826, !844, !845, !846, !847, !848, !849, !850, !851, !855, !931, !972}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 25, baseType: !789, size: 64, align: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !54}
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !793)
!793 = !{!794, !115}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !797)
!797 = !{!637, !798, !799, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !734, size: 64, align: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !744, size: 64, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 25, baseType: !659, size: 64, align: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 25, baseType: !804, size: 64, align: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !54}
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !24, line: 25, size: 128, align: 8, elements: !808)
!808 = !{!809, !115}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !812)
!812 = !{!637, !813, !822, !823}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !814, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !54, !64}
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !24, line: 25, size: 192, align: 8, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !24, line: 25, baseType: !781, size: 128, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !24, line: 25, baseType: !13, size: 8, align: 8, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !24, line: 25, baseType: !13, size: 8, align: 8, offset: 136)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 25, baseType: !827, size: 64, align: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!830, !54}
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !831)
!831 = !{!832, !115}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !835)
!835 = !{!637, !836, !840, !800, !801}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !837, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!631, !54, !669}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !841, size: 64, align: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!631, !54, !64}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 25, baseType: !666, size: 64, align: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 25, baseType: !659, size: 64, align: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 704)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 768)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 25, baseType: !85, size: 64, align: 64, offset: 832)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 25, baseType: !852, size: 64, align: 64, offset: 960)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!55, !54, !781}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 25, baseType: !856, size: 64, align: 64, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !54}
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !860)
!860 = !{!861, !115}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !864)
!864 = !{!637, !865, !927, !800, !801}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !866, size: 64, align: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !54, !669}
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !870)
!870 = !{!871, !115}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !874)
!874 = !{!637, !658, !663, !664, !875, !917, !918, !919, !920, !921, !922, !926}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 25, baseType: !876, size: 64, align: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!879, !54}
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !24, line: 25, size: 128, align: 8, elements: !880)
!880 = !{!881, !115}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !884)
!884 = !{!637, !885, !913, !800, !801}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 25, baseType: !886, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !54, !669}
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !890)
!890 = !{!891, !115}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !894)
!894 = !{!637, !658, !663, !895, !761, !896, !897, !898, !899, !900, !901, !902, !903, !904, !908}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 25, baseType: !706, size: 64, align: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 25, baseType: !192, size: 64, align: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 25, baseType: !666, size: 64, align: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 25, baseType: !706, size: 64, align: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 25, baseType: !905, size: 64, align: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!55, !54, !889}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 25, baseType: !909, size: 64, align: 64, offset: 896)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!912, !54}
!912 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !914, size: 64, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!889, !54, !64}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 25, baseType: !666, size: 64, align: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 384)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !54, size: 64, align: 64, offset: 512)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 25, baseType: !923, size: 64, align: 64, offset: 640)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!55, !54, !869}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 25, baseType: !909, size: 64, align: 64, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !928, size: 64, align: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!869, !54, !64}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 25, baseType: !932, size: 64, align: 64, offset: 1088)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!935, !54}
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !24, line: 25, size: 128, align: 8, elements: !936)
!936 = !{!937, !115}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 384, align: 8, elements: !940)
!940 = !{!637, !941, !962, !966, !970, !971}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !10, line: 25, baseType: !942, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !54, !769}
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !24, line: 25, size: 960, align: 8, elements: !946)
!946 = !{!947, !954, !955, !956, !957, !958, !959, !960, !961}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 25, baseType: !948, size: 192, align: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !24, line: 25, size: 192, align: 8, elements: !949)
!949 = !{!950, !952, !953}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !24, line: 25, baseType: !64, size: 64, align: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !24, line: 25, baseType: !64, size: 64, align: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !24, line: 25, baseType: !64, size: 64, align: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !24, line: 25, baseType: !64, size: 64, align: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !24, line: 25, baseType: !536, size: 192, align: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !24, line: 25, baseType: !60, size: 128, align: 64, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !24, line: 25, baseType: !60, size: 128, align: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !24, line: 25, baseType: !64, size: 64, align: 64, offset: 896)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !10, line: 25, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!945, !54, !948}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 25, baseType: !967, size: 64, align: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!945, !54, !64}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 25, baseType: !178, size: 64, align: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 25, baseType: !909, size: 64, align: 64, offset: 1152)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 25, baseType: !909, size: 64, align: 64, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !778, size: 64, align: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 25, baseType: !749, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 25, baseType: !978, size: 64, align: 64, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!55, !54, !713}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 25, baseType: !909, size: 64, align: 64, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !10, line: 25, baseType: !983, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!986, !54}
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !24, line: 25, size: 192, align: 8, elements: !987)
!987 = !{!612, !988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 25, baseType: !54, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !24, line: 25, baseType: !54, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !24, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !10, line: 25, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !54}
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !24, line: 25, size: 128, align: 8, elements: !996)
!996 = !{!997, !115}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 25, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !1000)
!1000 = !{!637, !658, !663, !664, !665, !1001, !918, !1006, !1007, !921, !1008, !926}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 25, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1005, !54}
!1005 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 25, baseType: !766, size: 64, align: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 25, baseType: !778, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 25, baseType: !1009, size: 64, align: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!55, !54, !995}
