; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22marbles_private\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22shim\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/shim\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./36.go", directory: "/home/ming/go/src/chaincode_repo/github/36")
!5 = !{!6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = distinct !DISubprogram(name: "command-line-arguments.MarblesPrivateChaincode.Init", linkageName: "command_x2dline_x2darguments.MarblesPrivateChaincode.Init", scope: null, file: !24, line: 37, type: !25, scopeLine: 37, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !46)
!24 = !DIFile(filename: "36.go", directory: ".")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !49, !49, !51}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !24, line: 14, size: 640, align: 8, elements: !28)
!28 = !{!29, !31, !38, !44, !47, !48}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !24, line: 14, baseType: !30, size: 32, align: 32)
!30 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !24, line: 14, baseType: !32, size: 128, align: 64, offset: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !33)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Payload", file: !24, line: 14, baseType: !39, size: 192, align: 64, offset: 192)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !40)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !35, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !24, line: 14, baseType: !45, align: 8, offset: 384)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !8, line: 1, align: 1, elements: !46)
!46 = !{}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !24, line: 14, baseType: !39, size: 192, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !24, line: 14, baseType: !30, size: 32, align: 32, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "MarblesPrivateChaincode", file: !24, line: 19, align: 1, elements: !46)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !24, line: 14, size: 128, align: 8, elements: !52)
!52 = !{!53, !401}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !56)
!56 = !{!57, !100, !123, !127, !131, !139, !147, !148, !149, !150, !167, !174, !1418, !1422, !1449, !1453, !1454, !1458, !1459, !1463, !1478, !1490, !1494, !1498, !1502, !1503, !1507, !1508, !1512, !1519, !1520, !1527, !1531, !1532, !1536, !1540, !1541, !1542, !1543}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 14, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !60)
!60 = !{!61, !63, !64, !66, !67, !68, !69, !70, !80, !81, !83, !99}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !65, size: 32, align: 32, offset: 128)
!65 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!13, !78, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "void")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !35, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !84, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !86)
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !82, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !82, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !90, size: 192, align: 64, offset: 128)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !91)
!91 = !{!92, !42, !43}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !95)
!95 = !{!87, !88, !96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 14, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !78, !32, !120}
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !32, size: 128, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !108, size: 128, align: 64, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !109)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !58, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!32, !78}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !121)
!121 = !{!122, !42, !43}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !82, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 14, baseType: !124, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!108, !78, !32, !32}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 14, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!108, !78, !32}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 14, baseType: !132, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !78}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !136)
!136 = !{!137, !42, !43}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 14, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !78}
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !39, size: 192, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 15, baseType: !108, size: 128, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 14, baseType: !140, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 14, baseType: !140, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 14, baseType: !151, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !78}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !156)
!156 = !{!157, !158, !159, !160, !162, !163, !164, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !37, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !161, size: 16, align: 16, offset: 80)
!161 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !65, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !62, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !78, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 14, baseType: !168, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !78}
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !172)
!172 = !{!106, !173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !120, size: 192, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 14, baseType: !175, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !78, !32}
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !179)
!179 = !{!180, !107}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !181, size: 128, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !24, line: 14, size: 128, align: 8, elements: !182)
!182 = !{!183, !401}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !186)
!186 = !{!57, !187, !191, !195}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 14, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!108, !78}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!13, !78}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 14, baseType: !196, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !78}
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !200)
!200 = !{!201, !901}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !24, line: 14, size: 704, align: 8, elements: !204)
!204 = !{!205, !206, !207, !1414, !1415, !1416, !1417}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !24, line: 14, baseType: !32, size: 128, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 14, baseType: !39, size: 192, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !24, line: 14, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !24, line: 14, size: 448, align: 8, elements: !210)
!210 = !{!211, !1409, !1410, !1411, !1413}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 14, baseType: !212, size: 64, align: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !24, line: 14, size: 64, align: 8, elements: !213)
!213 = !{!214, !216, !227, !233}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !24, line: 14, baseType: !215, align: 8)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !24, line: 14, align: 1, elements: !46)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !24, line: 14, baseType: !217, align: 64)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, align: 8, elements: !225)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!79}
!225 = !{!226}
!226 = !DISubrange(count: 0, lowerBound: 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !24, line: 14, baseType: !228, align: 32)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, align: 4, elements: !225)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !24, line: 14, size: 64, align: 4, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 14, baseType: !30, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !24, line: 14, baseType: !65, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !24, line: 14, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !24, line: 14, size: 2624, align: 8, elements: !236)
!236 = !{!237, !402, !1201, !1209, !1214, !1215, !1216, !1311}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !24, line: 14, baseType: !238, size: 128, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !24, line: 11, size: 128, align: 8, elements: !239)
!239 = !{!240, !401}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 11, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !243)
!243 = !{!244, !245, !249, !253, !254, !259, !260, !261, !265, !286, !287, !291, !299, !310, !311, !315, !316, !317, !322, !323, !372, !380, !381, !382, !383, !384, !385, !386, !387, !391, !392, !396, !397}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 11, baseType: !58, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!37, !78}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 11, baseType: !250, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!13, !78, !238}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 11, baseType: !255, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !78}
!258 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 11, baseType: !192, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 11, baseType: !250, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 11, baseType: !262, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!238, !78}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 11, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !78, !37}
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !24, line: 11, size: 832, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274, !279, !280, !285}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 11, baseType: !32, size: 128, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !24, line: 11, baseType: !32, size: 128, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !24, line: 11, baseType: !238, size: 128, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !24, line: 11, baseType: !275, size: 128, align: 64, offset: 384)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !24, line: 11, size: 128, align: 8, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !24, line: 1, baseType: !35, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !24, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !24, line: 11, baseType: !62, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 11, baseType: !281, size: 192, align: 64, offset: 576)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !282)
!282 = !{!283, !42, !43}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !24, line: 11, baseType: !13, size: 8, align: 8, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 11, baseType: !288, size: 64, align: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!269, !78, !281}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 11, baseType: !292, size: 64, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !78, !32}
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !269, size: 832, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 11, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!295, !78, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 11, size: 64, align: 8, elements: !305)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 11, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!13, !32}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 11, baseType: !250, size: 64, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 11, baseType: !312, size: 64, align: 64, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!238, !78, !37}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 11, baseType: !192, size: 64, align: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 11, baseType: !262, size: 64, align: 64, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 11, baseType: !318, size: 64, align: 64, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !78}
!321 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 1152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 11, baseType: !324, size: 64, align: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !78, !37}
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !24, line: 11, size: 640, align: 8, elements: !328)
!328 = !{!271, !272, !273, !329, !371}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !24, line: 11, baseType: !330, size: 192, align: 64, offset: 384)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !24, line: 11, size: 192, align: 8, elements: !331)
!331 = !{!332, !368, !369}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 11, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !24, line: 11, size: 512, align: 8, elements: !335)
!335 = !{!336, !337, !338, !339, !341, !342, !343, !344, !349, !350, !351, !367}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !24, line: 11, baseType: !62, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !24, line: 11, baseType: !62, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !24, line: 11, baseType: !65, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !24, line: 11, baseType: !340, size: 8, align: 8, offset: 160)
!340 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !24, line: 11, baseType: !16, size: 8, align: 8, offset: 168)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !24, line: 11, baseType: !16, size: 8, align: 8, offset: 176)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !24, line: 11, baseType: !16, size: 8, align: 8, offset: 184)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !24, line: 11, baseType: !345, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 11, size: 64, align: 8, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 11, baseType: !75, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !24, line: 11, baseType: !35, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !24, line: 11, baseType: !82, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !24, line: 11, baseType: !352, size: 64, align: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !24, line: 11, size: 320, align: 8, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 11, baseType: !82, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !24, line: 11, baseType: !82, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !24, line: 11, baseType: !358, size: 192, align: 64, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !359)
!359 = !{!360, !42, !43}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !24, line: 11, size: 320, align: 8, elements: !363)
!363 = !{!355, !356, !364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !24, line: 11, baseType: !78, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 11, baseType: !78, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !24, line: 11, baseType: !78, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !24, line: 11, baseType: !78, size: 64, align: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !24, line: 11, baseType: !78, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !24, line: 11, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !24, line: 11, baseType: !37, size: 64, align: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 11, baseType: !373, size: 64, align: 64, offset: 1280)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !78, !32}
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !327, size: 640, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 11, baseType: !13, size: 8, align: 8, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 11, baseType: !116, size: 64, align: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 11, baseType: !246, size: 64, align: 64, offset: 1600)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 11, baseType: !312, size: 64, align: 64, offset: 1664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 11, baseType: !116, size: 64, align: 64, offset: 1728)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 11, baseType: !388, size: 64, align: 64, offset: 1792)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!62, !78}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 11, baseType: !116, size: 64, align: 64, offset: 1856)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 11, baseType: !393, size: 64, align: 64, offset: 1920)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!333, !78}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 11, baseType: !116, size: 64, align: 64, offset: 1984)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 11, baseType: !398, size: 64, align: 64, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!352, !78}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !24, line: 14, baseType: !403, size: 128, align: 64, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !404)
!404 = !{!405, !401}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !408)
!408 = !{!57, !409, !1127, !1131, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1176, !1177, !1178, !1179, !1180, !1184, !1198, !1199, !1200}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 14, baseType: !410, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !78}
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !414)
!414 = !{!415, !401}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !418)
!418 = !{!57, !419, !1123, !571, !572}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !420, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !78, !440}
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !424)
!424 = !{!425, !401}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !428)
!428 = !{!57, !429, !434, !435, !436, !441, !1057, !548, !744, !1058, !1062, !1080, !752, !1101}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !78}
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !24, line: 14, size: 128, align: 8, elements: !276)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !78}
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !24, line: 14, size: 128, align: 8, elements: !276)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !442, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !78}
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !24, line: 14, size: 128, align: 8, elements: !446)
!446 = !{!447, !401}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !450)
!450 = !{!57, !451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 14, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !78}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !24, line: 14, size: 128, align: 8, elements: !456)
!456 = !{!457, !401}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !460)
!460 = !{!57, !461, !823, !824, !828, !835, !839, !840, !841, !842, !843, !844, !1021, !1032, !1036, !1040, !1053}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 14, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!79, !78, !465}
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !466)
!466 = !{!467, !401}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !470)
!470 = !{!57, !471, !476, !480, !753, !762, !783, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !805, !809, !810, !811, !812, !816, !817, !818, !819, !820, !821, !822}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 14, baseType: !472, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!475, !78}
!475 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!403, !78}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 14, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !78}
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !485)
!485 = !{!486, !401}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !489)
!489 = !{!57, !490, !530, !531, !532, !533, !534, !535, !536, !746, !747, !748, !752}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 14, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !78}
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !495)
!495 = !{!496, !401}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !499)
!499 = !{!57, !500, !504, !508, !513, !514, !518, !519}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 14, baseType: !501, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!465, !78, !32}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !505, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!465, !78, !440}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 14, baseType: !509, size: 64, align: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!465, !78, !512}
!512 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 14, baseType: !501, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !515, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!465, !78, !37}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!79, !78, !523}
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !24, line: 14, size: 128, align: 8, elements: !524)
!524 = !{!525, !401}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !528)
!528 = !{!57, !529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !537, size: 64, align: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !78}
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !24, line: 14, size: 128, align: 8, elements: !541)
!541 = !{!542, !401}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !545)
!545 = !{!57, !429, !434, !435, !436, !546, !547, !548, !744, !745}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !549, size: 64, align: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !78}
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !553)
!553 = !{!554, !401}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !557)
!557 = !{!57, !558, !559, !573, !574, !595, !596, !597, !615, !616, !617, !618, !619, !620, !621, !622, !626, !702, !743}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 14, baseType: !560, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !78}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !564)
!564 = !{!565, !401}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !568)
!568 = !{!57, !569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !505, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !515, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 14, baseType: !575, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !78}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !24, line: 14, size: 128, align: 8, elements: !579)
!579 = !{!580, !401}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !583)
!583 = !{!57, !584, !593, !594}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !585, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !78, !37}
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !24, line: 14, size: 192, align: 8, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !24, line: 14, baseType: !552, size: 128, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !24, line: 14, baseType: !13, size: 8, align: 8, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !24, line: 14, baseType: !13, size: 8, align: 8, offset: 136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 14, baseType: !598, size: 64, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!601, !78}
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !602)
!602 = !{!603, !401}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !606)
!606 = !{!57, !607, !611, !571, !572}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !608, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!403, !78, !440}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !612, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!403, !78, !37}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !623, size: 64, align: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!79, !78, !552}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 14, baseType: !627, size: 64, align: 64, offset: 1024)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !78}
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !631)
!631 = !{!632, !401}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !635)
!635 = !{!57, !636, !698, !571, !572}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!640, !78, !440}
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !641)
!641 = !{!642, !401}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !645)
!645 = !{!57, !429, !434, !435, !646, !688, !689, !690, !691, !692, !693, !697}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 14, baseType: !647, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !78}
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !24, line: 14, size: 128, align: 8, elements: !651)
!651 = !{!652, !401}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !655)
!655 = !{!57, !656, !684, !571, !572}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 14, baseType: !657, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !78, !440}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !661)
!661 = !{!662, !401}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !665)
!665 = !{!57, !429, !434, !666, !532, !667, !668, !669, !670, !671, !672, !673, !674, !675, !679}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !676, size: 64, align: 64, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!79, !78, !660}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !78}
!683 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !685, size: 64, align: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!660, !78, !37}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !694, size: 64, align: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!79, !78, !640}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !699, size: 64, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!640, !78, !37}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 14, baseType: !703, size: 64, align: 64, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!706, !78}
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !24, line: 14, size: 128, align: 8, elements: !707)
!707 = !{!708, !401}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 384, align: 8, elements: !711)
!711 = !{!57, !712, !733, !737, !741, !742}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !10, line: 14, baseType: !713, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !78, !540}
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !24, line: 14, size: 960, align: 8, elements: !717)
!717 = !{!718, !725, !726, !727, !728, !729, !730, !731, !732}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 14, baseType: !719, size: 192, align: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !24, line: 14, size: 192, align: 8, elements: !720)
!720 = !{!721, !723, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !24, line: 14, baseType: !37, size: 64, align: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !24, line: 14, baseType: !37, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !24, line: 14, baseType: !37, size: 64, align: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !24, line: 14, baseType: !37, size: 64, align: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingDetachedComments", file: !24, line: 14, baseType: !120, size: 192, align: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingComments", file: !24, line: 14, baseType: !32, size: 128, align: 64, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComments", file: !24, line: 14, baseType: !32, size: 128, align: 64, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !24, line: 14, baseType: !37, size: 64, align: 64, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ByPath", file: !10, line: 14, baseType: !734, size: 64, align: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!716, !78, !719}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !738, size: 64, align: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!716, !78, !37}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !549, size: 64, align: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !749, size: 64, align: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!79, !78, !484}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Default", file: !10, line: 14, baseType: !754, size: 64, align: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !78}
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !24, line: 14, size: 192, align: 8, elements: !758)
!758 = !{!216, !759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 14, baseType: !78, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !24, line: 14, baseType: !78, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "num", file: !24, line: 14, baseType: !22, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultEnumValue", file: !10, line: 14, baseType: !763, size: 64, align: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !78}
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumValueDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !767)
!767 = !{!768, !401}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)EnumNumber,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumValueDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !771)
!771 = !{!57, !429, !434, !435, !436, !772, !689, !777, !778, !692, !779, !697}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !773, size: 64, align: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !78}
!776 = !DIBasicType(name: "EnumNumber", size: 32, encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !537, size: 64, align: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !549, size: 64, align: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !780, size: 64, align: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!79, !78, !766}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 14, baseType: !784, size: 64, align: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!423, !78}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 896)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 14, baseType: !801, size: 64, align: 64, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !78}
!804 = !DIBasicType(name: "Kind", size: 8, encoding: DW_ATE_signed)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 14, baseType: !806, size: 64, align: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!465, !78}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 14, baseType: !806, size: 64, align: 64, offset: 1408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 1472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 1536)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !813, size: 64, align: 64, offset: 1600)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!512, !78}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 1664)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !537, size: 64, align: 64, offset: 1728)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !549, size: 64, align: 64, offset: 1792)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 1920)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 1984)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 2048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 14, baseType: !825, size: 64, align: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!757, !78, !465}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "GetUnknown", file: !10, line: 14, baseType: !829, size: 64, align: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!832, !78}
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawFields", file: !24, line: 14, size: 192, align: 8, elements: !833)
!833 = !{!834, !723, !724}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !35, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Has", file: !10, line: 14, baseType: !836, size: 64, align: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!13, !78, !465}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "IsValid", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Mutable", file: !10, line: 14, baseType: !825, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "NewField", file: !10, line: 14, baseType: !825, size: 64, align: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMethods", file: !10, line: 14, baseType: !845, size: 64, align: 64, offset: 704)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !78}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor}", file: !10, size: 384, align: 8, elements: !850)
!850 = !{!851, !852, !853, !868, !887, !993, !1005}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !10, line: 14, baseType: !215, align: 8)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !22, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 14, baseType: !854, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !856)
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!861, !864}
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,int}", file: !10, size: 64, align: 8, elements: !862)
!862 = !{!851, !863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 14, baseType: !37, size: 64, align: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,uint8}", file: !10, size: 192, align: 8, elements: !865)
!865 = !{!851, !866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !455, size: 128, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !10, line: 14, baseType: !869, size: 64, align: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !883}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,struct{*uint8,int,int}},error}", file: !10, size: 320, align: 8, elements: !877)
!877 = !{!878, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !879, size: 192, align: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,struct{*uint8,int,int}}", file: !10, size: 192, align: 8, elements: !880)
!880 = !{!851, !881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 14, baseType: !39, size: 192, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !108, size: 128, align: 64, offset: 192)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8}", file: !10, size: 384, align: 8, elements: !884)
!884 = !{!851, !866, !885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", file: !10, line: 14, baseType: !39, size: 192, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !10, line: 14, baseType: !888, size: 64, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !902}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{NoUnkeyedLiterals,uint8},error}", file: !10, size: 192, align: 8, elements: !896)
!896 = !{!897, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !898, size: 8, align: 8)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,uint8}", file: !10, size: 8, align: 1, elements: !899)
!899 = !{!851, !900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 14, baseType: !16, size: 8, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !108, size: 128, align: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{NoUnkeyedLiterals,Message,struct{*uint8,int,int},uint8,struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void},int}", file: !10, size: 576, align: 8, elements: !903)
!903 = !{!851, !866, !885, !886, !904, !992}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Resolver", file: !10, line: 14, baseType: !905, size: 128, align: 64, offset: 384)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}},*void}", file: !10, size: 128, align: 8, elements: !906)
!906 = !{!907, !991}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 14, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FullName)struct{ExtensionType,error},*func(*void,FullName,Number)struct{ExtensionType,error}}", file: !10, size: 192, align: 8, elements: !910)
!910 = !{!57, !911, !987}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "FindExtensionByName", file: !10, line: 14, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!915, !78, !433}
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ExtensionType,error}", file: !10, size: 256, align: 8, elements: !916)
!916 = !{!917, !107}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 14, baseType: !918, size: 128, align: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionType", file: !24, line: 14, size: 128, align: 8, elements: !919)
!919 = !{!920, !401}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Value)any,*func(*void,any)bool,*func(*void,Value)bool,*func(*void)Value,*func(*void)ExtensionTypeDescriptor,*func(*void,any)Value,*func(*void)Value}", file: !10, size: 512, align: 8, elements: !923)
!923 = !{!57, !924, !931, !935, !939, !940, !982, !986}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceOf", file: !10, line: 14, baseType: !925, size: 64, align: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !78, !757}
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !24, line: 15, size: 128, align: 8, elements: !929)
!929 = !{!930, !401}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !58, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidInterface", file: !10, line: 14, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!13, !78, !928}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "IsValidValue", file: !10, line: 14, baseType: !936, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!13, !78, !757}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !10, line: 14, baseType: !754, size: 64, align: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "TypeDescriptor", file: !10, line: 14, baseType: !941, size: 64, align: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !78}
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionTypeDescriptor", file: !24, line: 14, size: 128, align: 8, elements: !945)
!945 = !{!946, !401}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)FieldDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string,*func(*void)ExtensionType}", file: !10, size: 2240, align: 8, elements: !949)
!949 = !{!57, !471, !476, !480, !753, !762, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", file: !10, line: 14, baseType: !806, size: 64, align: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", file: !10, line: 14, baseType: !784, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 14, baseType: !430, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "HasDefault", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "HasJSONName", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "HasOptionalKeyword", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "HasPresence", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 14, baseType: !246, size: 64, align: 64, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "IsExtension", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "IsList", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IsMap", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IsPacked", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !10, line: 14, baseType: !192, size: 64, align: 64, offset: 1216)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "JSONName", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 1280)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 14, baseType: !801, size: 64, align: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "MapKey", file: !10, line: 14, baseType: !806, size: 64, align: 64, offset: 1408)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "MapValue", file: !10, line: 14, baseType: !806, size: 64, align: 64, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !10, line: 14, baseType: !477, size: 64, align: 64, offset: 1536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 14, baseType: !437, size: 64, align: 64, offset: 1600)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Number", file: !10, line: 14, baseType: !813, size: 64, align: 64, offset: 1664)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 14, baseType: !78, size: 64, align: 64, offset: 1728)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 14, baseType: !537, size: 64, align: 64, offset: 1792)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 14, baseType: !549, size: 64, align: 64, offset: 1856)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 14, baseType: !520, size: 64, align: 64, offset: 1920)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 14, baseType: !462, size: 64, align: 64, offset: 1984)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 14, baseType: !680, size: 64, align: 64, offset: 2048)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "TextName", file: !10, line: 14, baseType: !116, size: 64, align: 64, offset: 2112)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 14, baseType: !979, size: 64, align: 64, offset: 2176)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!918, !78}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ValueOf", file: !10, line: 14, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!757, !78, !928}
