; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22chaincode\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22statebased\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/hyperledger/fabric-chaincode-go/pkg/statebased\22"
module asm "\09.ascii \22 \\\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./70.go", directory: "/home/ming/go/src/chaincode_repo/github/70")
!5 = !{!6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !8, line: 1, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "<built-in>", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !10, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "", directory: "")
!11 = !{!12, !14, !19, !20, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !10, line: 1, baseType: !13, size: 8, align: 8)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !10, line: 1, baseType: !15, size: 24, align: 8, offset: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 1, elements: !17)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18}
!18 = !DISubrange(count: 3, lowerBound: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !10, line: 1, baseType: !13, size: 8, align: 8, offset: 40)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = distinct !DISubprogram(name: "command_x2dline_x2darguments.SmartContract..eq", scope: null, file: !8, line: 1, type: !24, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!24 = !DISubroutineType(types: !25)
!25 = !{!13, !26, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "void")
!28 = !{}
!29 = !DILocalVariable(name: "key1", arg: 1, scope: !23, file: !8, line: 1, type: !26)
!30 = !DILocation(line: 0, scope: !23)
!31 = !DILocalVariable(name: "key2", arg: 2, scope: !23, file: !8, line: 1, type: !26)
!32 = !DILocalVariable(name: "$ret59", scope: !23, file: !8, line: 1, type: !13)
!33 = !DILocation(line: 1, column: 1, scope: !23)
!34 = distinct !DISubprogram(name: "command-line-arguments.SmartContract.AddToACL", linkageName: "command_x2dline_x2darguments.SmartContract.AddToACL", scope: null, file: !35, line: 148, type: !36, scopeLine: 148, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !28)
!35 = !DIFile(filename: "70.go", directory: ".")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !96, !96, !1797, !67, !67, !67}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !8, line: 1, size: 128, align: 8, elements: !39)
!39 = !{!40, !95}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 1, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !10, size: 128, align: 8, elements: !43)
!43 = !{!44, !91}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !8, line: 1, size: 512, align: 8, elements: !47)
!47 = !{!48, !50, !51, !53, !54, !55, !56, !57, !63, !65, !72, !90}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !8, line: 1, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !8, line: 1, baseType: !52, size: 32, align: 32, offset: 128)
!52 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 184)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !8, line: 1, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !8, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !8, line: 1, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !8, line: 1, size: 128, align: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !8, line: 1, baseType: !64, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !8, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !8, line: 1, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !8, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 1, baseType: !66, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !8, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !8, line: 1, baseType: !79, size: 192, align: 64, offset: 128)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !10, size: 192, align: 8, elements: !80)
!80 = !{!81, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !8, line: 1, size: 320, align: 8, elements: !84)
!84 = !{!76, !77, !85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !71, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 1, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!67, !26}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmartContract", file: !35, line: 21, size: 1152, align: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Contract", file: !35, line: 22, baseType: !100, size: 1152, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Contract", file: !35, line: 13, size: 1152, align: 8, elements: !101)
!101 = !{!102, !103, !119, !124, !125, !126}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !35, line: 13, baseType: !67, size: 128, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !35, line: 13, baseType: !104, size: 512, align: 64, offset: 128)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "InfoMetadata", file: !35, line: 13, size: 512, align: 8, elements: !105)
!105 = !{!106, !107, !108, !114, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !35, line: 13, baseType: !67, size: 128, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !35, line: 13, baseType: !109, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ContactMetadata", file: !35, line: 13, size: 384, align: 8, elements: !111)
!111 = !{!102, !112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "License", file: !35, line: 13, baseType: !115, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "LicenseMetadata", file: !35, line: 13, size: 256, align: 8, elements: !117)
!117 = !{!102, !112}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownTransaction", file: !35, line: 13, baseType: !120, size: 128, align: 64, offset: 640)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !35, line: 8, size: 128, align: 8, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 1, baseType: !45, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !35, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeTransaction", file: !35, line: 13, baseType: !120, size: 128, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AfterTransaction", file: !35, line: 13, baseType: !120, size: 128, align: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionContextHandler", file: !35, line: 13, baseType: !127, size: 128, align: 64, offset: 1024)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "SettableTransactionContextInterface", file: !35, line: 13, size: 128, align: 8, elements: !128)
!128 = !{!129, !123}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 13, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ClientIdentity)void,*func(*void,ChaincodeStubInterface)void}", file: !10, size: 192, align: 8, elements: !132)
!132 = !{!133, !134, !359}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 13, baseType: !45, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "SetClientIdentity", file: !10, line: 13, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!27, !26, !138}
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientIdentity", file: !35, line: 13, size: 128, align: 8, elements: !139)
!139 = !{!140, !123}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 13, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,string)error,*func(*void,string)struct{string,bool,error},*func(*void)struct{string,error},*func(*void)struct{string,error},*func(*void)struct{*Certificate,error}}", file: !10, size: 384, align: 8, elements: !143)
!143 = !{!133, !144, !148, !157, !165, !166}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "AssertAttributeValue", file: !10, line: 13, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!38, !26, !67, !67}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributeValue", file: !10, line: 13, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !26, !67}
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool,error}", file: !10, size: 320, align: 8, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !10, line: 13, baseType: !67, size: 128, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "found", file: !10, line: 13, baseType: !13, size: 8, align: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 13, baseType: !38, size: 128, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "GetID", file: !10, line: 13, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !26}
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !10, size: 256, align: 8, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !67, size: 128, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !38, size: 128, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "GetMSPID", file: !10, line: 13, baseType: !158, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "GetX509Certificate", file: !10, line: 13, baseType: !167, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !26}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !10, size: 192, align: 8, elements: !171)
!171 = !{!172, !358}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !35, line: 13, size: 10624, align: 8, elements: !175)
!175 = !{!176, !180, !181, !182, !183, !184, !185, !187, !189, !190, !191, !204, !233, !234, !269, !270, !272, !282, !283, !288, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !313, !337, !338, !339, !340, !351, !352, !353, !354, !355, !356, !357}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !35, line: 13, baseType: !177, size: 192, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !10, size: 192, align: 8, elements: !178)
!178 = !{!179, !88, !89}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !64, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !35, line: 13, baseType: !186, size: 64, align: 64, offset: 1152)
!186 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !35, line: 13, baseType: !188, size: 64, align: 64, offset: 1216)
!188 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !35, line: 13, baseType: !120, size: 128, align: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !35, line: 13, baseType: !71, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !35, line: 13, baseType: !192, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !35, line: 13, size: 256, align: 8, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !35, line: 13, baseType: !13, size: 8, align: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !35, line: 13, baseType: !197, size: 192, align: 64, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !35, line: 13, size: 192, align: 8, elements: !198)
!198 = !{!199, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !35, line: 13, baseType: !205, size: 1984, align: 64, offset: 1536)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !35, line: 13, size: 1984, align: 8, elements: !206)
!206 = !{!207, !211, !212, !213, !214, !215, !216, !217, !218, !219, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !35, line: 13, baseType: !208, size: 192, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !10, size: 192, align: 8, elements: !209)
!209 = !{!210, !88, !89}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !66, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !35, line: 13, baseType: !220, size: 192, align: 64, offset: 1600)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !10, size: 192, align: 8, elements: !221)
!221 = !{!222, !88, !89}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !35, line: 13, size: 320, align: 8, elements: !225)
!225 = !{!226, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !35, line: 13, baseType: !227, size: 192, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !35, line: 13, size: 192, align: 8, elements: !228)
!228 = !{!229, !202, !203}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !35, line: 13, baseType: !120, size: 128, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !35, line: 13, baseType: !220, size: 192, align: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !35, line: 13, baseType: !205, size: 1984, align: 64, offset: 3520)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !35, line: 13, baseType: !235, size: 192, align: 64, offset: 5504)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !35, line: 8, size: 192, align: 8, elements: !236)
!236 = !{!237, !238, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !35, line: 8, baseType: !22, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !35, line: 8, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !35, line: 8, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !35, line: 8, size: 832, align: 8, elements: !243)
!243 = !{!244, !245, !254, !265, !266, !267, !268}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !35, line: 8, baseType: !67, size: 128, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !35, line: 8, baseType: !246, size: 192, align: 64, offset: 128)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !10, size: 192, align: 8, elements: !247)
!247 = !{!248, !88, !89}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !35, line: 8, size: 256, align: 8, elements: !251)
!251 = !{!244, !252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !35, line: 8, baseType: !71, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !35, line: 8, baseType: !13, size: 8, align: 8, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !35, line: 8, baseType: !255, size: 192, align: 64, offset: 320)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !10, size: 192, align: 8, elements: !256)
!256 = !{!257, !88, !89}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !35, line: 8, size: 128, align: 8, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !35, line: 8, baseType: !239, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !35, line: 8, baseType: !16, size: 8, align: 8, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !35, line: 8, baseType: !13, size: 8, align: 8, offset: 72)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !35, line: 8, baseType: !13, size: 8, align: 8, offset: 80)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !35, line: 8, baseType: !67, size: 128, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !35, line: 8, baseType: !239, size: 64, align: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !35, line: 8, baseType: !239, size: 64, align: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !35, line: 8, baseType: !249, size: 64, align: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !35, line: 13, baseType: !235, size: 192, align: 64, offset: 5696)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !35, line: 13, baseType: !271, size: 64, align: 64, offset: 5888)
!271 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !35, line: 13, baseType: !273, size: 192, align: 64, offset: 5952)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !10, size: 192, align: 8, elements: !274)
!274 = !{!275, !88, !89}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !35, line: 13, size: 448, align: 8, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !35, line: 13, baseType: !227, size: 192, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !35, line: 13, baseType: !273, size: 192, align: 64, offset: 6144)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !35, line: 13, baseType: !284, size: 192, align: 64, offset: 6336)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !10, size: 192, align: 8, elements: !285)
!285 = !{!286, !88, !89}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !35, line: 13, baseType: !289, size: 192, align: 64, offset: 6528)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !10, size: 192, align: 8, elements: !290)
!290 = !{!291, !88, !89}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !35, line: 13, baseType: !284, size: 192, align: 64, offset: 6720)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 6912)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 6920)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !35, line: 13, baseType: !71, size: 64, align: 64, offset: 6976)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 7040)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 7104)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !35, line: 13, baseType: !177, size: 192, align: 64, offset: 7296)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 7488)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 7680)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 7872)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 8064)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !35, line: 13, baseType: !306, size: 192, align: 64, offset: 8256)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !10, size: 192, align: 8, elements: !307)
!307 = !{!308, !88, !89}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !35, line: 13, size: 192, align: 8, elements: !311)
!311 = !{!312, !202, !203}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !64, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !35, line: 13, baseType: !314, size: 192, align: 64, offset: 8448)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !10, size: 192, align: 8, elements: !315)
!315 = !{!316, !88, !89}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !35, line: 13, size: 1152, align: 8, elements: !320)
!320 = !{!321, !322, !323, !330, !331, !332, !333, !334, !335, !336}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !35, line: 13, baseType: !67, size: 128, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !35, line: 13, baseType: !324, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !35, line: 13, size: 320, align: 8, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !35, line: 13, baseType: !67, size: 128, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !35, line: 13, baseType: !67, size: 128, align: 64, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !35, line: 13, baseType: !13, size: 8, align: 8, offset: 8640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 8704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 8896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !35, line: 13, baseType: !341, size: 192, align: 64, offset: 9088)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !10, size: 192, align: 8, elements: !342)
!342 = !{!343, !88, !89}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !35, line: 13, size: 384, align: 8, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !35, line: 13, baseType: !310, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !35, line: 13, baseType: !350, size: 192, align: 64, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !35, line: 13, size: 192, align: 8, elements: !311)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !35, line: 13, baseType: !341, size: 192, align: 64, offset: 9280)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 9472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 9664)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 9856)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 10048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !35, line: 13, baseType: !208, size: 192, align: 64, offset: 10240)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !35, line: 13, baseType: !284, size: 192, align: 64, offset: 10432)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 13, baseType: !38, size: 128, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "SetStub", file: !10, line: 13, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!27, !26, !363}
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaincodeStubInterface", file: !35, line: 12, size: 128, align: 8, elements: !364)
!364 = !{!365, !123}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*string,int,int})struct{string,error},*func(*void,string,string)error,*func(*void,string)error,*func(*void)struct{*struct{*uint8,int,int},int,int},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)struct{struct{*uint8,int,int},error},*func(*void)string,*func(*void)struct{struct{*uint8,int,int},error},*func(*void)Values,*func(*void)struct{string,struct{*string,int,int}},*func(*void,string)struct{HistoryQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string)struct{struct{*uint8,int,int},error},*func(*void,string)struct{StateQueryIteratorInterface,error},*func(*void,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void)struct{*SignedProposal,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void,string,struct{*string,int,int})struct{StateQueryIteratorInterface,error},*func(*void,string,struct{*string,int,int},int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string,string)struct{StateQueryIteratorInterface,error},*func(*void,string,string,int32,string)struct{StateQueryIteratorInterface,*QueryResponseMetadata,error},*func(*void,string)struct{struct{*uint8,int,int},error},*func(*void)struct{*string,int,int},*func(*void)struct{Values,error},*func(*void)string,*func(*void)struct{*Timestamp,error},*func(*void,string,struct{*struct{*uint8,int,int},int,int},string)Response,*func(*void,string,string)error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string,string,struct{*uint8,int,int})error,*func(*void,string,struct{*uint8,int,int})error,*func(*void,string)struct{string,struct{*string,int,int},error}}", file: !10, size: 2496, align: 8, elements: !368)
!368 = !{!369, !370, !374, !375, !379, !387, !395, !396, !397, !398, !415, !422, !1657, !1661, !1688, !1692, !1693, !1697, !1698, !1702, !1717, !1732, !1736, !1740, !1744, !1745, !1749, !1750, !1754, !1761, !1762, !1769, !1778, !1779, !1783, !1787, !1788, !1789, !1790}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 12, baseType: !45, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "CreateCompositeKey", file: !10, line: 12, baseType: !371, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!161, !26, !67, !208}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DelPrivateData", file: !10, line: 12, baseType: !145, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DelState", file: !10, line: 12, baseType: !376, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!38, !26, !67}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgs", file: !10, line: 12, baseType: !380, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !26}
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !10, size: 192, align: 8, elements: !384)
!384 = !{!385, !88, !89}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "GetArgsSlice", file: !10, line: 12, baseType: !388, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!391, !26}
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !10, size: 320, align: 8, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !177, size: 192, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !38, size: 128, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GetBinding", file: !10, line: 12, baseType: !388, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "GetChannelID", file: !10, line: 12, baseType: !92, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "GetCreator", file: !10, line: 12, baseType: !388, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "GetDecorations", file: !10, line: 12, baseType: !399, size: 64, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !26}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !8, line: 1, size: 384, align: 8, elements: !404)
!404 = !{!405, !406, !407, !408, !410, !411, !412, !413, !414}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !71, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !8, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !8, line: 1, baseType: !409, size: 16, align: 16, offset: 80)
!409 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !8, line: 1, baseType: !52, size: 32, align: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !8, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !8, line: 1, baseType: !26, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GetFunctionAndParameters", file: !10, line: 12, baseType: !416, size: 64, align: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !26}
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,struct{*string,int,int}}", file: !10, size: 320, align: 8, elements: !420)
!420 = !{!163, !421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !208, size: 192, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "GetHistoryForKey", file: !10, line: 12, baseType: !423, size: 64, align: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !26, !67}
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{HistoryQueryIteratorInterface,error}", file: !10, size: 256, align: 8, elements: !427)
!427 = !{!428, !164}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !429, size: 128, align: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "HistoryQueryIteratorInterface", file: !35, line: 12, size: 128, align: 8, elements: !430)
!430 = !{!431, !123}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)bool,*func(*void)struct{*KeyModification,error}}", file: !10, size: 256, align: 8, elements: !434)
!434 = !{!369, !435, !439, !443}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 12, baseType: !436, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!38, !26}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "HasNext", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!13, !26}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 12, baseType: !444, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !26}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*KeyModification,error}", file: !10, size: 192, align: 8, elements: !448)
!448 = !{!449, !1143}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 12, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyModification", file: !35, line: 12, size: 704, align: 8, elements: !452)
!452 = !{!453, !454, !455, !1652, !1653, !1655, !1656}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "TxId", file: !35, line: 12, baseType: !67, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !35, line: 12, baseType: !177, size: 192, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !35, line: 12, baseType: !456, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !35, line: 12, size: 448, align: 8, elements: !458)
!458 = !{!459, !1648, !1649, !1650, !1651}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !35, line: 12, baseType: !460, size: 64, align: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageState", file: !35, line: 12, size: 64, align: 8, elements: !461)
!461 = !{!462, !464, !475, !482}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "NoUnkeyedLiterals", file: !35, line: 12, baseType: !463, align: 8)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoUnkeyedLiterals", file: !35, line: 12, align: 1, elements: !28)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCompare", file: !35, line: 12, baseType: !465, align: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, align: 8, elements: !473)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 12, size: 64, align: 8, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 12, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!27}
!473 = !{!474}
!474 = !DISubrange(count: 0, lowerBound: 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotCopy", file: !35, line: 12, baseType: !476, align: 32)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, align: 4, elements: !473)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !35, line: 12, size: 64, align: 4, elements: !478)
!478 = !{!479, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !35, line: 12, baseType: !480, size: 32, align: 32)
!480 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !35, line: 12, baseType: !52, size: 32, align: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "atomicMessageInfo", file: !35, line: 12, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageInfo", file: !35, line: 12, size: 2624, align: 8, elements: !485)
!485 = !{!486, !649, !1440, !1448, !1453, !1454, !1455, !1550}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "GoReflectType", file: !35, line: 12, baseType: !487, size: 128, align: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !35, line: 5, size: 128, align: 8, elements: !488)
!488 = !{!489, !123}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 5, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !10, size: 2112, align: 8, elements: !492)
!492 = !{!493, !494, !498, !502, !503, !508, !509, !510, !514, !534, !535, !539, !547, !558, !559, !563, !564, !565, !570, !571, !620, !628, !629, !630, !631, !632, !633, !634, !635, !639, !640, !644, !645}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 5, baseType: !45, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!71, !26}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !10, line: 5, baseType: !499, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!13, !26, !487}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !10, line: 5, baseType: !504, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !26}
!507 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !10, line: 5, baseType: !440, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !10, line: 5, baseType: !499, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !10, line: 5, baseType: !511, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!487, !26}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !10, line: 5, baseType: !515, size: 64, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!518, !26, !71}
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !35, line: 5, size: 832, align: 8, elements: !519)
!519 = !{!520, !521, !522, !523, !528, !529, !533}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !35, line: 5, baseType: !67, size: 128, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !35, line: 5, baseType: !67, size: 128, align: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !35, line: 5, baseType: !487, size: 128, align: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !35, line: 5, baseType: !524, size: 128, align: 64, offset: 384)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !35, line: 5, size: 128, align: 8, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !35, line: 1, baseType: !64, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !35, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !35, line: 5, baseType: !49, size: 64, align: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !35, line: 5, baseType: !530, size: 192, align: 64, offset: 576)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !10, size: 192, align: 8, elements: !531)
!531 = !{!532, !88, !89}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !230, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !35, line: 5, baseType: !13, size: 8, align: 8, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !10, line: 5, baseType: !536, size: 64, align: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!518, !26, !530}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !10, line: 5, baseType: !540, size: 64, align: 64, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !26, !67}
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !10, size: 896, align: 8, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 5, baseType: !518, size: 832, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 5, baseType: !13, size: 8, align: 8, offset: 832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !10, line: 5, baseType: !548, size: 64, align: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!543, !26, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 5, size: 64, align: 8, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 5, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!13, !67}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !10, line: 5, baseType: !499, size: 64, align: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !10, line: 5, baseType: !560, size: 64, align: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!487, !26, !71}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !10, line: 5, baseType: !440, size: 64, align: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 5, baseType: !511, size: 64, align: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !10, line: 5, baseType: !566, size: 64, align: 64, offset: 1088)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !26}
!569 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 5, baseType: !572, size: 64, align: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!575, !26, !71}
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !35, line: 5, size: 640, align: 8, elements: !576)
!576 = !{!520, !521, !522, !577, !619}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !35, line: 5, baseType: !578, size: 192, align: 64, offset: 384)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !35, line: 5, size: 192, align: 8, elements: !579)
!579 = !{!580, !616, !617}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !35, line: 5, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !35, line: 5, size: 512, align: 8, elements: !583)
!583 = !{!584, !585, !586, !587, !589, !590, !591, !592, !597, !598, !599, !615}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !35, line: 5, baseType: !49, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !35, line: 5, baseType: !49, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !35, line: 5, baseType: !52, size: 32, align: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !35, line: 5, baseType: !588, size: 8, align: 8, offset: 160)
!588 = !DIBasicType(name: ".reflect.tflag", size: 8, encoding: DW_ATE_unsigned)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !35, line: 5, baseType: !16, size: 8, align: 8, offset: 168)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !35, line: 5, baseType: !16, size: 8, align: 8, offset: 176)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !35, line: 5, baseType: !16, size: 8, align: 8, offset: 184)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !35, line: 5, baseType: !593, size: 64, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !35, line: 5, size: 64, align: 8, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !35, line: 5, baseType: !62, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !35, line: 5, baseType: !64, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !35, line: 5, baseType: !66, size: 64, align: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !35, line: 5, baseType: !600, size: 64, align: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !35, line: 5, size: 320, align: 8, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !35, line: 5, baseType: !66, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !35, line: 5, baseType: !66, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !35, line: 5, baseType: !606, size: 192, align: 64, offset: 128)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !10, size: 192, align: 8, elements: !607)
!607 = !{!608, !88, !89}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !35, line: 5, size: 320, align: 8, elements: !611)
!611 = !{!603, !604, !612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !35, line: 5, baseType: !26, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !35, line: 5, baseType: !26, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !35, line: 5, baseType: !26, size: 64, align: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !35, line: 5, baseType: !26, size: 64, align: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !35, line: 5, baseType: !26, size: 64, align: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !35, line: 5, baseType: !618, size: 64, align: 64, offset: 128)
!618 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !35, line: 5, baseType: !71, size: 64, align: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !10, line: 5, baseType: !621, size: 64, align: 64, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!624, !26, !67}
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !10, size: 704, align: 8, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 5, baseType: !575, size: 640, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !10, line: 5, baseType: !13, size: 8, align: 8, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 5, baseType: !92, size: 64, align: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 1536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !10, line: 5, baseType: !495, size: 64, align: 64, offset: 1600)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 5, baseType: !560, size: 64, align: 64, offset: 1664)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !10, line: 5, baseType: !92, size: 64, align: 64, offset: 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !10, line: 5, baseType: !636, size: 64, align: 64, offset: 1792)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!49, !26}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !10, line: 5, baseType: !92, size: 64, align: 64, offset: 1856)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !10, line: 5, baseType: !641, size: 64, align: 64, offset: 1920)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!581, !26}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !10, line: 5, baseType: !92, size: 64, align: 64, offset: 1984)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !10, line: 5, baseType: !646, size: 64, align: 64, offset: 2048)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!600, !26}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Desc", file: !35, line: 12, baseType: !650, size: 128, align: 64, offset: 128)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !651)
!651 = !{!652, !123}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void,int)ProtoMessage,*func(*void)FieldRanges,*func(*void)ExtensionDescriptors,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)OneofDescriptors,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MessageDescriptor)void,*func(*void)FieldNumbers,*func(*void)Names,*func(*void)FieldRanges,*func(*void)Syntax}", file: !10, size: 1408, align: 8, elements: !655)
!655 = !{!369, !656, !1366, !1370, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1415, !1416, !1417, !1418, !1419, !1423, !1437, !1438, !1439}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 12, baseType: !657, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !26}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !661)
!661 = !{!662, !123}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)EnumDescriptor,*func(*void,int)EnumDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !665)
!665 = !{!369, !666, !1362, !818, !819}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !667, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !26, !687}
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "EnumDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !671)
!671 = !{!672, !123}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,EnumDescriptor)void,*func(*void)Names,*func(*void)EnumRanges,*func(*void)Syntax,*func(*void)EnumValueDescriptors}", file: !10, size: 896, align: 8, elements: !675)
!675 = !{!369, !676, !681, !682, !683, !688, !1296, !795, !989, !1297, !1301, !1319, !997, !1340}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 12, baseType: !677, size: 64, align: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !26}
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "FullName", file: !35, line: 12, size: 128, align: 8, elements: !525)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 12, baseType: !684, size: 64, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !26}
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !35, line: 12, size: 128, align: 8, elements: !525)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !689, size: 64, align: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !26}
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProtoMessage", file: !35, line: 12, size: 128, align: 8, elements: !693)
!693 = !{!694, !123}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Message}", file: !10, size: 128, align: 8, elements: !697)
!697 = !{!369, !698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoReflect", file: !10, line: 12, baseType: !699, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !26}
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !35, line: 12, size: 128, align: 8, elements: !703)
!703 = !{!704, !123}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,FieldDescriptor)void,*func(*void)MessageDescriptor,*func(*void,FieldDescriptor)Value,*func(*void)RawFields,*func(*void,FieldDescriptor)bool,*func(*void)ProtoMessage,*func(*void)bool,*func(*void,FieldDescriptor)Value,*func(*void)Message,*func(*void,FieldDescriptor)Value,*func(*void)*struct{NoUnkeyedLiterals,uint64,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor,*__go_descriptor},*func(*void,*__go_descriptor)void,*func(*void,FieldDescriptor,Value)void,*func(*void,RawFields)void,*func(*void)MessageType,*func(*void,OneofDescriptor)FieldDescriptor}", file: !10, size: 1088, align: 8, elements: !707)
!707 = !{!369, !708, !1068, !1069, !1073, !1078, !1082, !1083, !1084, !1085, !1086, !1087, !1260, !1271, !1275, !1279, !1292}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Clear", file: !10, line: 12, baseType: !709, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!27, !26, !712}
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !713)
!713 = !{!714, !123}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Cardinality,*func(*void)MessageDescriptor,*func(*void)OneofDescriptor,*func(*void)Value,*func(*void)EnumValueDescriptor,*func(*void)EnumDescriptor,*func(*void)FullName,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)string,*func(*void)Kind,*func(*void)FieldDescriptor,*func(*void)FieldDescriptor,*func(*void)MessageDescriptor,*func(*void)Name,*func(*void)Number,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,FieldDescriptor)void,*func(*void)Syntax,*func(*void)string}", file: !10, size: 2112, align: 8, elements: !717)
!717 = !{!369, !718, !723, !727, !998, !1007, !1028, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1050, !1054, !1055, !1056, !1057, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Cardinality", file: !10, line: 12, baseType: !719, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !26}
!722 = !DIBasicType(name: "Cardinality", size: 8, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingMessage", file: !10, line: 12, baseType: !724, size: 64, align: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!650, !26}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ContainingOneof", file: !10, line: 12, baseType: !728, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !26}
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "OneofDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !732)
!732 = !{!733, !123}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FieldDescriptors,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,OneofDescriptor)void,*func(*void)Syntax}", file: !10, size: 832, align: 8, elements: !736)
!736 = !{!369, !737, !777, !778, !779, !780, !781, !782, !783, !991, !992, !993, !997}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Fields", file: !10, line: 12, baseType: !738, size: 64, align: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !26}
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !742)
!742 = !{!743, !123}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)FieldDescriptor,*func(*void,Name)FieldDescriptor,*func(*void,Number)FieldDescriptor,*func(*void,string)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 512, align: 8, elements: !746)
!746 = !{!369, !747, !751, !755, !760, !761, !765, !766}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ByJSONName", file: !10, line: 12, baseType: !748, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!712, !26, !67}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !752, size: 64, align: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!712, !26, !687}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ByNumber", file: !10, line: 12, baseType: !756, size: 64, align: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!712, !26, !759}
!759 = !DIBasicType(name: "Number", size: 32, encoding: DW_ATE_signed)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ByTextName", file: !10, line: 12, baseType: !748, size: 64, align: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !762, size: 64, align: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!712, !26, !71}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!27, !26, !770}
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "DoNotImplement", file: !35, line: 12, size: 128, align: 8, elements: !771)
!771 = !{!772, !123}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,DoNotImplement)void}", file: !10, size: 128, align: 8, elements: !775)
!775 = !{!369, !776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 12, baseType: !677, size: 64, align: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "IsSynthetic", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 12, baseType: !684, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 12, baseType: !784, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !26}
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", file: !35, line: 12, size: 128, align: 8, elements: !788)
!788 = !{!789, !123}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void)Syntax}", file: !10, size: 640, align: 8, elements: !792)
!792 = !{!369, !676, !681, !682, !683, !793, !794, !795, !989, !990}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 12, baseType: !796, size: 64, align: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !26}
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !800)
!800 = !{!801, !123}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)EnumDescriptors,*func(*void)ExtensionDescriptors,*func(*void)FullName,*func(*void)FileImports,*func(*void)int,*func(*void)bool,*func(*void)MessageDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)FullName,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void)string,*func(*void,DoNotImplement)void,*func(*void,FileDescriptor)void,*func(*void)ServiceDescriptors,*func(*void)SourceLocations,*func(*void)Syntax}", file: !10, size: 1216, align: 8, elements: !804)
!804 = !{!369, !805, !806, !820, !821, !842, !843, !844, !862, !863, !864, !865, !866, !867, !868, !869, !873, !949, !988}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Enums", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 12, baseType: !807, size: 64, align: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !26}
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !811)
!811 = !{!812, !123}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)FieldDescriptor,*func(*void,int)FieldDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !815)
!815 = !{!369, !816, !817, !818, !819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !752, size: 64, align: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !762, size: 64, align: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "FullName", file: !10, line: 12, baseType: !677, size: 64, align: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !10, line: 12, baseType: !822, size: 64, align: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !26}
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImports", file: !35, line: 12, size: 128, align: 8, elements: !826)
!826 = !{!827, !123}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int)FileImport,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 256, align: 8, elements: !830)
!830 = !{!369, !831, !840, !841}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !832, size: 64, align: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!835, !26, !71}
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileImport", file: !35, line: 12, size: 192, align: 8, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "FileDescriptor", file: !35, line: 12, baseType: !799, size: 128, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "IsPublic", file: !35, line: 12, baseType: !13, size: 8, align: 8, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "IsWeak", file: !35, line: 12, baseType: !13, size: 8, align: 8, offset: 136)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 12, baseType: !495, size: 64, align: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "IsPlaceholder", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Messages", file: !10, line: 12, baseType: !845, size: 64, align: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !26}
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !849)
!849 = !{!850, !123}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MessageDescriptor,*func(*void,int)MessageDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !853)
!853 = !{!369, !854, !858, !818, !819}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !855, size: 64, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!650, !26, !687}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !859, size: 64, align: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!650, !26, !71}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 12, baseType: !684, size: 64, align: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !10, line: 12, baseType: !677, size: 64, align: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 12, baseType: !92, size: 64, align: 64, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 896)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 12, baseType: !870, size: 64, align: 64, offset: 960)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!27, !26, !799}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Services", file: !10, line: 12, baseType: !874, size: 64, align: 64, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !26}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !878)
!878 = !{!879, !123}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !880, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)ServiceDescriptor,*func(*void,int)ServiceDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !882)
!882 = !{!369, !883, !945, !818, !819}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !884, size: 64, align: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !26, !687}
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !888)
!888 = !{!889, !123}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)bool,*func(*void)MethodDescriptors,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,ServiceDescriptor)void,*func(*void)Syntax}", file: !10, size: 768, align: 8, elements: !892)
!892 = !{!369, !676, !681, !682, !893, !935, !936, !937, !938, !939, !940, !944}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", file: !10, line: 12, baseType: !894, size: 64, align: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !26}
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptors", file: !35, line: 12, size: 128, align: 8, elements: !898)
!898 = !{!899, !123}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Name)MethodDescriptor,*func(*void,int)MethodDescriptor,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 320, align: 8, elements: !902)
!902 = !{!369, !903, !931, !818, !819}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ByName", file: !10, line: 12, baseType: !904, size: 64, align: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !26, !687}
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "MethodDescriptor", file: !35, line: 12, size: 128, align: 8, elements: !908)
!908 = !{!909, !123}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)FullName,*func(*void)int,*func(*void)MessageDescriptor,*func(*void)bool,*func(*void)bool,*func(*void)bool,*func(*void)Name,*func(*void)ProtoMessage,*func(*void)MessageDescriptor,*func(*void)Descriptor,*func(*void)FileDescriptor,*func(*void,DoNotImplement)void,*func(*void,MethodDescriptor)void,*func(*void)Syntax}", file: !10, size: 960, align: 8, elements: !912)
!912 = !{!369, !676, !681, !913, !779, !914, !915, !916, !917, !918, !919, !920, !921, !922, !926}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Input", file: !10, line: 12, baseType: !724, size: 64, align: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingClient", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "IsStreamingServer", file: !10, line: 12, baseType: !440, size: 64, align: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 12, baseType: !684, size: 64, align: 64, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Output", file: !10, line: 12, baseType: !724, size: 64, align: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 704)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 768)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 12, baseType: !923, size: 64, align: 64, offset: 832)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!27, !26, !907}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 12, baseType: !927, size: 64, align: 64, offset: 896)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!930, !26}
!930 = !DIBasicType(name: "Syntax", size: 8, encoding: DW_ATE_signed)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!907, !26, !71}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 12, baseType: !684, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ParentFile", file: !10, line: 12, baseType: !26, size: 64, align: 64, offset: 512)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoInternal", file: !10, line: 12, baseType: !767, size: 64, align: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoType", file: !10, line: 12, baseType: !941, size: 64, align: 64, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!27, !26, !887}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Syntax", file: !10, line: 12, baseType: !927, size: 64, align: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !10, line: 12, baseType: !946, size: 64, align: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!887, !26, !71}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "SourceLocations", file: !10, line: 12, baseType: !950, size: 64, align: 64, offset: 1088)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!953, !26}
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocations", file: !35, line: 12, size: 128, align: 8, elements: !954)
!954 = !{!955, !123}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !35, line: 12, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Descriptor)SourceLocation,*func(*void,SourcePath)SourceLocation,*func(*void,int)SourceLocation,*func(*void)int,*func(*void,DoNotImplement)void}", file: !10, size: 384, align: 8, elements: !958)
!958 = !{!369, !959, !978, !982, !986, !987}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ByDescriptor", file: !10, line: 12, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !26, !787}
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourceLocation", file: !35, line: 12, size: 960, align: 8, elements: !964)
!964 = !{!965, !970, !971, !972, !973, !974, !975, !976, !977}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !35, line: 12, baseType: !966, size: 192, align: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePath", file: !35, line: 12, size: 192, align: 8, elements: !967)
!967 = !{!968, !202, !203}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "StartLine", file: !35, line: 12, baseType: !71, size: 64, align: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "StartColumn", file: !35, line: 12, baseType: !71, size: 64, align: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "EndLine", file: !35, line: 12, baseType: !71, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "EndColumn", file: !35, line: 12, baseType: !71, size: 64, align: 64, offset: 384)
